
[{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 105,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": null,
    "AyahNumber": 1,
    "AyahTextQalam": "اَلَمْ تَرَ كَیْفَ فَعَلَ رَبُّكَ بِاَصْحٰبِ الْفِیْلِؕ",
    "Id": 6189,
    "SurahNumber": 105,
    "Tafseer": "1 Though the address apparently is directed to the Holy Prophet (upon whom be peace) , its real addressees are not only the Quraish but all the people of Arabia, who were well aware of the event. At many places in the Qur'an the words alam tara (have you not seen?) have been used, and they are meant not to address the Holy Prophet but the people in general. (For example, see Ibrahim: 19, AI-Hajj: 18, 65, An-Nur: 43, Luqman: 29, 31, Fatir: 27, Az-Zumar: 21) . Thee, the word 'seeing' has been used here to signify that in and around Makkah and in the vast country of Arabia, from Makkah to Yaman, there were many such people still living, who had witnessed with their own eyes the event of the destruction of the people of the elephant, for it had occurred only about forty to forty-five years earlier, and the people of Arabia had continually heard it described by the eye-witnesses themselves so that they had become so certain of it as though they had seen it with their own eyes. \n2 Here, Allah has not given any detail as to who were the people of the elephant, wherefrom they had come and what was the object of their march, for aII these things were well known among the people.",
    "Translation": null,
    "TranslationAbridged": "Have you not seen how your Lord dealt with the people of the elephants?"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "اَلَمْ یَجْعَلْ كَیْدَهُمْ فِیْ تَضْلِیْلٍۙ",
    "Id": 6190,
    "SurahNumber": 105,
    "Tafseer": "3 The word kayd is used for a secret plan meant to harm somebody. The question is, what was secret in this case? Sixty thousand troops together with several elephants had openly come from Yaman to Makkah, and they had kept no secret that they had come to destroy the Ka`bah. Therefore, there was nothing secret about this plan. However, what was secret was the motive of the Abyssinians. They by destroying the Ka`bah, crushing down the Quraish and intimidating the Arabians, wanted to take control of the trade route that led from south Arabia to Syria and Egypt. This motive they kept hidden, and instead proclaimed their intent that they wanted to destroy the Ka`bah., the principal House of Arab worship, in retaliation for the pollution of their cathedral by the Arabs. \n4 Literally, fi tadlil means: \"led their plan astray\", but idiomatically leading a plan astray means bringing it to nought and rendering it fruitless. At one place in the Qur'an, it has been said: \"But the disbelievers' plot (kayd) ended' in vain.\" (AI-Mu'min: 25) , At another: \"And that Allah does not lead to success the plan (kayd) of deceivers.\" (Yusuf: 52) . The Arabians described Imra' ul-Qais by the epithet of \"al-malik ad-dalil \" (the king who lost and wasted) , for he had lost the kingdom left by his father.",
    "Translation": null,
    "TranslationAbridged": "Did He not bring their plan to naught?"
},
{
    "Abridged": null,
    "AyahNumber": 3,
    "AyahTextQalam": "وَّ اَرْسَلَ عَلَیْهِمْ طَیْرًا اَبَابِیْلَۙ",
    "Id": 6191,
    "SurahNumber": 105,
    "Tafseer": "5 Ababil means many separate and scattered groups whether of men or other creatures, which come from different sides successively. 'Ikrimah and Qatadah say that these swarms of birds had come from the Red Sea side. Sa`id bin Jubair and 'Ikrimah say that such birds had neither been seen before nor ever after; these were neither birds of Najd, nor of Hijaz, nor of Timamah (the land between Hijaz and the Red Sea) . lbn 'Abbas says that their beaks were like those of birds and claws like the dog's paw. 'Ikrimah has stated that their heads were like the heads of the birds of prey, and almost all the reporters are agreed that each bird carried a stone in its beak and two stones in its claws. Sotne people of Makkah had these stones preserved with them for a long time. Thus, Abu Nu`aim has related a statement of Naufal bin Abi Mu`awiyah, saying that he bad seen the stones wich had been thrown on the people of the elephant; they equalled a small pea seed in size and were dark red in colour. According to Ibn `Abbas's tradition that Abu Nu`aim has related, they were equal to a pine kernel, and according to Ibn Marduyah, equal to a goat's dropping. Obviously, all the stones might not be equal but differing in size to some extent.",
    "Translation": null,
    "TranslationAbridged": "And He sent against them swarms of birds"
},
{
    "Abridged": null,
    "AyahNumber": 4,
    "AyahTextQalam": "تَرْمِیْهِمْ بِحِجَارَةٍ مِّنْ سِجِّیْلٍ۪ۙ",
    "Id": 6192,
    "SurahNumber": 105,
    "Tafseer": "6 Litrerally, bi hijarat-im-min sijjil means \"stones of sijjil type.\" Ibn `Abbas says that sijjil is the Arabic version of the Persian sang and gil, and it implies the stones made from clay and become hard when baked. The Qur'an also confirms the same. In Surah Hud :82 and Al-Hijr: 74, it has been said that stones of baked clay (sijjin were rained on the people of Lot, and about the same stones in Adh-Dhariyat: 33, it has been said that they were the stones made from clay (hijarat-im min tin) . \nMaulana Hamid-ad-Din Farahi, who in the present age has done valuable work on the research and determination of the meaning and content of the Qur'an regards the people of Makkah and other Arabians as the subject of tarmihim in this .verse, who are the addressees of alam tara. About the birds he says that they were not casting stones but had come to eat the dead bodies of the people of theelephant. A resume of the arguments he has given for this interpretation is that it is not credible that `Abdul Muttalib should have gone before ,Abrahah and demanded his camels instead of pleading for the Ka`bah, and this also is not credible that the people of Quraish and the other Arabs who had come for Hajj, did not resist the invaders and leaving the Ka`bah at their mercy had gone off to the mountains. Therefore, what actually happened was that the Arabs pelted the army of Abrahah with stones, and Allah by sending a stormy wind charged with stones, destroyed it completely; thee the birds were sent to eat the dead bodies of the soldiers. But, as we have already explained in the Introduction, the tradition does not only say that `Abdul Muttalib had gone to demand his camels but it says that he did not demand the camels at all but tried to dissuade Abrahah from attacking the Ka`bah. We have already explained that according to all reliable traditions, Abrahah's army had come in Muharram when the pilgrims had gone back and also it was beyond the power of Quraish and other Arab tribes living in the surrounding areas to resist and fight an army 60,000 strong. They had hardly been able to muster a force ten to twelve thousand strong on the occasion of the Battle of the Trench (Ahzab) with t he help of the Arab pagans and Jewish tribes then how could they have mustered courage to encounter an army, 60,000 strong? However. even if all these arguments are rejected and the sequence of the verses of Surah Al-Fil only is kept in view, this interpretation is seen to go against it. If it were so that the stones were cast by the Arabs and the people of the elephant were rendered as chaff, and then the birds came to eat their dead bodies, the order would be this: \"You were pelting them with stones of baked clay, then Allah rendered them as chaff eaten up, and then Allah sent upon them swarms of birds. \" but here we see that first Allah has made mention of sending swarms of birds; this is immediately followed by tarmihim bi-hijarat-im min-sijjil (which were pelting them with stones of baked clay) ; and then at the end it is said that Allah made them as straw eaten up.",
    "Translation": null,
    "TranslationAbridged": "which smote them with stones of baked clay,"
},
{
    "Abridged": "1 This refers to an incident that took place only 50 days before the Prophet’s birth. Abrahah, the Christian ruler of the Abyssinian kingdom of Yemen, led an expedition to Makkah with 60,000 troops. He was fired with the resolve to destroy the Ka[bah. His army had also brought along some elephants. When Abrahah reached a place that lies between Muzdalifah and Mina, there suddenly appeared swarms of birds carrying stones in their beaks and claws, which they pelted upon the Abyssinian army. Anyone who was hit by these stones soon started to rot, his flesh would start falling away from his bones. Thus the whole army was destroyed. This incident was well known in Arabia. At the time of the revelation of this surah there were still thousands of people in Makkah who had personally witnessed this incident. The Arabs accepted that the destruction of the “people of the elephants” had been brought about by God’s will and power.",
    "AyahNumber": 5,
    "AyahTextQalam": "فَجَعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ۠",
    "Id": 6193,
    "SurahNumber": 105,
    "Tafseer": "7 The word asfas used in the original has already occurred in verse 12 of Surah Ar-Rahman above: dhul-'asf war-raihan: \"and corn with husk as well as grain\". This shows that asf means the outer covering of seeds, which the farmer throws away after the grain has been separated from it. Then the animals eat it, and some of it falls down in the chewing and some is trampled under the hoofs.",
    "Translation": null,
    "TranslationAbridged": "and made them like straw eaten up (by cattle).1"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 106,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": null,
    "AyahNumber": 1,
    "AyahTextQalam": "لِاِیْلٰفِ قُرَیْشٍۙ",
    "Id": 6194,
    "SurahNumber": 106,
    "Tafseer": "1 The word ilaf, as used in the original is from alf which means to be habituated and accustomed to be reunited after breaking up, and to adopt something as a habit. About the lam that is prefixed to ilaf, some Arabists have expressed the opinion that it is to express surprise and wonder. Thus, Li-ilaf-i Quraish in means: \"How surprising is the conduct of Quraish! It is only by virtue of Allah's bounty that they are reunited after their dispersion and have become accustomed to the trade journeys which have brought them their prosperity,. and yet from Allah's worship and service they are turning away.\" 'This is the opinion of Akhfash, Kisa'i and Farra', and holding this opinion something after this lam, the same thing itself is regarded as sufficient to show that the attitude and conduct a person has adopted in spite of it, is surprising and amazing\". On the contrary, KhaIil bin Ahmad, Sibawaih and Zamakhshari say that this is the lam of to `lil and it relates to the following sentence: Fa! ya `budu Rabba hadh a!-Bait, which means: \"Allah's blessings on the Quraish are countless. But if for no other blessing, they should worship Allah at least for this blessing that by His bounty they became accustomed to the trade journeys, for this by itself is indeed a great favour of Allah to them. \"",
    "Translation": null,
    "TranslationAbridged": "Since the Quraysh became accustomed,"
},
{
    "Abridged": "1 These allude to the trade journeys undertaken by the Quraysh. In summer the Quraysh travelled northwards carrying merchandise to Syria and Palestine, and in winter they travelled southwards to southern Arabia. Their journeys had given rise to great prosperity.",
    "AyahNumber": 2,
    "AyahTextQalam": "اٖلٰفِهِمْ رِحْلَةَ الشِّتَآءِ وَ الصَّیْفِۚ",
    "Id": 6195,
    "SurahNumber": 106,
    "Tafseer": "2 That is, the trade journeys. In summer the Quraish travelled northward to Syria and Palestine, for they are cool lands, and in winter southward to Yaman, etc. for they are warm.",
    "Translation": null,
    "TranslationAbridged": "accustomed to the journey of winter and summer,1 "
},
{
    "Abridged": "2 “This House” here means the Ka[bah.",
    "AyahNumber": 3,
    "AyahTextQalam": "فَلْیَعْبُدُوْا رَبَّ هٰذَا الْبَیْتِۙ",
    "Id": 6196,
    "SurahNumber": 106,
    "Tafseer": "3 \"This House\": the Holy Ka'bah. The sentence means that the Quraish have attained to this blessing only by virtue of the House of Allah. They themselves acknowledge that the 360 idols, which they worship, are not its lord, but Allah alone is its Lord. He alone saved them from the invasion of the army of elephants. Him alone they had invoked for help against Abrahah's army. 'It was His House the keeping of which enhanced their rank and position in Arabia, for before that they were dispersed and commanded no position whatever. Like the common Arab tribes they too were scattered factions of a race. But when they rallied round this House in Makkah and began to serve it, they became, honourable throughout Arabia, and their trade caravans began to visit every part of the country fearlessly. Therefore, whatever they have achieved, it has been possible only by the help of the Lord of this House; therefore, they should worship Him alone.",
    "Translation": null,
    "TranslationAbridged": "therefore, let them worship the Lord of this House;2"
},
{
    "Abridged": "3 As Makkah was an inviolable city, the Quraysh had no fear of being attacked by any of the Arab tribes. Also, as keepers of the Ka[bah, their trade caravans passed freely throughout Arabia and no one molested them.",
    "AyahNumber": 4,
    "AyahTextQalam": "الَّذِیْۤ اَطْعَمَهُمْ مِّنْ جُوْعٍ١ۙ۬ وَّ اٰمَنَهُمْ مِّنْ خَوْفٍ۠",
    "Id": 6197,
    "SurahNumber": 106,
    "Tafseer": "4 The allusion implies that before the Quraish came to Makkah, they were a scattered people in Arabia and living miserable lives. After their gathering together in Makkah they began to prosper, and the Prophet Abraham's prayer for them was literally fulfilled when he had prayed: \"Lord, I have settled some of my descendents in a barren valley near Thy sacred House. Lord, I have done this in the hope that they will establish salat there. So turn the hearts of the people towards them, and provide fruits for their food.\" (Ibrahim: 37) \n5 \"Secure against fear\" : secure from the fear from which no one anywhere in Arabia was, safe. There was no settlement anywhere in the country the people of which could sleep peacefully at night, for they feared an attack any time from any quarter by some unknown enemy. No one could step out of the bounds of his tribe for fear of life or of being taken prisoner and made a slave. No caravan could travel safely from fear of attack, or without bribing influential chiefs of the tribes' on the way for safe conduct, But the Quraish were immune from every danger; they had no fear of an attack from an enemy. Their caravans, small or big, freely passed on the trade routes everywhere in the country. As soon as it become known about a certain caravan that it belonged to the keepers of the Ka`bah, no one could dare touch it with an evil intention, so much so that even if a single Quraishite was passing on the way, he was allowed to pass unharmed and untouched as soon as the word haram \" or \"ana min haramillah \" was heard from him.",
    "Translation": null,
    "TranslationAbridged": "Who fed them against hunger, and secured them against fear.3"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 107,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": null,
    "AyahNumber": 1,
    "AyahTextQalam": "اَرَءَیْتَ الَّذِیْ یُكَذِّبُ بِالدِّیْنِؕ",
    "Id": 6198,
    "SurahNumber": 107,
    "Tafseer": "1 The words \"have you seen\", apparently, are directed to the Holy Prophet (upon whom be peace) , but the Qur'anic style is that on such occasions it generally addresses every intelligent and thinking person. And \"seeing\" means seeing with the eyes, for what has been described in the succeeding verses can be seen by every seer with his eyes, as well as knowing, understanding and considering something deeply. If the word ara'aita is taken in the second meaning, the verse would mean: \"Do you know the kind of man who belies the rewards and punishments.\" Or: \"Have you considered the state of the person who belies the Judgment? \n2 The word ad-din as Qur'anic term is used for the rewards and punishments of the Hereafter as .well as for the religion of Islam. But the theme that . follows is more relevant to the first meaning, although the second meaning also is not out of the context: Ibn 'Abbas has preferred the second meaning, while a majority of the commentators have preferred the first. In case the first meaning is taken, the theme of the Surah would mean that denial of the Hereafter produces such and such a character in man; in case the second meaning is taken, the object of the Surah would be to highlight the moral importance of Islam, to stress that Islam aims at producing an altogether different character in its adherents from that found in its deniers. \n3 The style shows that the object of asking this question at the outset is not to ask whether he has seen the person or not, but to invite the listener to consider as to what kind of character is' produced in man when he denies the judgement of the Hereafter, and to urge him to know the kind of the people who belie this creed so that he tries to understand the moral significance of belief in the Hereafter.",
    "Translation": null,
    "TranslationAbridged": "Did you see him who gives the lie to the Reward and Punishment of the Hereafter?"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "فَذٰلِكَ الَّذِیْ یَدُعُّ الْیَتِیْمَۙ",
    "Id": 6199,
    "SurahNumber": 107,
    "Tafseer": "4 The letter fa in the sentence fa-dhalika-alladhi expresses the meaning of a whole sentence, which is to this effect: \"If you do not know, then know that it is indeed he who...\" Or, it gives the meaning: \"Because of his this very denial of the Hereafter he is the kind of man who... \" \n5 The sentence yadu `ul yatim as used in the original, has several meanings: (1) That he deprives the orphan of his rights and evicting him from his father's heritage thrusts him away; (2) that if an orphan comes to ask him for help, he repulses him instead of showing him any compassion, and if he still persists in his entreaties in the hope for mercy, he drives him away and out of sight; (3) that he ill-treats the orphan. For example, if in his own house there is a closely related orphan, it is the orphans lot to serve the whole house, to receive rebuffs and suffer humiliation for trivial things. Besides, this sentence also contains the meaning that - the person does not behave unjustly and tyrannically only occasionally put this is his habit and settled practice. He does not have the feeling that it is an evil which he must give up, but he persists in it with full satisfaction, thinking that the orphan is a helpless, powerless creature; therefore, there is no harm if his rights are taken away wcongfitlly, or he is made the target of tyranny and injustice, or he is repulsed and driven away whenever he asks for help. \nIn this connection, Qadi Abul Hasan al-Mawardi has related a strange incident in his A lam an-Nubuwwat. Abu Jahl was the testator of an orphan. The child one. day came to him in the condition that he had no shred of a garment on his body and he implored him to be .given something out of his father's heritage. But the cruel man paid no attention to him and the poor child had to go back disappointed. The Quraish chiefs said to him out of fun: \"Go to Muhammad (upon whom be Allah's peace and blessings) and put your complaint before him. He will recommend your case before Abu Jahl and get you your property.\" The child not knowing any background of the nature of relationship between Abu Jahl and the Holy Prophet (upon whom be peace) and not understanding the motive of the mischief-mongers, went straight to the Holy Prophet and apprised him of his misfortune. The Holy Prophet immediately arose and accompanied the child to the house of Abu Jahl, his bitterest enemy. Abu Jahl received him well and when the latter told him to restore to the child his right, he yielded and brought out whatever he owed to him. The Quraish chiefs were watching all this earnestly m the hope that an interesting altercation would take place between them. But when they saw what actually happened they were astounded and went to Abu Jahl and taunted him saying that he too perhaps had abandoned his religion. He said: \"By God, I have not abandoned my religion, but I so felt that on the right and left of Muhammad (upon whom be Allah's peace and blessings) there was a spear which would enter my -body if I acted against what he desired. \" This incident not only shows what was the attitude and conduct of the principal chiefs of the most civilized and noble tribe of Arabia towards the orphans and other helpless people in those days but it also shows what sublime character the Holy Prophet possessed and what impact it had even on his bitterest enemies. A similar incident we have already related in E.N. 5 of Surah Al-Anbiya' above, which points to the great moral superiority of the Holy Prophet because of which the disbelieving Quraish branded him as a sorcerer.",
    "Translation": null,
    "TranslationAbridged": "Such is the one who repulses the orphans away,"
},
{
    "Abridged": "1 That is, he neither persuades himself to feed the needy, nor urges his kinsfolk to do so, nor asks others to assist the poor.\n",
    "AyahNumber": 3,
    "AyahTextQalam": "وَ لَا یَحُضُّ عَلٰى طَعَامِ الْمِسْكِیْنِؕ",
    "Id": 6200,
    "SurahNumber": 107,
    "Tafseer": "6 La yahuddu means that the person neither persuades his own self, nor tells the people of his household, to provide the poor man with his food, nor dces he urge others to recognize the rights of the poor and needy people of society who are starving and do something to satisfy their hunger. Here, by giving only two conspicuous examples, Allah has pointed out what kind of evils are produced in the people who deny the Hereafter: The real object is not to point out only these two evils-that the people drive away the orphans and do not urge giving away the food of the poor as a result of the denial of the Hereafter. But of the countless evils which are thus produced, two evils have been presented as an example, which every noble and sound-natured person will regard as hateful. Besides, another thing meant to be impressed is that if this very man had believed at he would have to go before God to render an account of his deeds, he would not have committed such evils as to deprive the orphan of his rights, tyrannize him, repulse him, neither feed the poor man himself nor urge others to give him his food. The characteristics of the believers in the Hereafter which have been described in Surah Al-`Asr and Surah Al-Balad are that they exhort one another to mercy, and they exhort one another to the truth and to render the rights of others. \n7 The words used are to `am-il-miskIn and not it am-il-miskin If to am-il-miskin were the words, the meaning would be that he does not urge (others) to feed the poor. But ta'am -il-miskin means that he does not urge (others) to give away the food of the poor. In other words, the food that is given to the poor man is not the food of the giver but of the poor man himself; it is his right which is enjoined on the giver, and the giver is not doing him any favour but rendering him his right. This same thing had been said in Surah Adh-Dhariyat above: \"And in their possessions is a due share of him who asks and of him who is. needy.\" (v. 19) .",
    "Translation": null,
    "TranslationAbridged": "and urges not the feeding of the needy.1"
},
{
    "Abridged": null,
    "AyahNumber": 4,
    "AyahTextQalam": "فَوَیْلٌ لِّلْمُصَلِّیْنَۙ",
    "Id": 6201,
    "SurahNumber": 107,
    "Tafseer": "8 The fa in fa-wail-ul -lil-musallin signifies that such was the condition ofthe open deniers of the Hereafter. One may then consider the condition of the hypocrites who are included among the praying ones (i e. Muslims) . Since, despite being Muslims they regard the Hereafter as a falsehood, one may note what path of ruin they are following. Though \"musallin\" means \"the praying ones\", in view of the context in which this word has been used and the characteristics of these people that follow, this word, in fact, does not have the meaning of \"the praying ones\" but of \"the people of salat\", i.e. of those included among Muslims.",
    "Translation": null,
    "TranslationAbridged": "Woe, then, to those who pray,"
},
{
    "Abridged": "2 This does not mean forgetting something during Prayer, but being heedless of Prayer itself.\n",
    "AyahNumber": 5,
    "AyahTextQalam": "الَّذِیْنَ هُمْ عَنْ صَلَاتِهِمْ سَاهُوْنَۙ",
    "Id": 6202,
    "SurahNumber": 107,
    "Tafseer": "9 The words used are an-salat-i him sahun and not fi salat-i-him lahum. In case the words fi salat-i him had been used, the meaning would be that they forget in the course of their Prayer.' But forgetting in the course of the Prayer is no sin in the eyes of the Shari `ah, nothing to say of its being hypocrisy, nor is it a fault or anything blameworthy. The Holy Prophet (upon whom be peace) himself sometimes forgot in the Prayer a nd to compensate for it he prescribed the method of sajdah sahv. On the contrary, `an salat-i-him sahum means that they are neglectful of their Prayer. Whether they perform the Prayer, or do not perform it, it is of little importance to them. They are not regular at the Prayers. When they perform it, they do not observe the prescribed times, but offer it carelessly at the eleventh hour. Or, when they rise up for the Prayer, they rise up soullessly and perform it with an unwilling heart, as if it were a calamity imposed on them. They play with their garments, yawn and betray absence of every trace of Allah's remembrance in their hearts. Throughout the Prayer they show no feeling at all that they are performing the Prayer, nor of what they are reciting; their minds wander and they perform articles of the Prayer without due attention; they somehow perform a semblance of the Prayer and try to be rid of it as soon as ,possible. And there are many people who would perform the Prayer only when they must, otherwise the Prayer has no place in their lives. The Prayer time comes but they show no concern that it is the Praver time; they hear the call to the Prayer but do not understand what the caller is calling to, whom he is calling and for what purpose. These in fact are the signs of absence of faith in the Hereafter. The claimants to Islam believe thus only because they do not believe that they would be rewarded for performing the Prayer, nor have the faith that they would be punished for not performing it. On this very basis, Hadrat Anas bin Malik and `Ata bin Dinar say: \"Thanks to God that he said 'an salat-i-him and not fi salat-i -him. That is, we do forget in the course of the Prayer but we are not forgetful and neglectful of it; therefore, we shall not be counted among the hypocrites.\" \nThe Qur'an at another place has described this state of the hypocrites, thus: \"They come to offer their Prayer but reluctantly, and they expend in the way of Allah with unwilling hearts.\" (At-Taubah: 54) . The Holy Messenger of Allah has said: \"This is the Prayer of the hypocrite; this is the Prayer of the hypocrite; this is the Prayer of the hypocrite ! He watches the sun at the `Asr time until when it reaches between the two horns of Satan (i.e. when the time of sunset 'approaches) , he gets up and performs the Prayer carelessly, in which he remembers Allah but little.\" (Bukhari, Muslim, Musnad Ahmad) Mus'ab bin Sa`d has related from his father, Hadrat Sa`d bin Abi Waqqas: \"When I asked the Holy Prophet (upon whom be peace) about the people who are neglectful of their Prayer, he said: \"These are the people who perform their Prayers when the prescribed time for it has passed.\" (Ibn Jarir, Abu Ya'la, Ibn al-Mundhir, Ibn abI Hatim, Tabarani in Ausat; Ibn Marduyah, Baihaqi in As-Sunan. This tradition has been related as a statement of Hadrat Sa`d himself also as a mauquf hadith and its sanad is stronger. Its being a marfu' narration of the saying of the Holy Prophet (upon whom be peace) . has been regarded as weak by Baihaqi and Hakim) . Another tradition from Hadrat Mus'ab is that he asked his father: \"Have you considered this verse? Does it mean giving up the Prayer, or wandering of one's attention in the course of the Prayer?-Who among us has not his attention divided? He replied: No, it implies wasting the prescribed time of the Prayer and performing it when its time has elapsed.\" (Ibn Jarir, Ibn Abi Shaibah, Abu Ya`la, Ibn al-Mundhir, Ibn Marduyah, Baihaqi in As-Sunan) : Here, one should understand that coming of other thoughts in the mind in the course of the. Prayer is one thing and bing unmindful of the Prayer and thinking other things during it quite another. The first state is a natural human weakness. Other thoughts do interfere without intention, and as soon as a believer 'feels that his attention is wandering from the Prayer. he gathers it and brings it back to the Prayer. The other state is of being neglectful of the Prayer, for in it man only goes through an exercise of the Prayer mechanically, he has no intention of the remembrance of God in his heart. From the commencement of the Prayer till its completion his heart is not turned towards God even for a moment, and he remains engrossed in the thoughts with which he entered the Prayer.",
    "Translation": null,
    "TranslationAbridged": "but are heedless in their Prayers,2"
},
{
    "Abridged": null,
    "AyahNumber": 6,
    "AyahTextQalam": "الَّذِیْنَ هُمْ یُرَآءُوْنَۙ",
    "Id": 6203,
    "SurahNumber": 107,
    "Tafseer": "10 This can be an independent sentence as well as one relating to the preceding sentence. In the first case, it would mean that they do not perform any act of goodness with a pure intention for the sake of God, but whatever they do , they do to be seen of others so that they are praised, are considered righteous, their good act is publicised and its advantage and benefit accrues to them here in the world. In the second case, the meaning would be that they pray to be seen. The commentators generally have preferred the second meaning, for at first sight it appears that it relates to the preceding sentence. Ibn `Abbas says: \"It implies the hypocrites who prayed to be seen. They performed the Prayer if there was somebody to see them, but did not perform it if there was nobody to see them.\" In another tradition his words are to the effect: \"If they were alone they did not pray; but if there were others, they prayed. \". (Ibn Jarir, Ibn al-Mundhir, Ibn Abi Hatim , Ibn Marduyah, Baihaqi , in Ash-Shu ab) . In the Qur'an too the hypocrites have been described thus: \"When they rise up for the salat, they go reluctantly to it, merely to be seen of people and they remember Allah but little.\" (An-Nisa': 142) .",
    "Translation": null,
    "TranslationAbridged": "those who do good (in order) to be seen,"
},
{
    "Abridged": null,
    "AyahNumber": 7,
    "AyahTextQalam": "وَ یَمْنَعُوْنَ الْمَاعُوْنَ۠",
    "Id": 6204,
    "SurahNumber": 107,
    "Tafseer": "11 The word used is ma'un. The view held by Hadrat `Ali, Ibn `Umar, Sa`id bin Jubair, Qatadah, Hasan Basri, Muhammad bin Hanafiyyah, Dahhak, Ibn Zaid, `Ikrimah, Mujahid, `Ata' and Zuhri (may Allah show them mercy) is that it implies the zakat while Ibn `Abbas, Ibn Mas`ud, Ibrahim Nakha`i, Abu Malik and many other scholars have expressed the opinion that it implies items of common use; for example, cooking-pot, bucket, hatchet, balance, salt, water, fire, flint (now its successor, the match-stick) , etc. which the people generally borrow from each other. A statement of Sa'id bin Jubair and Mujahid also supports it. Another view of Hadrat 'Ali also is that it implies the zakat as well as the little courtesies and kindnesses of daily Iife. Ibn Abi Hatim has related from `Ikrimah that ma'un of the highest form is zakat and of the lowest lending of a sieve, bucket, or needle to a barrrower. Hadrat `Abdullah bin Mas`ud says: \"We, the Companions of Muhammad (upon whom be Allah's peace) , used to say (and according to other traditions, in the time of the Holy Prophet, used to say) that ma `un implies lending of the cooking pot, hatchet. bucket, balance, and such other things.\" (Ibn Jarir. Ibn Abi Shaibah, Abu Da'ud, Nasa'i, Bazzar, Ibn al-Mundhir, Ibn Abi Hatim, Tabarani in AI-Ausat, Ibn Marduyah, Baihaqi in As-Sunan) . Sa`d bin 'Iyad without specifying any names has related almost the same view from the Companions of the Holy Prophet (upon whom be peace) , which shows that he had heard this from several Companions. (Ibn Jarir, Ibn Abi Shaibah) . Dailami, Ibn `Asakir, and Abu Nu`aim have related a tradition from Hadrat Abu Hurairah in which he says that the Holy Prophet (upon whom be peace) himself explained this verse saying that it implies the hatchet, bucket and other such things. If this tradition is genuine it probably did not come to the notice of other scholars; otherwise it was not possible that other people should have given any other commentary of this verse. \nMa`un in fact is a small, little thing useful to the people. Accordingly, zakat also is ma`un, for it is a little amount out of much wealth, which one has to give away in order to help the poor, and the other small items of common use also are ma 'un as mentioned by Hadrat `Abdullah.Ibn Mas`ud and the scholars who share his viewpoint. The majority of the commentators say that ma `un applies to all those small things which the neighbours usually ask each other for, and asking for these is not in any way blameworthy, for the rich and the poor, all stand in need of these at one time or another. However, to show stinginess in lending these is regarded as mean behaviour morally. Generally these things by themselves last and the neighbour returns them in the original form after he has used them. It would also be maim if a neighbour asks the other for a bed or bedding items on the arrival of guests, or asks the neighbour's permission to have loaves baked in his, oven, or wants to leave some valuables in the neighbour's custody when going out of his house for some days. Thus, the verse means to impress that denial of the Hereafter renders a man so narrow-minded and niggardly that he is not even prepared to make a most minor sacrifice for the sake of others.",
    "Translation": null,
    "TranslationAbridged": "and deny people the articles of common necessity."
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 108,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 Kawthar signifies abundant good both in this world and the Hereafter. This includes the Fountain of Kawthar on the Day of Resurrection and the Stream of Kawthar in Paradise.",
    "AyahNumber": 1,
    "AyahTextQalam": "اِنَّاۤ اَعْطَیْنٰكَ الْكَوْثَرَؕ",
    "Id": 6205,
    "SurahNumber": 108,
    "Tafseer": "1 The full meaning of the word kauthar, as used here, cannot perhaps be expressed in one word in any language of the world. This is an intensive form of the noun kathrat which literally means abundance, but the context in which it has been used does not give the meaning of mere abundance but abundance of good, of spiritual benefits and blessings, and of such abundance which is unbounded and limitless, and it dces not imply any one good or benefit or blessing but abundance of countless benefits and blessings. Have a look again at the background of this Surah given in the Introduction. The enemies thought that Muhammad (upon whom be Allah's peace and blessings) had been completely ruined: he was cut off from the community and had become utterly helpless and powerless; his trade was ruined; his male children who could perpetuate his name were dead; the message that he presented was such that except for a handful of the people no one in entire Arabia, not to speak of Makkah, was prepared to listen to it therefore, failure and disappointment would be his lot as long as he lived and there would be no one in posterity to remember him when he died. Under such conditions when Allah said: \"We have granted you the Kauthar,\" it by itself gave the meaning: Your foolish opponents think that you are ruined and deprived of the good things that .you enjoyed before Prophethood, but the fact is that We have favoured you with unbounded good and countless blessings.\" This included the matchless moral qualities which the Holy Prophet was blessed with; this included the great blessings of Prophethood and the Qur'an, the knowledge and wisdom that were granted to him; this included the blessing of Tauhid and also of such a system of life, whose simple and intelligible, rational and natural, and comprehensive principles had the potential to spread throughout the world and of continuing to spread for ever afarwards. This also included the blessing of the exaltation of renown because of which the holy Prophet's blessed name continues to be exalted throughout the world since 1400 years and will continue to be so exalted till Resurrection. This also included the blessing that by his preaching eventually such a world-wide community came into being, which became the standard-bearer of Truth in the world for ever, which can claim to have produced the greatest number of the pious, virtuous and noble charactered rnen in any one nation, and which even when corrupted and deprived has the highest good in it as against every other nation of the world. This also included the blessing that the Holy Prophet during his very lifetime witnessed his invitation and message attaining to the highest success and the preparation of a community which had the power to dominate the world. This also included the blessing that although on his being deprived of the male offspring the enemies thought he would be lost to posterity, yet Allah not only blessed him with the spiritual offspring in the form of Muslims, who will continue to exalt his name in the world till Resurrection but also granted him from his one daughter, Hadrat Fatimah, the natural progeny, who have spread throughout world and whose only mark of distinction and pride is that they trace their descent from him. \nThese are the blessings which the people have seen and witnessed as to how abundantly Allah has blessed His Holy prophet within the world. In addition, Kauthar also implies two udtrr great blessings which Allah will bestow on him in the Hereafter. We had no means of knowing these; therefore the Holy Prophet (upon whom be peace) himself gave us news of them, and told us that Kauthar also implied them. First, the Fountain of Kauthar, which he will be granted on the Resurrection Day in the Plain of Assembly; second, the River Kauthar, which he will be granted in Paradise. About both such a large number of the Ahadith have been reported from him through such a large number of the reporters that there remains no doubt about their authenticity. \nWhat the Holy Prophet said about the fountain of Kauthar is as follows: \n(1) This Fountain will be granted to him on the Resurrection Day when there will be the cry of al- atash, al- atash (thirst, thirst!) on every side. The Holy Prophet's community will gather together before him at it and will be watered thereby. He himself will be the first to arrive at it and will be occupying the central position. He has said: \"This is a Fountain at which my Ummah will assemble on the Resurrection Day.\" (Muslim: KItab as- Salat Abu Da'ud: Kitab as-Sunnah) . \"I shall have arrived at the Fountain before you. \" (Bukhari: Kitab ar-Riqaq and Kitab al-Fitan; Muslim: Kitab a!-Fida and Kitab at-Taharah; lbn Majah,: Kitab al Manasik and Kitab az-Zuhd. Musnad Ahmad: Marwiyyat `Abdullah bin Mas'ud `Abdullah bin `Abbas, Abu Hurairah. \"I shall be there before you and shall bear witness on you, and by God, I am seeing my Fountain even at this time.\" (Bukhari: Kitab al-jana-iz Kitab al-Maghazi, Kitab ar-Riqaq) . Addressing an assembly of the Ansar, the Holy Prophet once said: \"After me you will meet with selfishness and nepotism, endure it patiently until you meet me at the Fountain. \" (Bukhari: kitab Manaqib al-Ansar and Kitab al-Maghazi; Muslim: Kitab al-Iman; Tirmidhi:Kitab al-Fitan) . \"I shall be near the middle of the Fountain on the Resurrection Day.\" Muslim: Kitab al-Fada'il) . Hadrat Abu Barzah Aslami was asked: \"Have you heard something about the Fountain from the Holy Prophet? He replied: Not once, or twice, or thrice, or four or five times, but over and over again. May Allah deprive of its water the one who be lies it.\" (Abu Da'ud: Kitab as-Sunnah) . \"Ubaidullah bin Ziyad thought that the traditions about the Fountain were false; so much so that he belied all the traditions reported by Hadrat Abu Barzah Aslami, Bara' bin 'Azib and `A'idh bin 'Amr. At last, Abu Sabrah brought out a writing which he had written down after hearing it from Hadrat `Abdullah bin 'Amr bin al-`As, and it contained this saying of the Holy Prophet: \"Beware! your place of meeting me will be my Fountain.\" (Musnad Ahmad: Marwiyyat 'Abdullah bin 'Amr bin al-'As) . \n(2) Different dimensions of the Fountain have been given in different traditions, but according to a large number of the traditions it will extend from Aylah (the present Israeli seaport of Ilat) to Sana'a of Yaman, or from Aylah to Adan, or from 'Amman to `Adan in length, and from Aylah to Juhfah (a place between Jeddah and Rabigh) in breadth. (Bukhari: Kitab ar-Riqaq; Abu Da'ud at Tayalisi: Hadith No. 995; Musnad Ahmad: Marwiyyat Abu Bakr Siddiq and `Abdullah bin `Umar; Muslim: Kasab al-Taharah and Kitab al-Fads il; Tirmidhi Abwab Sifat al-Qiyamah; Ibn Majah: Kitab az-Zuhd) . From this it appears that on the Resurrection Day the present Red Sea itself will be turned into the Fountain of Kauthar. And the correct knowledge is only with Allah! \n(3) About this Fountain the Holy Prophet hes told us that water will be supplied to it from the River Kauthar of Paradise (which is being mentioned below) . \"Two channels from Paradise will flow into it and supply water to it.\" (Muslim: Kitab al-Fada il) . According to another tradition: \"A canal from the River Kauthar of Paradise will be opened towards this Fountain. \" (Musnad Ahmad Marwiyyat `Abdullah bin Mas`ud) . \n(4) According to the description of it given by the Holy Prophet its water will be whiter than milk (according to other traditions whiter than silver, and according to still others, whiter than snow) , cooler than snow, sweeter than honey; the earth of its bed will be more fragrant than musk; the water jugs set at it will be as numerous as the stars in the sky; the one who drinks from it would never thirst; and the one who is deprived of it will never have his thirst satisfied. These things with a little variation in wording have been reported in numerous Ahadith (Bukhari: Kitab ar-Rigaq; Muslim: Kitab at-Taharah and Kitab al-Fada'il; Musnad Ahmad: Marwiyyat Ibn Mas`ud, Ibn `Umar, `Abdullah bin 'Amr bin al-`As; Tirmidhi: Abwab Sifat al-Qiyanmah: Ibn Majah: Kitab az-Zuhd; Abu Da'ud: Tayalisi, Ahadith No. 995, 2135) . \n(5) Concerning it the Holy Prophet warned the people of his time again and again, saying: \"after me those from among you who would effect changes in my Way, will be removed from the Fountain and will be disallowed to approach it. I shall say: they are my companions, but it will be said: \"Don't you know what they did after you? Then I too shall discard them and tell them to keep away.\" This subject too has been expressed in many traditions. (Bukhari: Kitab ar-Rigaq, Kitab al-Fitan; Muslim: Kitab al-Tahara and Kitab al-Fada'it Musnad Ahmad: Marwiyyat !bn Mas`ud, Abu Hurairah; Ibn Majah: Kitab al-Manasik. The Hadith which Ibn Majah has related in this connection contains very pathetic words. The Holy Prophet said: \"Beware! I shall have arrived at the Fountain before you and shall pride myself by your means upon the greater numbers of my Ummah as against other ummahas Do not at that time cause my face to be blackened. Beware: I shall have some people released, and some people shall be separated from me. I shall say: O my Lord, they are my companions. He will reply: Don't you know what innovations they introduced after you?\" According to Ibn Majah, these words were said by the Holy Prophet (upon whom be peace) in his Sermon at `Arafat. \n(6) Likewise, the Holy Prophet has also warned the Muslims coming after him till Resurrection, saying: \"Whoever from among you will swerve from my Way and effect changes in it, will be removed from the Fountain. I shall say: O Lord, they belong to me, they are the people of my Ummah. In response it will be said: Don't you know what changes they effected after you and then turned back on their heels? Then I too shall turn them away and shall not allow them to approach the Fountain. \" Many traditions on this subject are found in the Hadith. (Bukhari: Kitab al-Musaqat, Kitab ar-Rigaq, Kitab al-Fitan; Muslim: Kitab at-Taharah. Katab as-Salat, Kitab al-Fada il; Ibn Majah: Kitab az-Zuhd; Musnad Ahmad: Marwiyyat Ibn `Abbas) . \nTraditions about this Fountain have been related by more than 50 companions, and the earliest scholars generally have taken it to mean the Fountain of Kauthar. Imam Bukhari has named the last chapter of his Kitab ar-Rigaq as Babun fil hawd wa qual-Allahu inna a `tainak al-Kauthar, and in a tradition from Hadrat Anas there is the explanation that the Holy Prophet said about Kauthar: \"It is a Fountain at which my Ummah shall alight. \" \nThe River Kauthar which the Holy Prophet (upon whom be peace) shall be granted in Paradise, also has been mentioned in a large number of the traditions cf Hadith. Many traditions have been related on the authority of Hadrat Anas in which he says (and in some he explains that he is reporting the exact words of the Holy Prophet himself) that on the occasion of mi'raj; the Holy Prophet was taken round Paradise and shown a river on the banks of which there were vaults of pearls or precious stones carved from within; the earth of its bed was of the strong scented musk. He asked Gabriel, or the angel who took him round, what it was. He replied that it was the River Kauthar, which Allah had granted him. (Musnad Ahmad, Bukhari, Muslim, Abu Da'ud, Tirmidhi, Abu Da'ud Tayalisi, Ibn Jarir) Again, according to Hadrat Anas, the Holy Prophet was asked (or a person asked him) : \"What is the Kauthar?' He replied; \"It is a River which Allah has granted me in Paradise. Its earth is musk: its water is whiter than milk and sweeter than honey \" (Musnad Ahmad, Tirmidhi, lbn Jarir; according to another tradition of Musnad Ahmad, describing the merits of the River Kauthar the Holy Prophet said that at its bottom there are pearls instead of pebbles. Ibn `Umar says that the Holy Prophet said: \"The Kauthar is a river in Paradise the banks of which are golden; it flows on pearls and diamonds (i.e. its bed has diamonds instead of pebbles) ; its earth smells sweeter than musk; its water is whiter than milk (or snow) , cooler than snow and sweeter than honey.\" (Musnad Ahmad, Tirmidhi, Ibn Majah, Ibn Abi Hatim, Darimi, Abu Da'ud Tayalisi, Ibn al-Mundhir, Ibn Marduyah, Ibn Abi Shaibah) . Usamah bin Zaid says that the Holy Prophet once went to visit Hadrat Usamah; he was not at home; his wife entertained him and during the conversation said \"My husband has told me that you have been granted a river in Paradise, which is called the Kauthar.\" The Holy Prophet replied \"Yes, and its bed is of rubies and corals and emeralds and pearls\" (Ibn Jarir, Ibn Marduyah. Though the sanad of this tradition is weak, the presence of a large number of traditions dealing with this subject strengthens it) . Besides these marfu traditions, a great many sayings of the Companions and their successors have been related in the Hadith to the effect that the Kauthar implies a river in Paradise. These traditions describe its qualities as have been mentioned above. For instance, the sayings of Hadrat 'Abdullah bin `Umar, Hadrat `Abdullah bin `Abbas, Hadrat Anas bin Malik, Hadrat `A'ishah, Mujahid and Abul `Aliysh are found in Musnad Ahmad, Bukhari, Tirmidhi, Nasa'i'; and the books of Ibn Marduyah, Ibn Jarir, Ibn Abi Shaibah and other traditionists.",
    "Translation": null,
    "TranslationAbridged": "(O Prophet), We have surely bestowed upon you good in abundance.1"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "فَصَلِّ لِرَبِّكَ وَ انْحَرْؕ",
    "Id": 6206,
    "SurahNumber": 108,
    "Tafseer": "2 Different commentaries of it have been reported from different scholars. Some of them take the Prayer to mean the five times obligatory Prayer (salat) ; some take it to imply the Prayer of `Id al-Adha, and some say that it implies the Prayer itself. Likewise, the meaning of wanhar and sacrifice according to some illustrious scholars, is to place the right hand over the left hand and to fold them on the chest in the Prayer; some say that it implies raising both hands with Allahu Akbar at the commencement of the Prayer; some say that it implies raising both hands at the commencement of the Prayer, at bowing for Ruku `and after rising from Ruku `; and some say that it means performing the `Id al-Adha Prayer and then offering the animal sacrifice. But if the context in which this command has been enjoined, is considered, its meaning clearly seems to be: \"O Prophet, when your Lord has granted you so many and so splendid blessing, then you should perform the Prayer only for His sake and offer sacrifice only for His sake.\" This Command was given in the environment when not only the pagans of Quraish but the pagans of entire Arabia and the world worshipped their self-made gods and offered sacrifices at their shrines. Therefore, the intention of the Command is \"Contrary to the polytheistic practice, you should remain steadfast to your creed: your Prayer is only for Allah and your sacrifice also is for Him alone, as it has been said at another place: `Declare, O Prophet, my salat and my sacrifice and my life and my death are all for Allah, Lord of the universe, Who has no partner with Him. This is what I have been enjoined, and I am the first to surrender to Him.'(Al-An`am:162-163) . This same meaning has been explained of it by Ibn 'Abbas. `Ata`, Mujahid, `Ikrimah, Hasan Bari, Qatadah, Muhammad bin Ka`b al-Kurzi, Dahhak, Rabi`bin Anas, `Ata`al-Khurasani and many other major commentators (may Allah bless them all) (Ibn Jarir) . However, this by itself is correct that when the Holy Prophet (upon whom be peace) enforced by Allah's command the practice of the `Id al-Adha Prayer and the offering of animal sacrifice at Madinah, he himself gave the first place to the Prayer (salat and the second to the sacrifice, as commanded in the verses: Inna salati wa nusuki and fa-salli li-Rabbika wanhar, and enjoined an the Muslims also to do the same, i.e. they should first perform the Prayer and then offer the sacrifice. This is neither the explanation of this verse nor the occasion of its revelation but a deduction made by the Holy Prophet from these verses and his deduction of injunctions also is a kind of Divine inspiration.",
    "Translation": null,
    "TranslationAbridged": "So offer Prayer and sacrifice to your Lord alone."
},
{
    "Abridged": "2 The unbelievers called the Prophet abtar (cut off from the roots). They said so to stress that he had been alienated from his people and that none of his male issue survived. They therefore believed that in the course of time no trace would be left of him. Here it is being pointed out that such a fate will overtake the Prophet’s enemies rather than him.",
    "AyahNumber": 3,
    "AyahTextQalam": "اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ۠",
    "Id": 6207,
    "SurahNumber": 108,
    "Tafseer": "3 The word shani' as used, in the original is derived from sha 'n, which means the hatred and spite because of which a person may start ill-treating another. At another place in the Qur'an it has been said: \"(And O Muslims,) the enmity of any people should not so provoke you as to turn you away from justice.\" (AI-Ma'idah: 8) . Thus, shani aka implies every such person who blinded by his enmity of the Holy Prophet (upon whom be peace) should bring false accusations against him, slander and defame him and vent his personal spite against him by taunting and scoffing at him in every possible way. \n4 Huwa'/ abtar: \"He himself is abtar\", i.e. though he calls you abtar he in fact himself is abtar. Some explanations of abtar have already been given in the Introduction to the Surah. It is derived from batar which means to cut off, but idiomatically it is used in a comprehensive meaning. In the Hadith, the rak ah of the Prayer which is not coupled with another rak'ah is called butaira', i.e. the lonely rak ah. According to another Hadith \"Every piece of work, which is in any way important, is abtar if it is started without the glorification and praise of Allah\", implying that it is cut off from the root, It has no stability, and it is doomed to failure. A man who fails to achieve his object is abtar as also the one who is deprived of all means and resources. A person who is left with no hope of any good and success in life is also abtar. A person who has been cut off from his family, brotherhood, associates And helpers is also abtar. The word abtar is also used for the man who has no male child, or whose male child or children have died, for after him there remains no one to remember him and he is lost to posterity . after death. In almost alI these meanings the disbelieving Quraish called the Holy Prophet (upon whom be peace) abtar. At this, Allah said: \"O Prophet, not you but your enemies are abtar.\" This was not merely a \"reprisal\", but a prophecy out of the most important prophecies of the Qur'an, which literally proved true. when it was made, the people regarded the Holy Prophet as abtar, and no one could imagine how the big chiefs of the Quraish would become abtar, who were famous not only in Makkah but throughout Arabia, who were successful in life, rich in worldly wealth and children, who had their associates and helpers everywhere in the country, who enjoyed intimate relations with all the Arabian tribes, being monopolists in trade and managers of Hajj But not long afterwards the conditions altogether changed. There was a time when on the occasion of the Battle of the Trench (A.H. 5) the Quraish had invaded Madinah with the help of many Arabian and Jewish tribes, and the Holy Prophet being besieged had to resist the enemy by digging a trench around the city. After only three years, in A.H. 8, when he attacked Makkah, the Quraish had no helper and they had to surrender helplessy. After this within a year or so the whole Arabia came under his control, deputations of tribes from all over the country began to visit him to take the oaths of allegiance and his enemies were left utterly helpless and resourceless. Then they were so lost to posterity that even if their children survived, none of them today knows that he is a descendent of Abu Jahl, Abu Lahab, `As bin Wail, or `Uqbah bin Abi Mu`ait, the enemies of lslam, and even if he knows it, he is not prepared to claim that his ancestors were those people. On the contrary, blessings are being invoked on the children of the Holy Prophet (upon whom be peace) throughout the world; millions and millions of Muslims take pride in bearing relationship to him; hundreds of thousands of people regard it as a mark of honour and prestige to have descended not only from him but from his family and even the families of his Companions. Thus, some one is a Sayyid, another an 'Alavi, and `Abbasi, a Hashmi, a Siddiqi, a Faruqi, an `Uthmani, a Zubairi, or an Ansari, but no one is an Abu Jahli or Abu Lahabi. History has proved that not the Holy Prophet Muhammad (upon whom be Allah's peace and blessings) but his enemies were, and are, abtar.",
    "Translation": null,
    "TranslationAbridged": "Verily your enemy alone has been cut off from the roots.2"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 109,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 “O unbelievers!” These words are addressed to those who had refused to believe in the Prophethood and teachings of the Prophet Muhammad (peace be on him).",
    "AyahNumber": 1,
    "AyahTextQalam": "قُلْ یٰۤاَیُّهَا الْكٰفِرُوْنَۙ",
    "Id": 6208,
    "SurahNumber": 109,
    "Tafseer": "1 A few points in this verse are particularly noteworthy: \n(1) Although the Holy Prophet (upon whom be peace) has been commanded to tell this to the disbelievers plainly, the theme that follows makes it explicit that every believer should tell the disbelievers plainly what has been said in the following verses; so much so that the person who has just believed and repented of kufr is also bound to express similarly his disgust with and disapproval of the creed and rites of worship and gods of kufr. Thus, though the first addressee of the word qul (say) is the Holy Prophet (upon whom be peace) himself, the command is not restricted to him alone but it reaches every believer through him. \n(2) The word \"kafir' is no abuse, which might have been used for the addressees of this verse, but it implies the one who refuses to believe, or is an unbeliever. As against it the word \"mu min\" is used for the believer. Therefore, the Holy Prophet's saying, by Allah's command, \"O disbelievers, ... ', in fact, means: \"O you, who have refused to believe in my apostleship and in the teachings brought by me.\" Likewise. when a believer uses this word, it will imply those who do not believe in the Holy Prophet Mauhmmad (upon whom be Allah's peace and blessings) , \n(3) The word used is \"O kafirs\" and not \"O muslmiks\"; therefore, the addressees are not only the mushriks but all those people who do not acknowledge Muhammad (upon whom be Allah's peace and blessings) as Allah's Messenger and the teachings and guidance brought by him as the teaching and guidance given by Allah Himself, whether they be Jews, Christians, Zoroastrians or the disbelievers, polytheists and pagans of the entire world. There is no reason why this address be restricted to the pagans of Quraish or of Arabia only. \n(4) To address the deniers with the word \"O kafirs\" is just like addressing certain people as \"O enemies\", or \"O opponents\". Such an address is not, in fact, directed to the person of the addressee but it is made on the basis of their characteristic of enmity and opposition, and lasts only until they are so characterised. If one of them gives up enmity and opposition, or turns a friend and supporter, he no longer remains the addressee of this word. Likewise, the address of \"O kafirs\" to the people also is in view of their characteristic of kufr and not their person. This address would be perpetual for him who continues to be a kafir till death, but the one who believes will no longer be its addressee. \n(5) Many scholars from among the commentators have expressed the opinion that in this Surah the address of \"O disbelievers\" applied only to a few persons of Quraish, who were visiting the Holy Prophet (upon whom be peace) with proposals of compromise regarding religion and about whom Allah had informed His Messenger than they would not believe. They have formed this opinion for two reasons. First, that it is followed by La a `budu ma to `budun: \"I do not worship him or those whom you worship\" . They say that this does not apply to the Jews and Christians, for they worship AIlah. Second, that this is also followed by: wa la antum `abiduna ma a`bud \"Nor are you worshippers of Him Whom 1 worship\". Their reasoning is that this statement does not apply to the people who at the revelation of this Surah were disbelievers but later believed. Both these arguments are incorrect. As for these verses, their explanation that follows will show that they do not bear the meaning which has been understood from them. Here, to point out the error of the reasoning it would be enough to say that if the addressees of this Surah were only these people, why then dces this Surah still continue to be recited when they are dead and gone from the world long long ago? And what was the need of making this Surah a part of the Qur'an permanently so that the Muslims should continue to read it for ever afterwards'?",
    "Translation": null,
    "TranslationAbridged": "Say: “O unbelievers!”1"
},
{
    "Abridged": "2 The unbelievers of Arabia worshipped God alongside other gods. The Prophet (peace be on him) is here made to disclaim the unbelievers’ worship because worshipping God alongside other deities does not constitute worship at all.",
    "AyahNumber": 2,
    "AyahTextQalam": "لَاۤ اَعْبُدُ مَا تَعْبُدُوْنَۙ",
    "Id": 6209,
    "SurahNumber": 109,
    "Tafseer": "2 This includes aII those deities whom the disbelievers and the polytheists have been, and are still, worshipping everywhere in the world, whether they are the angels, the jinn, prophets, saints, spirits of the living or dead men, or the sun, the moon, stars, animals, trees, rivers, idols and imaginary gods and goddesses. One may say that the pagans of Arabia acknowledged Allah also as a Deity and the other pagans of the world also have never disacknowledged Allah as a Deity till today. As for the followers of the earlier scriptures, they also acknowledge Allah alone as the real Deity. How then can it be correct to exonerate oneself froth the worship of all the deities of all those people, without' exception, when AIIah too is included among them? The answer is that if AIlah is worshipped along with others regarding Him as a Deity among other deities, the believer in Tauhid will inevitably express his inmunity from this worship, for in his sight Allah is oat a Deity out of a collection of deities, but He alone is the real Deity, and the worship of the collection of deities is no worship of Allah, although worship of Allah also is included in it. The Qur'an has clearly stated that Allah's worship is only that which does not have any tinge of the worship of another and in which man makes his worship exclusively Allah's. \"And the only Command they were given, was to worship Allah, making their religion sincerely His, turning all their attention towards Him.\" (Al-Bayyinah: S) . This subject has been explained at many places iu the Qur'an forcefully; for example, see Au-Nisa': 145-146, AI-A`raf :29, AzZumar: 2, 3, 11, 14, 15, A1-Mu'min: 14, 64-66. It has been further explained in a Hadith Qudsi (i.e. Divine Word revealed through the mouth of the Prophet) in which the messenger of Allah says: \"Allah says: I am Self-Sufficient of the association of every associate most of all. Whoever performed an act in which he associated another also with Me, 1 am free of it, and the entire act is for him who was associated.\" (Muslim, Musnad Ahmad, Ibn Majah) . Thus, acknowledging Allah as one of the two, three or many gods and serving and worshipping others along with Him is, in fact, the real kufr, declaration of immunity from which is the object of this Surah.",
    "Translation": null,
    "TranslationAbridged": "I do not worship those that you worship;2"
},
{
    "Abridged": "3 The unbelievers are being told that they do not worship the One True God Who has the attributes possessed by Him Whom the Prophet (peace be on him) worshipped.",
    "AyahNumber": 3,
    "AyahTextQalam": "وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُۚ",
    "Id": 6210,
    "SurahNumber": 109,
    "Tafseer": "3 The words used are: ma a'budu. The word ma in Arabic, is generally used for lifeless or unintelligent things, and the word man for intelligent and rational beings. The question arises why has ma a `budu been used here instead of man a `budu? The commentators generally give four answers to it: (1) that ma here is in the meaning of man; (2) that ma here is in the meaning of alladhi (i.e. which or who) ; (3) that in both the sentences ma is in the meaning of a noun of action (masdar) and it means: \"1 do not perform the kind of worship that you perform, i. e. polytheistic worship, and you do not perform the kind of worship that I perform, i.e. worship of One God;\" (4) that since in the first sentence ma ta'buduna has been used, in the second ma a `budu has been used to keep the style; in both places there is only the uniformity of the word, there is no uniformity of meaning; instances of this are found elsewhere also in the Qur'an. For example, in AI-Baqarah: 194, it has been said: '\"Therefore, if anyone transgresses a prohibition by attacking you, you may do likewise.\" Obviously, to transgress likewise in retaliation is no transgression, but the word transgression (in retaliation) Gas been used only for the sake of uniformity in style. In Surah At-Taubah: 67, it has been said: \"They forgot Allah, so Allah forgot them\", whereas Allah does not forget. what meant to be said is that Allah ignored them. The word nisyan in respect of AIlah has been used corresponding to their nisyaa (forgetfulness) only to keep the uniformity of the study. \nAlthough all these four interpretations are correct in their own way, and there is room in Arabic to take all these meanings, yet none of these explains the real object for which ma a'budu has been used instead of man a `budu. As a matter of fact, when man is used for a person in Arabic, it is meant to say or ask something about his person, and when ma is used, it is meant to ask or express something about his characteristics and traits. This can be explained in English by the questions: who is he, and what is he?, about a person. When it is asked, who is he?, the object is to know something about his person. But when it is asked, what is he?, the object is to know whether, for example, he belongs to the army, and if so, what is his rank, or whether he belongs to some teaching organisation, and if so, whether he is a lecturer in it, or a reader, or a professor, what science or art subject he teaches, what are his qualifications, etc. Thus, if in this verse, it was said: La antum abiduna man a `bud, it would mean: \"You are not worshippers of the being whom I worship, and in response, the disbelievers and the polytheists could have said that they too believed in the Being of AIIah and also worshipped Him. But when it was said: La antum 'abiduna ma a `bud, it meant: \"You are not worshippers of the Deity who has the attributes of the Deity whom I worship.\" And this is the real point on the basis of which the religion of the Prophet Muhammad (upon whom be Allah's peace and blessings) is absolutely distinguish-ed from the religions of all kinds of disbelievers, besides the deniers of God, for his God is utterly different from the God of all of them. The God of some of them is such that He stood in need of rest on the seventh day after having created the world in six days, Who is not God of the universe but God of Israel, Who stands in a special relationship to the people of one particular race, which is not shared by other men, Who wrestles with the Prophet Jacob and cannot throw him, Who has also a son, named Ezra. The God of some others is father of an only son, called Jesus Christ, and He causes His son to be crucified in order to make him an atonement for the sins of others. The God of some has wife and children, but begets only daughters. The God of some assumes human form and shape and living in a human body on the earth works like men. The God of some is merely an Essence, or Cause of causes, or the First Cause, Who after giving the system of the universe the initial push is sitting aside unconcerned, the universe is working by itself according to some relentless laws, and now He and man have nothing to do with each other. In short, even the unbelievers who acknowledge God do not, in fact, acknowledge the God, Who is the Creator, . Master, Disposer, Administrator and Ruler of the entire universe, Who has not only set the system of the universe but is running and controlling it by Himself every moment, Who is above every defect, fault, weakness and error, Who is free from every similitude, every physical limitation, every likeness, Who is Self-Sufficient of every companion and associate, Who has no partner in His Being, attributes, powers and entitlement to worship, Who is far too Holy that He should have children, or should take some one for a son, or should have an exclusive relationship with a community or race, Who is directly related to each individual creature of His as His Providence, Sustainer and Guardian, Who hears the prayers and answers them, Who alone possesses all the powers to give Iife and death, to cause profit and loss, and to make and mar destinies, Who not only sustains His creatures but also guides each according to its nature and need, Who is not only our God Whom we worship but also enjoins commands and prohibitions through His Prophets and His Books, which we have to obey, before Whom we are accountable for our deeds, Who will resurrect us after death, call us to account and reward and punish us accordingly. No one in the world except for Muhammad (upon whom be Allah's peace and blessings) and his followers, is worshipping the God with these attributes. If at alI some others also are worshipping God, they are not worshipping the real and true God but the God who is their self-invented, imaginary God.",
    "Translation": null,
    "TranslationAbridged": "neither do you worship Him Whom I worship;3"
},
{
    "Abridged": "4 That is, the Prophet (peace be on him) would not worship the unbelievers’ and their forefathers’ deities.",
    "AyahNumber": 4,
    "AyahTextQalam": "وَ لَاۤ اَنَا عَابِدٌ مَّا عَبَدْتُّمْۙ",
    "Id": 6211,
    "SurahNumber": 109,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "nor will I worship those whom you have worshipped;4"
},
{
    "Abridged": null,
    "AyahNumber": 5,
    "AyahTextQalam": "وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُؕ",
    "Id": 6212,
    "SurahNumber": 109,
    "Tafseer": "4 A section of the commentators is of the view that both these sentences are a repetition of the theme of the first two sentences and the repetition is meant to strengthen the statement in the first two sentences. But many commentators do not regard it as a repetition. They say that a new theme has been expressed in these which is different from the theme of the first two sentences. In our opinion they arc correct in so far as there is no repetition in these sentences, for in these only \"nor are you worshippers of Him Whom 1 worship\" Gas been repeated, and this repetition also is not in the sense in which this sentence was used first. But after negating the repetition the meanings that this section of the commentators has given of these two sentenses are very different from each other. There is no occasion here to take up and discuss each of the meanings given by the conunentators. Avoiding details we shall only discuss the meaning which is correct in our opinion. \nIn the first sentence, it has been said: \"Nor am 1 a worshipper of chase whom you have worshipped.\" Its theme is absolutely different from the theme of verse2, in which it was said: \"I do not worship those whom you warship,\" These two things widely differ in two aspects. First, that although there is denial, and a forceful denial, in saying that \"I do not, or shall not, do such and such a thing\", yet there is much greater force in saying that \"1 am not a doer of such and such a thing\", for it means: \"It is such an evil thing that nothing to say of committing it; it is not possible that I would even think of it, or have intention of doing it.\" Second, that the sentence \"whom you worship\" applies to only those gods whom the disbelievers are worshipping now. On the contrary, the sentence \"whom you have worshipped\" applies to aII those gods whom the disbelievers and their forefathers have been worshipping in the past. Now, it is a well known fact that the gods of the polytheists and disbelievers have always been changing and their number increasing and decreasing. In different ages different groups of them have been worshipping different gods and the gods of all the disbelievers have never always been the same everywhere. Therefore, the verse means: \"I exonerate myself not only from your gods of today but also from the gods of your forefathers, and I am not a person who would even think of worshipping such gods. \" \nAs for the second sentence, although its words in verse 5 are the same as in verse 3, yet its meaning at the two places is different. In verse 3, it follows this sentence: \"I do not worship those whom you worship.\" Therefore, it means: \"Nor are you worshippers of the God having the attributes of the One God Whom I worship.\" And in verse 5, it follows this sentence: \"Nor am I a worshipper of those whom you have worshipped.\" Therefore, it means: \"Nor dces it seem you would become worshippers of the One God Whom I worship.\" Or, in other words, \"It is not possible that 1 should become a worshipper of each of those gods whom you and your forefathers have worshipped, and on account of your aversion to adopting worship of One God, instead of many gads, it cannot be expected that you would desist from this wrong worship and will become worshipper of Him Whom 1 worship.\"",
    "Translation": null,
    "TranslationAbridged": "nor are you going to worship Him Whom I worship. "
},
{
    "Abridged": "5 This made it quite clear that in the matter of religion there was nothing in common between the Prophet (peace be on him) and the unbelievers.",
    "AyahNumber": 6,
    "AyahTextQalam": "لَكُمْ دِیْنُكُمْ وَ لِیَ دِیْنِ۠",
    "Id": 6213,
    "SurahNumber": 109,
    "Tafseer": "5 That is, \"My religion is entirely distinct and separate from your religion. I am not a worshipper of your gods and you are not worshippers of my God. I cannot worship your gods and you are not prepared to worship my God, Therefore, you and I can never follow and walk one and the same path together.\" This is not a message of tolerance to the disbelievers, but a declaration of immunity, disgust with and dissociation from them as long as they are disbelievers. Its object is to disappoint them absolutely and finally that in the matter of religion the party of Allah's Messenger and his followers would ever come to terms with them. This same declaration of immunity and expression of disgust has been made in the Makki Surahs revealed after this Surah successively. Thus, in Surah Yunus, it was said: \"If these people deny you, say to them: 1 am responsible for my deeds and you are responsible for yours: you are not accountable for what I do, and I am not accountable for what you do.\" (v. 41) . Then further on in the same Surah it was said: \"O Prophet, say: O mankind, if you are still in doubt concerning my Faith, know that I do not worship those whom you worship beside Allah, but I worship that Allah alone, Who has the power to cause your death.\" (v. 104) . In Surah Ash-Shu'ara it was said: \"If they disobey you, tell them: I am not responsible for what you do.\" (v. 216) . In Surah Saba it was said: \"Say to them: you will not be questioned for the errors we have committed, nor shall we be answerable for what you are doing. Say, our Lord will gather us together, then He will judge between us rightly.\" (w. 25-26) . In Surah az-Zumar: \"Tell them plainly: O my people, do whatever you will, so shall 1. Soon you shall come to know as to whom comes the disgraceful torment and who gets the enduring punishment.\" (w. 39-40) . Then the same lesson was taught in Madinah to aII the Muslims: \"There is indeed an excellent example for you in Abraham and his companions when they said to their people plainly: `We have nothing to do with you and your gods, whom you worship beside God: we have renounced you and there has arisen between us and you enmity and hatred for ever, until you believe in Allah, the One.\" (Al-Mumtahinah: 4) . These continuous explanations of the Qur'an do not leave any room whatever for the doubt that the verse Lakum dims kum wa liya din dces not mean: \"You may go on following your religion and allow me to follow mine\", but it is the kind of declaration made in Surah Az-Zumar: 14: \"O Prophet, say to them: I shall serve Allah alone, making my religion sincerely His. As for you, you may serve whomever you please beside Him.\" (v. 14) . \nFrom this verse lmam Abu Hanifah and Imam Shafe`i have deduced that kufr (unbelief ) , as a whole, is one community, however discordant and different from each other be the religions of the unbelievers; therefore, a Jew can inherit a Christian, and a Christian a Jew, and likewise the unbeliever of one religion can inherit the un-believer of another religion, if there exists between them a relationship by descent or marriage, or some other connection, which necessitates the passage of inheritance of one to another. On the contrary, Imam Malik, Imam Auza`i and Imam Ahmad hold the view that the followers of one religion cannot inherit the followers of another religion. They deduce this from the Hadith which has been related on the authority of Hadrat 'Abdullah bin 'Amr bin al-As, saying that Allah's Messenger (upon whom be peace) said: \"The people of two different communities cannot inherit each other.\" (Musnad Ahmad, Abu Da'ud, Ibn Majah, Daraqutni) . A ,Hadith with almost the same content has been related by Tirmidhi from Hadrat Jabir, by Ibn Hibban from Hadrat `Ahdullah bin `Umar, and by Bazzar from Hadrat Abu Hurairah. Dealing with this legal problem comprehensively, the well known Hanafi Imam; Shamsul-A'immah Sarakhsi, writes: \"The unbelievers can inherit each other mutually for alI those reasons for which the Muslims inherit each other mutually, and they can also inherit each other in certain other cases in which the Muslims do not inherit each other ... The fact is that Allah recognizes only two ways of life, the religion of Truth and the religion of falsehood; that is why He has declared: Lakum dine-kum wa liya din. And He has classified the people also into two groups, one group will go to Paradise and this consists of the believers, and the second group will go to Hell and this consists of the disbelievers collectively. And He has declared the two groups only as the potential opponents of each other: \"These are the two parties who have disputed about their Lord.\" (AI-Hajj: 19) . That is, one group comprises all the disbelievers collectively and they are opposed to the believers ... We do not admit that they are separate and distinct communities according to their beliefs, but as against the Muslims they all form one community. For the Muslims affirm faith in the apostleship of Muhammad (upon whom be Allah's peace and blessings) and in the Qur'an and they refuse to affirm faith. For this very reason they have been declared to be unbelievers and are one community as opposed to the Muslims ... The Hadith, La yata-warith ahl millatain, points to the same thing as explained above. For the Holy Prophet has explained the word millatain (two communities) by his saying: La yarithul Muslim al-kafir wa lal-kafir al-Maslim: \"The Muslim cannot inherit the disbeliever, nor the disbeliever can inherit the Muslim.\" (AIMabsut vol. 30, pp. 30-32) . The Hadith cited here by Imam Sarakhsi has been related by Bukhari, Muslim, Nasa'i, Ahmad, Tirmidhi, Ibn Majah and Abu Da'ud on the authority of Hadrat Usamah bin Zaid.",
    "Translation": null,
    "TranslationAbridged": "To you is your religion, and to me, my religion.5"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 110,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 According to reliable traditions, this was the last surah of the Qur’an that was revealed some three months before the Prophet’s demise. Thereafter, only a few verses were revealed but not any complete surah.",
    "AyahNumber": 1,
    "AyahTextQalam": "اِذَا جَآءَ نَصْرُ اللّٰهِ وَ الْفَتْحُۙ",
    "Id": 6214,
    "SurahNumber": 110,
    "Tafseer": "1 Victory here dces not imply victory in any one particular campaign but the decisive victory after which there remained no power in the land to resist and oppose Islam, and it became evident that Islam alone would hold sway in Arabia Some commentators have taken this to imply the Conquest of Makkah. But the conquest of Makkah took place iu A.H. 8, and this Surah was revealed towards the end of A.H.10, as is shown by the traditions related on the authority of Hadrat `Abdullah bin `Umar and Hadrat Sarra' bint Nabhan, which we have cited in the Introduction. Besides, the statement of Hadrat `Abdullah bin `Abbas that this is the last Surah of the Qur'an to be revealed, also goes against this commentary. For if the victory implied the conquest of Makkah, the whole of Surah at-Taubah was revealed after it then it could not be the last Surah. There is no doubt that the conquest of Makkah was decisive in that it broke the power of the Arabian pagans, yet even after this, they showed clear signs of resistance. The battles of Ta'if and Hunain were fought after it, and it took Islam about two years to attain complete control over Arabia.",
    "Translation": null,
    "TranslationAbridged": "When1 the help comes from Allah, and victory (is granted),"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "وَ رَاَیْتَ النَّاسَ یَدْخُلُوْنَ فِیْ دِیْنِ اللّٰهِ اَفْوَاجًاۙ",
    "Id": 6215,
    "SurahNumber": 110,
    "Tafseer": "2 \"You see ... in crowds\": \"When the time for the people to enter Islam in one's and two's comes to an end, and when whole tribes and people belonging to large tracts start entering it in crowds, of their own free will, and without offering battle or resistance.\" This happened from the beginning of A.H. 9, because of which that year has been described as the year of deputations. Deputations from every part of Arabia started coming before the Holy Messenger (upon whom be peace) , entering Islam and taking the oath of allegiance to him, until when he went for the Farewell Pilgrimage to Makkah, in A.H. 10, the whole of Arabia had become Muslim, and not a single polytheist remained anywhere in the country.",
    "Translation": null,
    "TranslationAbridged": "and you see people entering Allah’s religion in multitudes,"
},
{
    "Abridged": "2 Traditions also indicate that after the revelation of this surah, the Prophet (peace be on him) began to pay markedly greater attention to celebrating God’s praise and seeking His forgiveness.",
    "AyahNumber": 3,
    "AyahTextQalam": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَ اسْتَغْفِرْهُ١ؔؕ اِنَّهٗ كَانَ تَوَّابًا۠",
    "Id": 6216,
    "SurahNumber": 110,
    "Tafseer": "3 Hamd implies praising and hallowing Allah Almighty as well as thanking and paying obeisance to Him; tasbih means to regard Allah as pure and free from every blemish and weakness. The Holy Prophet was enjoined to do hamd and tasbih of Allah when he witnessed this manifestation of His power. Here, hamd means that in respect of his great success he should never entertain even a tinge of the idea that it was the result of any excellence of his own, but he should attribute it to Allah's favour and mercy, thank Him alone for it, and acknowledge with the heart and tongue that praise and gratitude for the victory and success belonged to Him alone. And tasbih means that he should regard Allah as pure and free from the limitation that exaltation of his Word stood in need of his effort and endeavour, or was dependent on it. On the contrary, his heart should be filled with the faith that the success of his effort and struggle was dependent upon Allah's support and succour. He could take this service from any of His servants He pleased. and it was His favour that He had taken it from him, and made His religion meet success through him. Besides, there is an aspect of wonder also in pronouncing the tasbih, i.e. Subhan Allah. When a wonderful incident takes place, one exclaims subhan A/lah, thereby implying that only by Allah's power such a wonderful thing had happened; otherwise no power of the world could have caused it to happen. \n4 \"Pray for His forgiveness\": \"Pray to your Lord to overlook; and pardon whatever error or weakness you might have shown inadvertently in the performance of the service that He had entrusted to you,\" This is the etiquette that Islam has taught to man. A man might have performed the highest possible service to Allah's Religion, might have offered countless sacrifices in its cause, and might have exerted himself extremely hard in carrying out the rites of His worship, yet he should never entertain the thought that he has fulfilled the right his Lord had on him wholly. Rather he should always think that he has not been able to fulfil what was required of him, and he should implore Allah, saying: \"Lord, overlook and forgive whatever weakness I might have shown in rendering Your right, and accept the little service that I have been able to perform.\" When such an etiquette was taught to the Holy Messenger (upon whom be peace) , none in the world conceivably has toiled and struggled so hard in the cause of Allah as he did, how can another person regard his work as superb and be involved in the misunderstanding that he has fulfilled the right Allah had imposed on him? Allah's right, in fact, is so supreme that no creature can ever fulfil and render it truly and fully. \nAllah in this command has taught Muslims an eternal lesson: \"Do not regard any of your worship, devotion or religious service as something superb; even if you have expended your entire life in the cause of Allah, you should always think that you could not do all that was required of you by your Lord. Likewise, when you attain some victory, you should not regard it as a result of some excellence in yourselves but as a result of only Allah's bounty and favour. Then bowing humbly before your Lord, you should praise and glorify Him, and should repent and beg for His forgiveness instead of boasting and bragging of your success and victory.\"",
    "Translation": null,
    "TranslationAbridged": "then extol the praise of your Lord and pray to Him for forgiveness.2 For He indeed is ever disposed to accept repentance."
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 111,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 This refers to an uncle of the Prophet (peace be on him) who was commonly known as Abu Lahab.\n2 Much though Abu Lahab tried to obstruct the forward march of Islam, his efforts ended in utter failure. What is said here is in fact a prediction but is couched in terms that convey the impression of an event that had already taken place.",
    "AyahNumber": 1,
    "AyahTextQalam": "تَبَّتْ یَدَاۤ اَبِیْ لَهَبٍ وَّ تَبَّؕ",
    "Id": 6217,
    "SurahNumber": 111,
    "Tafseer": "1 His real name was 'Abd al-'Uzza, and he was called Abu Lahab on account of his glowing, ruddy complexion. Lahab means the flame of fire, and Abu Lahab the one with a flaming, fiery face. His being mentioned here by his nickname (Kunyat) , instead of his real name, has several reasons. First, that he was better known by his nickname than by his real name; second, that the Qur'an did not approve that he should be mentioned by his polytheistic name `Abd al 'Uzza (slave of 'Uzza) ; third, that his kunyat goes well with the fate that has been described of him in this Surah. \nSome commentators have translated tabbat yada Abi Lahab to mean: \"May the hands of Abu Lahab be broken\", and tabby to mean: °may he perish\" or \"he perished\". But this, in fact, was not a curse which was invoked on him, but a prophecy in which an event taking place in the future, has been described in the past tense, to suggest that its occurrence in the future is certain and inevitable. \nIn actual fact, at last the same thing happened as had been foretold in this Surah a few years earlier. Breaking of the hands obviously does not imply breaking of the physical hands, but a person's utterly failing in his aim and object for which he has exerted his utmost. And Abu Lahab indeed had exerted his utmost to defeat and frustrate the message of lslam presented by the Holy Prophet (upon whom be peace) . But hardly seven or eight years after the revelation of this Surah most of the big chiefs of Quraish, who were a party with Abu Lahab in his hostility to Islam, were killed in the Battle of Badr. When the news of the defeat reached Makkah, he was so shocked that he could not survive for more than seven days. His death occurred in a pitiabie state. He became afflicted with malignant pustule and the people of his house left him to himself, fearing contagion. No one came near his body for three days after his death, until the body decomposed and began to stink. At last, when the people began to taunt his sons, according to one tradition, they hired some negroes, who lifted his body and buried it. According to another tradition, they got a pit dug out and threw his body into it by pushing it with wood, and covered it up with earth and stones. His utter failure became manifest when the religion which he had tried his utmost to impede and thwart, was accepted by his own children. First of all, his daughter, Darrah, migrated from Makkah to Madinah and embraced lslam; then on the conquest of Makkah, both his sons, `Utabh and Mu`attab, came before the Holy Prophet (upon whom be peace) through the mediation of Hadrat `Abbas, believed and took oath of allegiance to him.",
    "Translation": null,
    "TranslationAbridged": "Destroyed were the hands of Abu Lahab,1 and he lay utterly doomed.2"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَؕ",
    "Id": 6218,
    "SurahNumber": 111,
    "Tafseer": "2 Abu Lahab was a stingy, materialistic man. Ibn Jarir has stated that once in the pre-Islamic days he was accused of having stolen two golden deer from the treasury of the Ka'bah. Though later the deer were recovered from another person, the fact that he was accused of stealing indicates the opinion the people of Makkah held of him. About his riches Qadi Rashid bin Zubair writes in his Adh-Dhakha'ir wat-Tuhaf. He was one of the four richest men of the Quraish, who owned one qintar (about 260 oz) of gold each. His love of wealth can be judged from the fact that when on the occasion of the battle of Badr the fate of his religion was going to be decided for ever, and all the Quraish chiefs had personally gone to fight, he sent `As bin Hisham to fight on his own behalf, telling him: This is in lieu of the debt of four thousand dirhams that you owe to me. Thus. he contrived a plan to realize his debt, for 'As had become bankrupt and there was no hope of the recovery of the debt from him. \nSome conunentators have taken ma kasaba in the meaning of the earning, i.r. the benefits that accrued to him from his wealth were his kasab(earning) , and some other commentators have taken it to imply children, for the Holy Prophet (upon whom be peace) has said that a man's son also is his kasab(earning) . (Abu Da'ud, Ibn Abi Hatim) . Both these meanings fully correspond to the fate met by Abu Lahab. For when he was afflicted with the malignant pustule, his wealth availed him nothing, and his children also left him alone to die a miserable, wretched death. They did not even bury him honourably. Thus, within a few years the people witnessed how the prophecy which had been made in this Surah about Abu Lahab was literally fulfilled.",
    "Translation": null,
    "TranslationAbridged": "His wealth did not avail him, nor his acquisitions."
},
{
    "Abridged": "",
    "AyahNumber": 3,
    "AyahTextQalam": "سَیَصْلٰى نَارًا ذَاتَ لَهَبٍۚۖ",
    "Id": 6219,
    "SurahNumber": 111,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "Surely, he will be cast into a Flaming Fire"
},
{
    "Abridged": "3 The woman concerned was called Umm Jamil. She was a sister of Abu Sufyan and was as staunch an enemy to Islam as her husband.",
    "AyahNumber": 4,
    "AyahTextQalam": "وَّ امْرَاَتُهٗ١ؕ حَمَّالَةَ الْحَطَبِۚ",
    "Id": 6220,
    "SurahNumber": 111,
    "Tafseer": "3 Her name was Arwa' and her nickname (kunyat) Umm Jamil. She was sister of Abu Sufyan and was no less bitter than her husband, Abu Lahab, in her enmity to the Holy Messenger (upon whom be peace) Hadrat Abu Bakr's daughter, Hadrat Asma', has related that when this Surah was revealed, and Umm Jamil heard it, she was filled with rage and went out in search of the Holy Prophet (upon whom be peace) . She carried a handful of stones and she was crying some verses of her own, satirizing the Holy Prophet. She came to the Ka`bah, where the Holy Prophet was sitting with Hadrat Abu Bakr. The latter said: \"O Messenger of AIIah, there she comes and I fear lest she should utter something derogatory to you.\" The Holy Prophet replied: \"She will not see me.\" The same thing happened. She could not see the Holy Prophet although he was there. She said to Hadrat Abu Bakr: \"I hear that your Companion has satirized me.\" Hadrat Abu Bakr replied: \"No, by the Lord of this house, he has not satirized you.\" Hearing this she went off. (lbn Abi Hatim, Ibn Hisham; Bazzar has related an incident on the authority of Hadrat 'Abdullah bin `Abbas also, which closely resembles this) . What Hadrat Abu Bakr meant was that she had not been satirized by the Holy Prophet (upon whom be peace) , but by AIlah Himself. \n4 The words in the original are hammalat al-hatab, which literally mean: \"carrier of the wood\". The commentators have given several meanings of it. Hadrat `Abdullah bin `Abbas, Ibn Zaid, Dahhak and Rabi`bin Anas say: She used to strew thorns at the Holy Prophet's door in the night; therefore, she has been described as carrier of the wood. Qatadah, Ikrimah Hasan Bari, Mujahid and Sufyan Thauri say: She used to carry evil tales and slander from one person to another in order to create hatred between them; therefore, she has been called the bearer of wood idiomatically. Sa`id bin Jubair says: The one who is loading himself with the burden of sin, is described idiomatically in Arabic as: Fulan-un Yahtatibu ala zahri bi (so and so is loading wood on his back) ; therefore, hummalat al-hatab means: 'The one who carries the burden of sin. Another meaning also which the commentators have given is: she will do this in the Hereafter, i.e. she will bring and supply wood to the fire in which Abu Lahab would be burning.",
    "Translation": null,
    "TranslationAbridged": "along with his wife,3 that carrier of slanderous tales;"
},
{
    "Abridged": null,
    "AyahNumber": 5,
    "AyahTextQalam": "فِیْ جِیْدِهَا حَبْلٌ مِّنْ مَّسَدٍ۠",
    "Id": 6221,
    "SurahNumber": 111,
    "Tafseer": "5 The word used for her neck is jid, which in Arabic means a neck decorated with an ornament. Sa`id bin al-Musayyab, Hasan Basri and Qatadah say that she wore a valuable necklace and used to say: \"By Lat and `Uzza, I will sell away this necklace and expend the price to satisfy my enmity against Muhammad (Allah's peace and blessings be upon him) .\" That is why the word jid has been used here ironically, thereby implying that in Hell she would have a rope of palm-fibre round her neck instead of that necklace upon which she prides herself so arrogantly. Another example of this ironical style is found at several places in the Qur'an in the sentence: Bashshir-hum bi-`adhab-in alima \"Give them the good news of a painful torment. \" \nThe words babl-um min-masad have been used for the rope which will be put round her neck, i e. it will be a rope of the masad kind. Different meanings of this have been given by the lexicographers and commentators. According to some, masad means a tightly twisted rope; others say that: masad is the rope made from palm-fibre; still others say that it means the rope made from rush, or camel-skin, or camel-hair. Still another view is that it implies a cable made by twisted iron strands together.",
    "Translation": null,
    "TranslationAbridged": "upon her neck shall be a rope of palm-fibre."
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 112,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 The unbelievers often asked the Prophet (peace be on him) to describe the Lord in Whom he asked them to believe to the exclusion of all other deities. What kind of God is He? What is His pedigree? What is He made of? From whom did He inherit this Universe and who will later inherit it from Him? It is in response to such questions that this surah was revealed.\n2 The Prophet (peace be on him) informed the unbelievers that his Lord was no other than He Whom the unbelievers themselves called Allah, and Whom they regarded as their own Creator as well as the Creator and Sustainer of the entire Universe. For the Arabian polytheists’ beliefs regarding Allah see Yunus 10: 22, 23, 31; Bani Isra’il 17: 67; al-Mu’minun 23: 84-89; al-[Ankabut 29: 61-63; al- Zukhruf 43: 87.\n3 The word used here is ahad rather than wahid. Though both the words mean “one,” the word wahid is used for things that have the potential of plurality; for example, one man, one nation, one country, one world. The implication in all these cases is that here there is one man out of a number of men; and so on and so forth. Contrary to this, ahad is used for Him Who is One and Unique in every respect, Who has no connection whatsoever with plurality. That is why ahad is used in Arabic exclusively for God.",
    "AyahNumber": 1,
    "AyahTextQalam": "قُلْ هُوَ اللّٰهُ اَحَدٌۚ",
    "Id": 6222,
    "SurahNumber": 112,
    "Tafseer": "1 The first addressee of this Command is the Holy Prophet (upon whom be peace) himself for it was he who was asked: \"Who is your Lord and what is He like? Again it was he who was commanded to answer the question in the following words. But after him every believer is its addressee. He too should say what the Holy Prophet had been commanded to say. \n2 That is, \"My Lord to Whom you want to be introduced is none but Allah.\" This is the first answer to the questions, and it means: \"I have not introduced a new lord who I want you to worship beside all other gods, but it is the same Being you know by the name of Allah.\" \"Allah\" was not an unfamiliar word for the Arabs. They had been using this very word for the Creator of the universe since the earliest times, and they did not apply this word to any of their other gods. For the other gods they used the word ilah. Then their beliefs about Allah had become fully manifest at the time Abraha invaded Makkah. At that time there existed 360 idols of gods (ilahs) in and around the Ka`bah, but the polytheists forsaking all of them had invoked only Allah for protection. In other words, they knew in their hearts of hearts that no ilah could help them on that critical occasion except Allah. The Ka`bah also was called Bait-Allah by them and not Bait-ilahs after their self-made gods. At many places in the Qur'an the polytheistic Arabian belief about AIIah has been expressed, thus: \nIn Surah Az-Zukhruf it has been said: \"If you ask them who created them, they will surely say, 'Allah'.\" (v. 87) \nIn Surah Al-`Ankabuu: \"If you ask them, `Who has created the earth and the heavens and Who has subjected the moon and the sun?' they will surely say: Allah ... And if you ask them, `Who sent down rainwater from the sky and thereby raised the dead earth back to Iife?' they will surely say: `Allah'.\" (vv. 61-63) \nIn Surah Al-Mu'minun: \"Say to them, `Tell me, if you know, whose is the earth and all who dwell in it?' They will say, `Allah's'... say to them, `To Whom do the seven heavens and the Glorious Throne belong?' They will say, `To Allah'... Say to them, `Tell me, if you know, Whose is the sovereignty over everything? And Who is that Being Who gives protection while none else can give protection against Him?' They will surely reply, `This power oolongs to Allah'.\" (vv. 8489) . \nIn Surah Yunus: \"Ask them: Who provides for you from the heavens and the earth? Who has power over the faculties of hearing and sight? Who brings forth the living from the dead and the dead from the living? Who directs the system of the universe? They will surely reply, `Allah'.\" (v. 31) \nAgain in Surah Yunus at another place: \"When you set sails in ships, rejoicing over a fair breeze, then all of a sudden a strong wind begins to rage against the passengers and waves begin to surge upon them from every side and they realize that they have been encircled by the tempest. At that time they pray to Allah with sincere faith, saying: `If thou deliverest us from this peril, we will become Thy grateful servants.' But when He delivers them, the same people begin to rebel on the earth against the Truth.\" (w. 22-23) \nThe same thing has been reiterated in Surah Bani Isra'il, thus: \"When a misfortune befalls you on the sea, all of those whom you invoke for help tail you but He (is there to help you) , yet when He brings you safe to land, you turn away from Him.\" (v. 67) \nKeeping these verses in view, let us consider that when the people asked: \"Who is your Lord and what is He like to Whose service and worship you call us?\" the answer given was \"Huwa Allah: He is Allah.\" This answer by itself gives the meaning: \"My Lord is He Whom you yourself acknowledge as your own as well as the whole world's Creator, its Master, Sustainer and Administrator, and He Whom you invoke for help at critical times beside all other deities, and I invite you to His service alone.\" This answer comprehends all the perfect and excellent attributes of Allah. Therefore, it is not at all conceivable that the Creator of the universe, its Administrator and Disposer of its affairs, Sustainer of all the creatures living in it, and the Helper of the servants in times of hardship, would not be living, hearing and seeing, that He would not be an All-Powerful, All-Knowing, All-Wise, All-Merciful and All-Kind Sovereign. \n3 The scholars have explained the sentence Huwa-Allah Ahad syntactically, but in our opinion its explanation which perfectly corresponds to the context is that Huwa is the subject and Allahu its predicate, and Ahad-un its second predicate. According to this parsing the sentence means: \"He (about Whom you are questioning me) is Allah, is One and only one. Another meaning also can be, and according to language rules it is not wrong either: \"He is AIIah, the One.\" \nHere, the first thing to be understood is the unusual use of ahad in this sentence. Usually this word is either used in the possessive case as yaum ul-ahad (first day of the week) , or to indicate total negative as Ma ja a a-ni ahad-un (No one has come to me) , or in common questions like Hal `indaka ahad-un (Is there anyone with you?) , or in conditional clauses like Inja'a-ka ahad-un (If someone comes to you) , or in counting as ahad, ithnan, ahad ashar (one, two, eleven) . Apart from these uses, there is no precedent in the pre-Qur'anic Arabic that the mere word ahad might have been used as an adjective for a person or thing. After the revelation of the Qur'an this word has been used only for the Being of Allah, and for no one else. This extraordinary use by itself shows that being single, unique and matchless is a fundamental attribute of Allah; no one else in the world is qualified with this quality: He is One, He has no equal. \nThen, keeping in view the questions that the polytheists and the followers of earlier scriptures asked the Holy Prophet (upon whom be peace) about his Lord, let us see how they were answered with ahad-un after Huwa-Allah. \nFirst, it means: \"He alone is the Sustainer: no one else has any share or part in providence. and since He alone can be the Itch (Deity) Who is Master and Sustainer, therefore, no one else is His associate in Divinity either.\" \nSecondly, it also means \"He alone is the Creator of the universe: no one else is His associate in this work of creation. He alone is the Master of the universe, the Disposer and Administrator of its system, the Sustainer , of His creatures, Helper and Rescuer in times of hardship; no one else has any share or pan whatever in the works of Godhead, which as you yourselves acknowledge, are works of Allah. \nThirdly since they had also asked the questions: of what is your Lord made? what is His ancestry? What is his sex? From whom has He inherited the world and who will inherit it after Him? -all these questions have been answered with one word ahad for AIIah. It means: (1) He alone has been, and will be, God for ever; neither was there a God before Him, nor will there be any after Him; (2) there is no race of gods to which He may belong as a member: He is God, one and single, and none is homogeneous with Him; (3) His being is not merely One ( wahid but ahad, in which there is no tinge of plurality in any way: He is not a compound being, which may be analysable or divisible. which may have a form and shape, which may be residing somewhere, or may contain or include something, which may have a colour, which may have some limbs, which may have a direction, and which may be variable or changeable in any way. Free from every kind of plurality He alone is a Being Who is Ahad in every aspect. (Here, one should fully understand that the word wahid is used in Arabic just like the word \"one\" in English. A collection consisting of great pluralities is collectively called wahid or one, as one man, one nation, one country, one world, even one universe, and every separate part of a collection is also called one. But the word Ahad is not used for anyone except Allah. That is why wherever in the Qur'an the word wahid has been used for Allah, He has been called Itah wahid (one Deity) , or Allah-ulWahid-al-Qahhar. (One Allah Who is Omnipotent) , and nowhere just wahid, for this word ' is also used for the things which contain pluralities of different kinds in their being. On the contrary, for Allah and only for Allah the word Ahad has been used absolutely, for He alone is the Being Who exists without any plurality in any way, Whose Oneness is perfect in every way.",
    "Translation": null,
    "TranslationAbridged": "Say:1 “He is Allah,2 the One and Unique;3"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "اَللّٰهُ الصَّمَدُۚ",
    "Id": 6223,
    "SurahNumber": 112,
    "Tafseer": "4 The word used in the original is samad of which the root is smd. A look at the derivatives in Arabic from this root will show how comprehensive and vast this word is in meaning. (Lexical discussion of the meanings of the derivatives is omitted) . \nOn the basis of these lexical meanings the explanations of the word asSamad in the verse Allah-us-Samad, which have been reported from the Companions, their immediate successors and the later scholars are given below: \nHadrat 'AIi. 'Ikrimah and Ka'b Ahbar: \"Samad is he who has no superior. \" \nHadrat 'Abdullah bin Mas`ud, Hadrat `Abdullah bin `Abbas and Abu Wail Shaqiq bin Salamah: \"The chieftain whose chieftancy is perfect and of the most extraordinary kind. \" \nAnother view of Ibn 'Abbas: \"Samad is he to whom the people turn when afflicted with a calamity.\" Still another view of his: \"The chieftain who in his chieftaincy, in his nobility and glory, in his clemency and forbearance,. in his knowledge and wisdom is perfect. \" \nHadrat Abu Hurairah: \"He who is independent of all and all others are dependent upon him. \" \nOther views of 'Ikrimah: \"He from whom nothing ever has come out, nor normally comes out:\" \"Who neither eats nor drinks.\" Views containing the same meaning have been related from Sha'bi and Muhammad bin Ka'b al-Kurazi also. \nSuddi: \"the one to whom the people turn for obtaining the things they need and for help in hardships. \" \nSa'id bin Jubair: \"He who is perfect in all his attributes and works.\" \nRabi' bin Jubair: \"He who is immune form every calamity.\" \nMuqatil bin Hayyan: \"He who is faultless.\" \nIbn Kaysan: \"He who is exclusive in his attributes.\" \nHasan Basri and Qatadah: \"He who is ever-living and immortal.\" \nSimilar views have been related from Mujahid, Ma'mar and Murrat alHamadani also. \nMunat al-Hamadani's another view is : \"he who decides whatever he wills and does whatever he wills, without there being anyone to revise his judgement and decision.\" \nIbrahim Nakha'i: \"He to whom the people turn for fulfilment of their desires.\" \nAbu Bakr al-Anbari \"There is no difference of opinion among the lexicographers that samad is the chief who has no superior and to whom the people turn for fulfilment of their desires and needs and in connection with other affairs.\" Similar to it is the view of Az-Zajjjaj, who says \"Samad is he in whom leadership has been perfected, and to whom one turns for fulfilment of one's needs and desires.\" \nNow, Iet us consider why Allahu-Ahad has been said in the first sentence and why Allah-us-Samad in this sentence. About the word ahad we have explained above that it is exclusively used for AIIah, and for none else. That is why it has been used as ahad, in the indefinite sense. But since the word samad is used for creatures also, Allall-us-Samad has been said instead of Allah Samad, which signifies that real and true Samad is Allah alone. If a creature is samad in one sense, it may not be samad in some other sense, for it is mortal, not immortal; it is analysable and divisible, is compound, its parts can scatter away any time; some creatures are dependent upon it, and upon others it is dependent; its chieftaincy is relative and not absolute; it is superior to certain things and certain other things are superior to it; it can fulfil some desires of some creatures but it is not in the power of any creature to fulfil all the desires of all the creatures, On the contrary, Allah is perfect in His attributes of Samad in every respect; the whole world is dependent upon Hun in its needs, but He is ,not dependent upon needs; everything in the world turns to Him, consciously or unconsciously, for its survival and for fulfilment of the needs of everyone; He is immortal and Ever-living; He sustains others and is not sustained by anyone; He is Single and Unique, not compound so as to be analysable and divisible; His sovereignty prevails over entire universe and - He is Supreme in every sense. Therefore, He is not only .Samad but As-Samad, i e. the Only and One Being Who is wholly and perfectly qualified with the attribute of samad in the true sense. \nThen, since He is As-Samad, it is necessary that He should be Unique, One and Only, for such a being can only be One, which is not dependent upon anyone and upon whom everyone else may be dependent; two or more beings cannot be self-sufficient and fulfillers of the needs of all. Furthermore, His being As-samad also requires that He alone should be the Deity, none else, for no sensible person would worship and serve the one who had no power and authority to fulfil the needs of others.",
    "Translation": null,
    "TranslationAbridged": "Allah, Who is in need of none and of Whom all are in need;"
},
{
    "Abridged": null,
    "AyahNumber": 3,
    "AyahTextQalam": "لَمْ یَلِدْ١ۙ۬ وَ لَمْ یُوْلَدْۙ",
    "Id": 6224,
    "SurahNumber": 112,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "He neither begot any nor was He begotten,"
},
{
    "Abridged": "",
    "AyahNumber": 4,
    "AyahTextQalam": "وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ۠",
    "Id": 6225,
    "SurahNumber": 112,
    "Tafseer": "6 The word kufu' as used in the original means an example, a similar thing, the one equal in rank and position. In the matter of marriage, kufu' means that the boy and the girl should match each other socially. Thus, the verse means that there is no one in the entire universe, nor ever was, nor ever can be, who is similar to Allah, or equal in rank with Him, or resembling Him in His attributes, works and powers in any degree whatever.",
    "Translation": null,
    "TranslationAbridged": "and none is comparable to Him.”"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 113,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": "1 That is, “I seek refuge with God Who brings out the light of dawn from the darkness of the night.”",
    "AyahNumber": 1,
    "AyahTextQalam": "قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ",
    "Id": 6226,
    "SurahNumber": 113,
    "Tafseer": "1 As qul (say) is a part of the message which was conveyed to the Holy Prophet (upon whom be peace) by Revelation for preaching his prophetic message, its first addressee is the Holy Prophet himself but after him every believer too is its addressee. \n2 The act of seeking refuge necessarily consists of three parts: (1) The act of seeking refuge itself; (2) the seeker of refuge; and (3) he whose refuge is sought. Seeking refuge implies feeling fear of something and seeking protection of another, or taking cover of it, or clinging to it, or going under its shelter for safety. The seeker after refuge in any case is the person, who feels that he cannot by himself resist and fight the thing that he fears, but stands in need of refuge with another for protection. Then the one whose refuge is sought must necessarily be a person or being about whom the seeker after refuge believes that he or it alone can protect him from the calamity. Now, one kind of refuge is that which is obtained according to natural laws in the physical world from a perceptible material object or person or power, for example, taking shelter in a fort for protection against the enemy's attack, or taking cover in a trench or behind a heap of earth, or walI, for protection against a shower of bullets, or taking refuge with a man or government, for protection from a powerful tyrant or taking refuge in the shade of a tree or building for protection from the sun. Contrary to this, the other kind of refuge is that which is sought in a supernatural Being from every kind of danger and every kind of material, moral or spiritual harm and injury on the basis of the belief that that Being is ruler over the physical world and can protect in supersensory ways the one who seeks His refuge. This second kind of refuge is the one that is implied not only in Surah AI-Falaq and Surah An-Nas but wherever in the Qur'an and the Hadith mention has been made of seeking refuge with Allah, it implies this particular kind of refuge, and it is a necessary corollary of the doctrine of Tauhid that this kind of refuge should be sought from no one but Allah. The polytheists sought this kind of protection, and seek even today, from other beings than Allah, e.g. the jinn, or gods and goddesses. The materialists turn for this also to material means and resources, for they do not believe in any supernatural power. But the believer only turns to Allah and seeks refuge only with Him, against all such calamities and misfortunes to ward off which he feels he has no power. For example, about the polytheists it has been said in the Qur'an: \"And that from among men some people used to seek refuge with some people from among the jinn (Al-Jinn: 16) .\" And explaining it in E.N. 47 of Surah Al-Jinn we have cited Hadrat `Abdullah bin 'Abbas's tradition that when the polytheistic Arabs had to pass a night in an uninhabited valley, they would call out, saying: We seek refuge of the lord of this valley (i e. of the jinn who is ruler and master of this valley) .\" Contrary to this, about Pharaoh it has been said: \"When he witnessed the great Signs presented by the Prophet Moses, he showed arrogance on account of his might.\" (Adh-Dhariyat: 39) . As for the attitude and conduct of the God-worshippers the Qur'an says that they seek Allah's refuge for protection against the evil of everything that they fear, whether it is material or moral or spiritual. Thus, about Mary it has been said that when God's angel appeared before her suddenly in human guise (when she did not know that he was an angel) , she cried out: \"I seek the merciful God's refuge from you, if you are a pious man.\" (Mary: 18) . When the Prophet Noah made an improper petition to Allah, and was rebuked by Allah in response, he inunediately submitted: \"My Lord, I seek Your protection lest I should ask of You anything of which I have no knowledge.\" (Hud: 47) When the Prophet Moses commanded the children of Israel to sacrifice a cow, and they said that perhaps he was having a jest with them, he replied: \"I crave Allah's protection from behaving like ignorant people.\" (Al-Baqarah: 67) \nThe same is the case with alI the acts of seeking refuge which have been reported in respect of the Holy Prophet (upon whom be peace) in the books of Hadith. For instance, consider the following prayers that the Holy Prophet made: \nHadrat 'A'ishah has reported that the Holy Prophet (upon whom be peace) used to pray, saying: \"O God, I seek Your refuge from the evil of the works which I did and from the evil of the works which I did not do.\" (i.e. if I have done a wrong, I seek refuge from its evil results, and if.I have not done a work which I should have done, I seek refuge from the loss that 1 have incurred, or from that I should do what I should not do) .\" (Muslim) \nIbn Umar has reported that one of the supplications of the Holy Prophet (upon whom be peace) was to the effect: \"O God, i seek Your refuge front being deprived of a blessing that You have bestowed on me and front being deprived of the well-being that You have granted me and I seek refuge lest Your wrath should descend on me suddenly, and 1 seek refuge front every kind of Your displeasure.\" (Muslim) \nZaid bin Arqam has reported that the Messenger Of Allah used to pray: \"O God, I seek Your refuge front the knowledge which is not beneficial, front the heart which dces not fear You, front me soul which is never satisfied, and front the prayer which is not answered.\" (Muslim) \nHadrat Abu Hurairah has reported that the Holy Messenger used to pray: 'O God, I seek Your refuge from hunger, for it is a most evil thing with which one may have to pass a night, and I seek Your refuge from dishonesty, for it is sheer evil-mindedness.\" (Abu Da'ud) . \nHadrat Anas has reported that the Holy Prophet (upon whom be peace) used to pray: \"O God, I seek Your refuge from leprosy and madness and aII evil diseases.\" (Abu Da'ud) . \nHadrat 'A'ishah has reported that the Holy Prophet (upon whom be peace) used to pray in these words: \"O God, I seek Your refuge front the mischief of the fire and from the evil of affluence and poverty.\" (Tirmidhi, Abu Da'ud) \nShakal bin Humaid requested the Holy Prophet (upon whom be peace) to teach him some prayer. He told hit» to say \"O God, I seek Your refuge front the evil of my hearing, from the evil of my sight, from the evil of lily tongue, from the evil of my heart, and front the evil of my lust,\" (Tirmidhi Abu Da'ud) . \nAtlas bits Malik has reported that the Holy Prophet used to say: \"O God, I seek Your refuge from helplessness, indolence, cowardice, old age and stinginess, and I seek Your refuge from the torment of the grave and from the mischief of Iife and death, (and according to a tradition in Muslim also) from the burden of debt and that the people should overpower me. \" (Bukhari, Muslim) , \nKhawla bint Hukaym Sulamiyyah says that she heard the Holy Prophet (upon whom be peace) as saying that the one who halts at a new stage (during the journey) and says: \"I seek refuge in the blameless Words of Allah from the evil of the creatures\", will not be caused .any harm until he departs from that stage. (Muslim) \nWe have related these few prayers of the Holy Prophet (upon whom be peace) from the Hadith, which show that the believer should seek Allah's refuge from every danger and evil and not the refuge of anyone else, nor he should become self sufficient of Allah and place reliance only on himself. \n3 The word used in the original is Rabbul- Falaq. Falaq actually means to split and to pierce through. A great majority of the commentators have taken it to mean bringing out the light of dawn by splitting the darkness of night, for in Arabic falaq as-subh is often used for the breaking of dawn, and in the Qur'an also the words :Faliq-ul-isbah (He Who causes the dawn to appear by splitting the darkness of night) have been used for Allah. (Al-An'am: 96) . Another meaning of falaq also is to create, to bring into being, for everything created in the world appears by splitting something. All vegetation sprouts by splitting open the seed and the soil; all animals come out either from the womb of mother or by breaking open the egg, or some other obstruction. All springs gush out by splitting open the rock or soil. The day appears by piercing through the curtain of the night. The drops of rain pierce through the clouds and fall on the earth. In short, everything in the world comes into being as a result of breaking and splitting another thing; so much so that the earth and the heavens also in the beginning were one mass, then they were broken and parted. (Al-Anbiya': 30) . Thus, according to this meaning the word falaq is common to all creations. Now, if the first meaning is adopted, the verse would mean: \"I seek refuge with the Lord of rising dawn\", and according to the second meaning, it would mean: \"I seek refuge with the Lord of all creation.\" Here the attribute of \"Rabb\" has been used for Allah instead of His proper Name, for Allah's attribute of being Rabb, i. e. Master, Sustainer and Providence, is more relevant to seeking and taking of His refuge. Then, if Rabbtrl-falaq implies Lord of the rising dawn, seeking His refuge would mean: \"I seek refuge with the Lord Who brings out the bright daylight from the darkness of night so that He may likewise bring well-being for me from all kinds of physical and psychical dangers.\" If it is taken to mean Rabb al-khalaq the meaning would be: \"1 seek refuge with the Lord of all creation, so that He may protect me from the evil of His creation.\"",
    "Translation": null,
    "TranslationAbridged": "Say: “I seek refuge with the Lord of the rising day;1"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "مِنْ شَرِّ مَا خَلَقَۙ",
    "Id": 6227,
    "SurahNumber": 113,
    "Tafseer": "4 In other words: \"I seek His refuge from the evil of all creatures.\" A few things in this sentence deserve consideration; \nFirst, that the creation of evil has not been attributed to Allah, but the creation of creatures has been attributed to Allah and of evil to the creatures. That is, it has not been said: \"I seek refuge from the evils that Allah has created\" but that \"I seek refuge from the evil of the things He has created.\" This shows that Allah has not created any creature for the sake of evil, but all His work is for the sake of good and a special purpose. However, from the qualities that He has created in the creatures to fulfil the purpose of their creation, sometimes evil appears from some kinds of creatures in most cases. \nSecond, that even if this one sentence was given and no mention made of seeking Allah's refuge separately from the evils of some particular kinds of creatures in the following sentences, this one sentence alone would have sufficed to express the intent, for in it Allah's refuge has been sought from the evil of all creatures. After this general prayer for refuge making mention of seeking refuge from some particular evils by itself gives this meaning: \"Though I seek Allah's refuge from the evil of everything created by Allah, I stand in great need of Allah's refuge from the particular evils that have been mentioned in the remaining verses of Surah Al-Falaq and Surah An-Nas.\" \nThird, that the most suitable and effective prayer for seeking refuge from the evil of the creatures is that refuge should be sought with their Creator, for He is in any case dominant over His creatures and is aware of their evils, which we know, as well as of those which we do not know. Hence, His refuge is the refuge of the supreme Ruler Whom no power can fight and oppose, and with His refuge we can protect ourselves from every evil of every creature, whether we are aware of it or not. Moreover, this contains the prayer for refuge not only from the evils of the world but also from every evil of the Hereafter. \nFourth, that the word sharr (evil) is used for loss, injury, trouble and affliction as well as for the means which cause losses and injuries and afflictions; for example, hunger, disease, injury in accident or war, being burnt by fire, being stung or bitten by a scorpion or snake, being involved in the grief of children's death and similar other evils which are evils in the first sense, for they are by themselves troubles and afflictions. Contrary to this, unbelief, polytheism and every kind of sin and wickedness, for instance, are evils in the second sense, for they cause loss and affliction, although apparently they do not cause any trouble at the moment, rather some sins give pleasure and bring profit. Thus, seeking refuge from evil comprehends both these meanings. \nFifth, that seeking refuge from evil contains two other meanings also. First, that tnan is praying to his God to protect him from the evil that has already taken place; second, that man is praying to his God to protect him from the evil that has not yet taken place.",
    "Translation": null,
    "TranslationAbridged": "from the evil of all that He created;"
},
{
    "Abridged": "Refuge is sought from night’s darkness because most of the crimes and acts of injustice and oppression are committed at night. Moreover, most dangerous animals also come out of their hiding places and go around at night.",
    "AyahNumber": 3,
    "AyahTextQalam": "وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ",
    "Id": 6228,
    "SurahNumber": 113,
    "Tafseer": "5 After seeking Allah's refuge generally from the evil of the creatures, now prayer is being taught for seeking refuge from the evil of some special creatures in particular. The word ghasiq in the verse literally means dark. Thus, at another place in the Qur'an it has been said: \"establish the salat from the declining of the sun to the darkness of the night (ila ghasaq-il- lain.\" (Bani lsra'il: 78) , and wagab means to enter or to overspread. Prayer has been taught to seek refuge in particular from the evil of the darkness of night, for most of the crimes and acts of wickedness are committed at night, harmful animals also come out at night, and the night was a very dreadful thing in the days chaos prevailed in Arabia when these verses were revealed. Raiders came out in the dark of night and plundered and destroyed settlements. The people who were thinking of putting the Holy Prophet (upon whom be peace) to death, also made their secret plans at night, so that the murder could not be detected. Therefore, command was given to seek Allah's refuge from the evils and calamities which descend at night. Here, the subtle relation that exists between seeking refuge from the evil of the dark night with the Lord of breaking dawn cannot remain hidden from anybody having insight and understanding. \nA difficulty is confronted in the explanation of this verse' in view of several authentic traditions. Hadrat `A'ishah has reported: \"Once during a moon-lit night, the Holy Prophet (upon whom be peace) look hold of my hand and pointing to the moon said: `Seek Allah's refuge, for this is al ghasiq idha wagab'. (Tirmidhi, Ahmad, Nasa'i, lbn Jarir, Ibn al-Mundhir, Hakim, Ibn Marduyah) . To explain this some scholars said that idha wagab here means idha khasaf, i. e. when the moon is eclipsed. But in no tradition has it been mentioned that when the Holy Prophet pointed to the moon, it was in eclipse. In the Arabic lexicon also idha wagab cannot mean idha khalaf. In our opinion the correct explanation of this Hadith is that since the moon rises in the night (in the daytime it does not shine even if it is there in the sky) , what the Holy Prophet meant was this: 'Seek God's refuge from the night, the time when it (the moon) appears, for the light of the moon is not as helpful for the one who resists as for the one who attacks, and not as helpful for the victim of the crime as for the culprit.' On this very basis the Holy Prophet (upon whom be peace) is reported to have said: \"When the sun has set, devils scatter on every side. Therefore, gather your children together in the house and keep your animals tied down until the darkness of night disappears.\"",
    "Translation": null,
    "TranslationAbridged": "from the evil of night’s darkness when it spreads around;2"
},
{
    "Abridged": "3 This refers to magicians and sorcerers, both male and female.",
    "AyahNumber": 4,
    "AyahTextQalam": "وَ مِنْ شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِۙ",
    "Id": 6229,
    "SurahNumber": 113,
    "Tafseer": "6 The word ' uqad in naffathat frl-'eqad is plural of 'uqdah, which means a knot that is tied on a string or piece of thread. Nafath means to blow. Naftathat is plural of naffathah, which may mean the men who blow much, and if taken as a feminine gender, women who blow much; it may as well relate to nufus (human beings) or to jama ats (groups of men) , for both nafas and jama 'at are grammatically feminine. Blowing upon knots, according to most, rather all, comentators implies magic, for the magicians usually tie knots on a string or thread and blow upon them as they do so. Thus, the verse means: \"I seek refuge with the Lord of rising dawn from the evil of magicians, male and female.\" This meaning is also supported by the traditions which show that when magic was worked on the Holy Prophet (upon whom be peace) , Gabriel (peace be on him) had come and taught hint to recite the Mu awwidhatayn, and in the Mu'awwidhatayn this is the only sentence which relates directly to magic. Abu Muslim Isfahani and Zamakhshari have given another meaning also of naffathat fil-'uqad, which is that it implies the deceitfulness of women and their influencing men's resolutions, views and ideas and this has been compared to a magic spell, for in the love of women man starts behaving as if he was under a spell. Though this explanation is interesting, it runs counter to the commentary given by the earliest scholars; and it also does not correspond to the conditions in which the Mu awwidhatayn were sent down as we have shown in the Introduction. \nAbout magic one should know that in it since help is sought of the satans and evil spirits or stars to influence the other person evilly, it has been called kufr (unbelief) in the Qur'an: \"Solomon was not involved in kufr but the satans who taught tragic to the people.\" (AI-Baqarah: 102) . But even if it dces not contain any word of kufr, or any polytheistic element, it is forbidden and unlawful and the Holy Prophet (upon whom be peace) has counted it among the seven heinous sins which ruin the Hereafter of man. In Bukhari and Muslim a tradition has been related from Hadrat Abu Hurairah, saying that the Holy Prophet (upon whom be peace) said: \"Avoid seven deadly sins: associating another with Allah, magic, killing a soul, which AIIah has forbidden unjustly, devouring interest, eating the orphan's property, fleeing from the enemy in the battlefield, and slandering simple and chaste Muslim women with un-chastity.\"",
    "Translation": null,
    "TranslationAbridged": " from the evil of the women who blow on knots;3"
},
{
    "Abridged": "4 Refuge is sought from envy because it prompts people to harm others.",
    "AyahNumber": 5,
    "AyahTextQalam": "وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ۠",
    "Id": 6230,
    "SurahNumber": 113,
    "Tafseer": "7 Hasad means that a person should feel unhappy at the better fortune, superiority or good quality that Allah has granted to another, and should wish that it should be taken away from the other person and given to him, or at least the other one should be deprived of it. However, hasad does not mean that a person should wish that he too should be blessed with the bounty that the other one has been blessed with. Here, Allah's refuge has been sought from the evil of the jealous one when he feels jealous, and takes a practical step with word or deed to satisfy his heart. For until he takes a practical step, his being unhappy may by itself be bad but it is not an evil for the other person so that he may seek refuge from it. When such an evil appears from a jealous person the best thing would be to seek Allah's refuge from it. Besides this, there are a few other things also which are helpful for obtaining immunity from the evil of the jealous person. First, that one should have trust in AIIah and the faith that unless AIIah so wills no one can harm him in any way. Second, that one should have patience over what the jealous person says and dces and should not start behaving impatiently so as to be degraded morally to the level of the jealous person. Third, that one should in any case maintain dignity and practise piety even if the jealous person behaves frivolously, being fearless of God and shameless of the people. Fourth, that one should free one's mind of every thought about the jealous person and should disregard him altogether, for making him a subject of one's thought is a prelude to being influenced by him. Fifth, that one should do the jealous person a good turn as and when one can, not to speak of treating him evilly, no matter whether this good behaviour mitigates his jealousy or not. Sixth, that one should understand rightly and remain steadfast to the doctrine of Tauhid for the heart which enshrines Tauhid, cannot be affected by anyone else's fear except the fear of Allah.",
    "Translation": null,
    "TranslationAbridged": "and from the evil of the envier when he envies.”4"
},
{
    "Abridged": "",
    "AyahNumber": 0,
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 8,
    "SurahNumber": 114,
    "Tafseer": "1. One of the many good practices taught by Islam is that its followers should begin all their activities in the name of God. This principle, if consciously and earnestly followed, will necessarily yield three beneficial results. First, one will be able to restrain oneself from many a misdeed, since the habit of pronouncing the name of God is bound to make one wonder when about to commit some offence how such an act can be reconciled with the saying of God's holy name. Second, if a man pronounces the name of God before starting good and legitimate tasks, this act will ensure that both his starting point and his mental orientation are sound. Third and this is the most important benefit - when a man begins something by pronouncing God's name, he will enjoy God's support and succour; God will bless his efforts and protect him from the machinations and temptations of Satan. For whenever man turns to God, God turns to him as well.",
    "Translation": "In the name of Allah, the Merciful, the Compassionate.1",
    "TranslationAbridged": "In the name of Allah, the Most Merciful, the Most Compassionate."
},
{
    "Abridged": null,
    "AyahNumber": 1,
    "AyahTextQalam": "قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ",
    "Id": 6231,
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "Say: “I seek refuge with the Lord of mankind;"
},
{
    "Abridged": null,
    "AyahNumber": 2,
    "AyahTextQalam": "مَلِكِ النَّاسِۙ",
    "Id": 6232,
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "the King of mankind,"
},
{
    "Abridged": "",
    "AyahNumber": 3,
    "AyahTextQalam": "اِلٰهِ النَّاسِۙ",
    "Id": 6233,
    "SurahNumber": 114,
    "Tafseer": "1 Here also, as in Surah Al-Falaq, instead of saying A'udhu-billahi (I seek Allah's refuge) , a prayer has beat taught to seek Allah's refuge by reference to His throe attributes: first, that He is Rabb-un nas, i.e. Sustainer, Providence and Master of all mankind; third, that He is Ilah-un-nas, i.e. real Deity of all mankind, (Here, one should clearly understand that the word ilah has been used in two meanings in the Qur'an: first for the thing or person who is practically being worshipped although it or he is not entitled to worship; second, for Him Who is ' entitled to worship, Who is in fact the Deity whether the people worship Him or not, wherever this word is used for Allah; it has been used in the second meaning) . Seeking refuge by means of these throe attributes means: \"I seek refuge with that God, Who being the Sustainer, King and Deity of men, has full power over them, can fully protect them and can really save them from the evil, to save myself and others from which 1 am seeking His refuge. Not only this: since He alone is Sustainer, King and Deity, therefore, there is no one beside Him with Whom I may seek refuge and he may give real refuge.\"",
    "Translation": null,
    "TranslationAbridged": "the True God of mankind,"
},
{
    "Abridged": "1 That is, when this prompter to evil does not succeed in deluding someone by his whisperings, he withdraws. But then he returns over and over again, whispering to him that which is evil.",
    "AyahNumber": 4,
    "AyahTextQalam": "مِنْ شَرِّ الْوَسْوَاسِ١ۙ۬ الْخَنَّاسِ۪ۙ",
    "Id": 6234,
    "SurahNumber": 114,
    "Tafseer": "2 The word waswas in waswas-il-khannas means the one who whispers over and over again, and waswasa means to whisper into someone's heart an evil suggestion over and over again in such a way or ways that the one who is being inspired may not feel that the whisperer is whispering an evil suggestion into his heart. Waswasah by itself suggests repetition just as zalzalah contains the meaning of repetitive movement. Since man is not tempted by just one attempt but effort has to be made over and over again to seduce and tempt him, such aII attempt is called waswasah and the tempter waswas. As for the word khannas, it is derived from khunus, which means to hide after appearing and to retreat after coming into view. Since khannas is the intensive form, it would imply the one who behaves thus very frequently. Now, obviously the whisperer has to approach man for whispering again and again, and besides, when he is also described as khannas, the combination of the two words by 'itself gives the meaning that after whispering once he retreats and then again returns over and over again to repeat the act of whispering. In other words, when once he fails in his attempt to whisper evil, he withdraws, then he again returns to make the second and the third and the next attempt over and over again. \nAfter understanding the meaning of waswas-il-khannas, let us consider what is meant by seeking refuge from its evil. Its one meaning is that the seeker after refuge himself seeks God's refuge from its evil, i.e. from the evil lest it should whisper some evil suggestion into his own heart. The second meaning is that the caller to Truth seeks God's refuge from the evil of the one who whispers evil suggestions into the hearts of the people against himself. It is not in his own power to approach aII the people in whose hearts evil suggestions are being whispered against himself individually and remove the misunderstandings of every person. It is also not right and proper for him that he should give up his mission of inviting others to AIlah and should devote aII his tune and energy to removing the misunderstanding created by the whisperer and to answering their accusations. It is also below his dignity that he should stoop to the level of his opponents. Therefore, Allah has instructed the caller to Truth to seek only His refuge from the evil of the wicked people, and then to attend single-mindedly to his work of invitation and mission. For it is not for him to deal with them but for Allah, who is Sustainer of men, King of,men, God of men. \nHere, one should also understand that an evil suggestion is the starting , point of evil act. When it affects a careless or heedless person, it creates in him a desire for evil. Then, further whisperings change the evil desire into an evil intention and evil purpose. When the evil suggestion grows in intensity, the intention becomes a resolution, which then culminates in the evil act. Therefore, the meaning of seeking God's refuge from the evil of the whisperer is that Allah should nip the evil in the bud. \nIf seen from another aspect, the order of the evil of the whisperers seems to be this: first. they incite one to open unbelief, polytheism, or rebellion against AIIah and His Messenger, and enmity of the righteous (godly) people. If they fail in this and a person dces enter Allah's religion, they misguide him to some innovation. If they fail in this too, they tempt him to sin. If they do not succeed even in this, they inspire the tnan with the suggestion that there is no haran in indulging in minor sins, so that if he starts committing these freely, he is over burdened with sin. If one escapes from this too, in the last resort they try that one should keep the true religion confined to oneself, and should do nothing to make it prevail, but if a person defeats all these plans, the whole party of the devils froth among men and jinn makes a common front against him incites and stirs up the people and makes them shower him with invective and accusation and slander, and defames him as widely as it can. Then, Satan comes to the believer and excites hisn to anger, saying: \"It is cowardly of you to have borne aII this insult: arise and clash with your opponents.\" This is the last and final device with Satan by which he tries to thwart the struggle of the caller to Truth and entangle him in difficulties and obstructions. If he succeeds in escaping from this too, Satan becomes powerless before him. About this same thing it has been said in the Qur'an: \"If Satan ever excites you to anger, seek refuge with Allah.\" (Al-A`raf: 200, Ha Mim As-Sajdah: 36) ; \"Say: Lord, I seek refuge with You from the promptings of satans.\" (Al-Mu'minun: 97) ; \"The fact is that if ever an evil suggestion from Satan so much as touches those, who are God-fearing people, they immediately get alerted and clearly see the right course they should adopt.\" (AI-A`raf: 201) . And on this very basis about the people who escape from this last attack of Satan Allah says: \"None can attain to this rank except those who are men of great good fortune.\" (Ha Mim As-Sajdah: 35) . \nIn this connection, another thing also should be kept in mind, and it is this: EviL suggestion is not whispered into the heart of man only from outside by the satans from among men and jinn, but also by the self of man from within. His own wrong theories misguide his intellect, his own unlawful motives and desires lead his power of discrimination, will and power of judgement astray, and it is not only the satans from outside but within tnan his satan of the self also beguiles him. This same thing has been expressed in the Qur'an, thus: \"and We know the evil suggestions arising from his self.\" (Qaf : 16) . On this very basis, the Holy Prophet (upon whom be peace) in his well-known Sermon said: \"We seek Allah's refuge from the evils of our self.\"",
    "Translation": null,
    "TranslationAbridged": "from the mischief of the whispering, elusive prompter who returns again and again,1"
},
{
    "Abridged": null,
    "AyahNumber": 5,
    "AyahTextQalam": "الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِۙ",
    "Id": 6235,
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": null,
    "TranslationAbridged": "who whispers in the hearts of people; "
},
{
    "Abridged": "2 That is, one ought to seek refuge with God from such whisperers, regardless of whether they belong to the human species or jinn.",
    "AyahNumber": 6,
    "AyahTextQalam": "مِنَ الْجِنَّةِ وَ النَّاسِ۠",
    "Id": 6236,
    "SurahNumber": 114,
    "Tafseer": "3 According to some scholars, these words mean that the whisperer whispers evil into the hearts of two kinds of people: the jinn and the men. If this meaning is admitted, the word nas would apply to both jinn and men. They say that this can be so, for when the word rijali (men) in the Qur'an has been used for the jinn, as in Al-Jinn: 6, and when nafar can be used for the group of jinn, as in A1-Ahqaf: 29, men and jinn both can be included metaphorically in the word nas also. But this view is wrong because the words nas, ins and ihsan are even lexically contrary in meaning to the word jinn. The actual meanutg of jinn is hidden creation and jinn is called jinn because he is hidden from man's eye. On the contrary, the words nas and ins are spoken for insan (man) only on the basis that he is manifest and visible and perceptible. In Surah Al-Qasas: 29, the word anasa has been used in the meaning of ra a, i.e. \"the Prophet Moses saw a fire in the direction of Tur. \" In Surah An-Nisa': 6, the word anastum has been used in the meaning of ahsastum or ra aytum (i.e. if you perceive or see that the orphans have become capable) . Therefore, nas canot apply to jinn lexically, and the correct meaning of the verse is: \"from the evil of the whisperer who whispers evil into the hearts of men, whether he be from among the jinn or from the men themselves.\" In other words, whispering of evil is done by devils from among jinn as well as by devils from among rnen and the prayer in this Surah has been taught to seek refuge from the evil of both. This meaning is supported by the Qur'an as well as by the Hadith. The Qur'an says: \"And so it has always been that We set against every Prophet enemies from among devils of men and devils of jinn, who have been inspiring one another with charming things to delude the minds.\" (Al-An'am :112) \nAnd in the Hadith, lmam Ahmad, Nasa'i, and Ibn Hibban have related on the authority of Hadrat Abu Dharr a tradition, saying: \"I sat before the Holy Prophet (upon whom be peace) , who was in the Mosque. He said: Abu Dharr, have you performed the Prayer? I replied in the negative. He said: Arise and perform the Prayer. So, I performed the Prayer. The Holy Prophet said: O Abu Dharr, seek Allah's refuge from the devils of men and the devils of jinn. I asked. are there devils among rnen also? O Messenger of Allah! He replied: Yes.\"",
    "Translation": null,
    "TranslationAbridged": "whether he be from the jinn or humans.”2"
}
]