[
    {
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6291,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "اَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِاَصْحٰبِ الْفِيْلِ",
    "AyahTextPdms": "اَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِاَصۡحٰبِ الۡفِيۡلِؕ",
    "AyahTextQalam": "اَلَمْ تَرَ كَیْفَ فَعَلَ رَبُّكَ بِاَصْحٰبِ الْفِیْلِؕ",
    "Id": 6292,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 30,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": "سورة الفیل   1\nخطاب بظاہر نبی (صلی اللہ علیہ وآلہ وسلم) سے ہے، مگر اصل مخاطب نہ صرف قریش بلکہ عرب کے عام لوگ ہیں جو اس سارے قصے سے خوب واقف تھے۔ قرآن مجید میں بکثرت مقامات پر الم تر (کیا تم نے نہیں دیکھا) کے الفاظ استعمال ہوئے ہیں اور ان سے مقصود نبی (صلی اللہ علیہ وآلہ وسلم) کو نہیں بلکہ عام لوگوں کو مخاطب کرنا ہے (مثال کے طور پر آیات ذیل ملاحظہ ہوں۔ ابراہیم، آیت 19 ۔ الحج 18 ۔ 65 ۔ النور 43 ۔ لقمان 29 ۔ 31 ۔ فاطر 27 ۔ الزمر 21) پھر دیکھنے کا لفظ اس مقام پر اس لیے استعمال کیا گیا ہے کہ مکہ اور اطراف مکہ اور عرب کے ایک وسیع علاقے میں مکہ سے یمن تک ایسے بہت سے لوگ اس وقت زندہ موجود تھے جنہوں نے اپنی آنکھوں سے اصحاب الفیل کی تباہی کا واقعہ دیکھا تھا کیونکہ اس واقعہ کو گزرے ہوئے چالیس پینتالیس سال سے زیادہ زمانہ نہیں ہوا تھا، اور سارا عرب ہی اس کی ایسی متواتر خبریں دیکھنے والوں سے سن چکا تھا کہ یہ واقعہ لوگوں کے لیے آنکھوں دیکھے واقعہ کی طرح یقینی تھا۔\n سورة الفیل   2\nیہاں اللہ تعالیٰ نے کوئی تفصیل اس امر کی بیان نہیں کی کہ یہ ہاتھی والے کون تھے، کہاں سے آئے تھے اور کس غرض کے لیے آئے تھے، کیونکہ یہ باتیں سب کو معلوم تھیں۔",
    "Translation": "تم نے دیکھا نہیں 1 کہ تمہارے ربّ نے ہاتھی والوں کے ساتھ کیا کیا؟ 2",
    "Words": " اَلَمْ تَرَ : کیا تم نے نہیں دیکھا   |   كَيْفَ فَعَلَ : کیسا کیا   |   رَبُّكَ : تمہارا رب   |   بِاَصْحٰبِ : والوں کے ساتھ   |   الْفِيْلِ : ہاتھی "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "اَلَمْ يَجْعَلْ كَيْدَهُمْ فِيْ تَضْلِيْلٍ",
    "AyahTextPdms": "اَلَمۡ يَجۡعَلۡ كَيۡدَهُمۡ فِىۡ تَضۡلِيۡلٍۙ",
    "AyahTextQalam": "اَلَمْ یَجْعَلْ كَیْدَهُمْ فِیْ تَضْلِیْلٍۙ",
    "Id": 6293,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 30,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": "سورة الفیل   3\nاصل میں لفظ کید استعمال کیا گیا ہے جو کسی شخص کو نقصان پہنچانے کے لیے خفیہ تدبیر کے معنی میں بولا جاتا ہے۔ سوال یہ ہے کہ یہاں خفیہ کیا چیز تھی ؟ ساٹھ ہزار کا لشکر کئی ہاتھی لیے ہوئے علانیہ یمن سے مکہ آیا تھا، اور اس نے یہ بات چھپا کر نہیں رکھی تھی کہ وہ کعبہ کو ڈھانے آیا ہے۔ اس لیے یہ تدبیر تو خفیہ نہ تھی۔ البتہ جو بات خفیہ تھی وہ حبشیوں کی یہ غرض تھی کہ وہ کعبہ کو ڈھا کر قریش کو کچل کر، اور تمام اہل عرب کو مرعوب کر کے تجارت کا وہ راستہ عربوں سے چھین لینا چاہتے تھے جو جنوب عرب سے شام و مصر کی طرف جاتا تھا۔ اس غرض کو انہوں نے چھپا رکھا تھا اور ظاہر یہ کیا تھا کہ ان کے کلیسا کی جو بےحرمتی عربوں نے کی ہے اس کا بدلہ وہ ان کا معبد ڈھا کرلینا چاہتے ہیں۔\n سورة الفیل   4\nاصل الفاظ ہیں فِيْ تَضْلِيْلٍ ۔ یعنی ان کی تدبیر کو اس نے \" گمراہی میں ڈال دیا \" لیکن محاورے میں کسی تدبیر کو گمراہ کرنے کا مطلب اسے ضائع کردینا اور اسے اپنا مقصد حاصل کرنے میں ناکام کردینا ہے، جیسے ہم اردو زبان میں کہتے ہیں فلاں شخص کا کوئی داؤں نہ چل سکا، یا اس کا کوئی تیر نشانے پر نہ بیٹھا۔ قرآن مجید میں ایک جگہ فرمایا گیا ہے وَمَا كَيْدُ الْكٰفِرِيْنَ اِلَّا فِيْ ضَلٰلٍ \" مگر کافروں کی چال اکارت ہی ہوگئی \" (المومن، 25) اور دوسری جگہ ارشاد ہوا وَاَنَّ اللّٰهَ لَايَهْدِيْ كَيْدَ الْخَاۗىِٕنِيْنَ \" اور یہ کہ اللہ خائنوں کی چال کو کامیابی کی راہ پر نہیں لگاتا \" (یوسف، 52) اہل عرب امرؤ القیس کو الملک الضلیل \" ضائع کرنے والا بادشاہ \" کہتے تھے، کیونکہ اس نے اپنے باپ سے پائی ہوئی بادشاہی کو کھو دیا تھا۔",
    "Translation": "کیا اُس نے اُن کی تدبیر 3 کو اَکارَت نہیں کر دیا؟ 4",
    "Words": " اَلَمْ : کیا نہیں   |   يَجْعَلْ : کردیا   |   كَيْدَهُمْ : ان کا داؤ   |   فِيْ تَضْلِيْلٍ : گمراہی میں (بیکار)"
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "وَّاَرْسَلَ عَلَيْهِمْ طَيْرًا اَبَابِيْلَ",
    "AyahTextPdms": "وَّاَرۡسَلَ عَلَيۡهِمۡ طَيۡرًا اَبَابِيۡلَۙ",
    "AyahTextQalam": "وَّ اَرْسَلَ عَلَیْهِمْ طَیْرًا اَبَابِیْلَۙ",
    "Id": 6294,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 30,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": "سورة الفیل   5\nاصل میں طَيْرًا اَبَابِيْلَ کے الفاظ استعمال ہوئے ہیں۔ اردو زبان میں چونکہ ابابیل خاص قسم کے پرندے کو کہتے ہیں اس لیے ہمارے ہاں لوگ عام طور پر یہ سمجھتے ہیں کہ ابرھہ کی فوج پر ابابیلیں بھیجی گئی تھیں۔ لیکن عربی زبان میں ابابیل کے معنی ہیں بہت سے متفرق گروہ جو پے در پے مختلف سمتوں سے آئیں، خواہ وہ آدمیوں کے ہوں یا جانوروں کے۔ عکرمہ اور قتادہ کہتے ہیں کہ یہ جھنڈ کے جھنڈ پرندے بحر احمر کی طرف سے آئے تھے۔ سعید بن جبیر اور عکرمہ کہتے ہیں کہ اس طرح کے پرندے نہ پہلے کبھی دیکھے گئے تھے نہ بعد میں دیکھے گئے۔ یہ نہ نجد کے پرندے تھے، نہ حجاز کے، اور نہ تہامہ یعنی حجاز اور بحر احمر کے درمیان ساحلی علاقے کے۔ ابن عباس کہتے ہیں کہ ان کی چونچیں پرندوں جیسی تھیں اور پنجے کتے جیسے۔ عکرمہ کا بیان ہے کہ ان کے سر شکاری پرندوں کے سروں جیسے تھے۔ اور تقریبا سب راویوں کا متفقہ بیان ہے کہ ہر پرندے کی چونچ میں ایک ایک کنکر تھا اور پنجوں میں دو دو کنکر۔ مکہ کے بعض لوگوں کے پاس یہ کنکر ایک مدت تک محفوظ رہے۔ چناچہ ابو نعیم نے نوفل بن ابی معاویہ کا بیان نقل کیا ہے کہ میں نے وہ وہ کنکر دیکھے ہیں جو اصحاب الفیل پر پھینکے گئے تھے۔ وہ مٹر کے چھوٹے دانے کے برابر سیاہی مائل سرخ تھے۔ ابن عباس کی روایت ابو نعیم نے یہ نقل کی ہے کہ وہ چلغوزے کے برابر تھے اور ابن مردویہ کی روایت میں ہے کہ بکری کی مینگنی کے برابر۔ ظاہر ہے کہ سارے سنگریز ایک ہی جیسے نہ ہوں گے۔ ان میں کچھ نہ کچھ فرق ضرور ہوگا۔",
    "Translation": "اور اُن پر پرندوں کے جھُنڈ کے جھُنڈ بھیج دیے 5",
    "Words": " وَّاَرْسَلَ : اور بھیجے   |   عَلَيْهِمْ : ان پر   |   طَيْرًا : پرندے   |   اَبَابِيْلَ : جھنڈ کے جھنڈ "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "تَرْمِيْهِمْ بِحِـجَارَةٍ مِّنْ سِجِّيْلٍ",
    "AyahTextPdms": "تَرۡمِيۡهِمۡ بِحِجَارَةٍ مِّنۡ سِجِّيۡلٍ",
    "AyahTextQalam": "تَرْمِیْهِمْ بِحِجَارَةٍ مِّنْ سِجِّیْلٍ۪ۙ",
    "Id": 6295,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 30,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": "سورة الفیل   6\nاصل الفاظ ہیں بِحِـجَارَةٍ مِّنْ سِجِّيْلٍ ، یعنی سجیل کی قسم کے پتھر۔ ابن عباس فرماتے ہیں کہ یہ لفظ دراصل فارسی کے الفاظ سنگ اور گل کا معرب ہے اور اس سے مراد وہ پتھر ہے جو مٹی کے گارے سے بنا ہو اور پک کر سخت ہوگیا ہو۔ قرآن مجید سے بھی اس کی تصدیق ہوتی ہے۔ سورة ہود آیت 82 اور سورة حجر آیت 74 میں کہا گیا ہے کہ قوم لوط پر سجیل کی قسم کے پتھر برسائے گئے تھے، اور انہی پتھروں کے متعلق سورة ذاریات آیت 33 میں فرمایا گیا ہے کہ وہ حجارۃ من طین، یعنی مٹی کے گارے سے بنے ہوئے پتھر تھے۔\nمولانا حمید الدین فراھی مرحوم، جنہوں نے عہد حاضر میں قرآن مجید کے معانی و مطالب کی تحقیق پر بڑا قیمتی کام کیا ہے، اس آیت میں ترمیہم کا فاعل اہل مکہ اور دوسرے اہل عرب کو قرار دیتے ہیں جو الم تر کے مخاطب ہیں، اور پرندوں کے متعلق فرماتے ہیں کہ وہ سنگریز نہیں پھینک رہے تھے، بلکہ اس لیے آئے تھے کہ اصحاب الفیل کی لاشوں کو کھائیں۔ اس تاویل کے لیے جو دلائل انہوں نے دیے ہیں ان کا خلاصہ یہ ہے کہ عبد المطلب کا ابرھہ کے پاس جاکر کعبہ کے بجائے اپنے اونٹوں کا مطالبہ کرنا کسی طرح باور کرنے کے قابل بات نہیں ہے، اور یہ بات بھی سمجھ میں آنے والی نہیں ہے کہ قریش کے لوگوں اور دوسرے عربوں نے جو حج کے لیے آئے ہوئے تھے، حملہ آور فوج کا کوئی مقابلہ نہ کیا ہو اور کعبے کو اس کے رحم و کرم پر چھوڑ کر وہ پہاڑوں میں جا چھپے ہوں۔ اس لیے صورت واقعہ دراصل یہ ہے کہ عربوں نے ابرھہ کے لشکر کو پتھر مارے، اور اللہ تعالیٰ نے پتھراؤ کرنے والی طوفانی ہوا بھیج کر اس لشکر کا بھرکس نکال دیا، پھر پرندے ان لوگوں کی لاشیں کھانے کے لیے بھیجے گئے۔ لیکن جیسا کہ ہم دیباچے میں بیان کرچکے ہیں، روایت صرف یہی نہیں ہے کہ عبدالمطلب اپنے اونٹوں کا مطالبہ کرنے گئے تھے، بلکہ یہ بھی ہے کہ انہوں نے اونٹوں کا کوئی مطالبہ نہیں کیا تھا اور ابرھہ کو خانہ کعبہ پر حملہ کرنے سے باز رکھنے کی کوشش کی تھی۔ ہم یہ بھی بتا چکے ہیں کہ تمام معتبر روایات کی رو سے ابرھہ کا لشکر محرم میں آیا تھا جبکہ حجاج واپس جا چکے تھے۔ اور یہ بھی ہم نے بتادیا ہے کہ 60 ہزار کے لشکر کا مقابلہ کرنا قریش اور آس پاس کے عرب قبائل کے بس کا کام نہ تھا، وہ تو غزوہ احزاب کے موقع پر بڑی تیاریوں کے بعد مشرکین عرب اور یہودی قبائل کی جو فوج لائے تھے وہ دس بارہ ہزار سے زیادہ نہ تھی، پھر بھلا وہ 60 ہزار فوج کا مقابلہ کرنے کی کیسے ہمت کرسکتے تھے۔ تاہم ان ساری دلیلوں کو نظر انداز بھی کردیا جائے اور صرف سورة فیل کی ترتیب کلام کو دیکھا جائے تو یہ تاویل اس کے خلاف پڑتی ہے۔ اگر بات یہی ہوتی کہ پتھر عربوں نے مارے، اور اصحاب فیل بھس بن کر رہ گئے اور اس کے بعد پرندے ان کی لاشیں کھانے کو آئے، تو کلام کی ترتیب یوں ہوتی کہ تَرْمِيْهِمْ بِحِـجَارَةٍ مِّنْ سِجِّيْلٍ فَجَــعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ وَّاَرْسَلَ عَلَيْهِمْ طَيْرًا اَبَابِيْلَ (تم ان کو پکی ہوئی مٹی کے پتھر مار رہے تھے، پھر اللہ نے ان کو کھائے ہوئے بھس جیسا کردیا، اور اللہ نے ان پر جھنڈ کے جھنڈ پرندے بھیج دیے) لیکن یہاں ہم دیکھتے ہیں کہ پہلے اللہ تعالیٰ نے پرندوں کے جھنڈ بھیجنے کا ذکر فرمایا ہے، پھر اس کے متصلا بعد تَرْمِيْهِمْ بِحِـجَارَةٍ مِّنْ سِجِّيْلٍ (جو ان کو پکی ہوئی مٹی کے پتھر مار رہے تھے) فرمایا ہے اور آخر میں کہا کہ پھر اللہ نے ان کو کھائے ہوئے بھس جیسا کردیا۔",
    "Translation": "جو اُن پر پکّی ہوئی مَٹّی کے پتھر پھینک رہے تھے، 6",
    "Words": " تَرْمِيْهِمْ : پھینکتے تھے   |   بِحِجَارَةٍ : کنکریاں   |   مِّنْ : سے   |   سِجِّيْلٍ : سنگ گل "
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "فَجَــعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ",
    "AyahTextPdms": "فَجَعَلَهُمۡ كَعَصۡفٍ مَّاۡكُوۡلٍ",
    "AyahTextQalam": "فَجَعَلَهُمْ كَعَصْفٍ مَّاْكُوْلٍ۠",
    "Id": 6296,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 30,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفيل",
    "SurahNameEnglish": "Al-Fil",
    "SurahNumber": 105,
    "Tafseer": "سورة الفیل   7\nاصل الفاظ ہیں كَعَصْفٍ مَّاْكُوْلٍ ، عصف کا لفظ سورة رحمان آیت 12 میں آیا ہے۔ ذُو الْعَصْفِ وَالرَّيْحَانُ \" اور غلہ بھوسے اور دانے والا \"۔ اس سے معلوم ہوا کہ عصف کے معنی اس چھلکے کے ہیں جو غلے کے دانوں پر ہوتا ہے اور جسے کسان دانے نکال کر پھینک دیتے ہیں، پھر جانور اسے کھاتے بھی ہیں، اور کچھ ان کے چبانے کے دوران میں گرتا بھی جاتا ہے، اور کچھ ان کے پاؤں تلے روندا بھی جاتا ہے۔",
    "Translation": "پھر اُن کا یہ حال کر دیا  جیسے جانوروں کا کھایا ہوا بھوسا۔ 7",
    "Words": " فَجَعَلَهُمْ : پس ان کو کردیا   |   كَعَصْفٍ : بھوسہ کی طرح   |   مَّاْكُوْلٍ : کھائے ہوئے "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6297,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "قريش",
    "SurahNameEnglish": "Quraish",
    "SurahNumber": 106,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "لِاِيْلٰفِ قُرَيْشٍ",
    "AyahTextPdms": "لِاِيۡلٰفِ قُرَيۡشٍۙ",
    "AyahTextQalam": "لِاِیْلٰفِ قُرَیْشٍۙ",
    "Id": 6298,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 31,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "قريش",
    "SurahNameEnglish": "Quraish",
    "SurahNumber": 106,
    "Tafseer": "سورة القریش   1\nاصل الفاظ ہیں لِاِيْلٰفِ قُرَيْشٍ ۔ ایلاف الف سے ہے جس کے معنی خوگر ہونے، مانوس ہونے، پھٹنے کے بعد مل جانے، اور کسی چیز کی عادت اختیار کرنے کے ہیں۔ اردو زبان میں الفت اور مالوف کے الفاظ بھی اسی سے ماخوذ ہیں۔ ایلاف سے پہلے جو لام آیا ہے اس کے متعلق عربی زبان کے بعض ماہرین نے یہ رائے ظاہر کی ہے کہ یہ عربی محاورے کے مطابق تعجب کے معنی میں ہے۔ مثلا عرب کہتے ہیں کہ لزید و ما صنعنا بہ، یعنی ذرا اس زید کو دیکھو کہ ہم نے اس کے ساتھ کیسا نیک سلوک کیا اور اس نے ہمارے ساتھ کیا کیا۔ پس لِاِيْلٰفِ قُرَيْشٍ کا مطلب یہ ہے کہ قریش کا رویہ بڑا ہی قابل تعجب ہے کہ اللہ ہی کے فضل کی بدولت وہ منتشر ہونے کے بعد جمع ہوئے اور ان تجارتی سفروں کے خوگر ہوگئے جو ان کی خوشحالی کا ذریعہ بنے ہوئے ہیں اور وہ اللہ ہی کی بندگی سے روگردانی کر رہے ہیں۔ یہ رائے اخفش، کسارئی، اور فراء کی ہے، اور اس رائے کو ابن جریر نے ترجیح دیتے ہوئے لکھا ہے کہ عرب جب اس لام کے کسی بات کا ذکر کرتے ہیں تو وہی بات یہ ظاہر کرنے کے لیے کافی سمجھتی جاتی ہے کہ اس کے ہوتے جو شخص کوئی رویہ اختیار کر رہا ہے وہ قابل تعجب ہے۔ بخلاف اس کے خلیل بن احمد، سیبویہ اور زمخشری کہتے ہیں کہ یہ لام تعلیل ہے اور اس کا تعلق آگے کے فقرے فَلْيَعْبُدُوْا رَبَّ هٰذَا الْبَيْتِ سے ہے۔ مطلب اس کا یہ ہے کہ یوں تو قریش پر اللہ کی نعمتوں کا کوئی شمار نہیں، لیکن اگر کسی اور نعمت کی بنا پر نہیں تو اسی ایک نعمت کی بنا پر وہ اللہ کی بندگی کریں کہ اس کے فضل سے وہ ان تجارتی سفروں کے خوگر ہوئے، کیونکہ یہ بجائے خود ان پر اس کا بہت بڑا احسان ہے۔",
    "Translation": "چونکہ قریش مانوس ہوئے 1",
    "Words": " لِاِيْلٰفِ : مانوس کرنے کے سبب   |   قُرَيْشٍ : قریش "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "اٖلٰفِهِمْ رِحْلَةَ الشِّتَاۗءِ وَالصَّيْفِ",
    "AyahTextPdms": "اٖلٰفِهِمۡ رِحۡلَةَ الشِّتَآءِ وَالصَّيۡفِ‌ۚ",
    "AyahTextQalam": "اٖلٰفِهِمْ رِحْلَةَ الشِّتَآءِ وَ الصَّیْفِۚ",
    "Id": 6299,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 31,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "قريش",
    "SurahNameEnglish": "Quraish",
    "SurahNumber": 106,
    "Tafseer": "سورة القریش   2\nگرمی اور جاڑے کے سفروں سے مرادیہ ہے کہ گرمی کے زمانے میں قریش کے تجارتی سفر شام و فلسطین کی طرف ہوتے تھے، کیونکہ وہ ٹھنڈے علاقے ہیں، اور جاڑے کے زمانے میں وہ جنوب عرب کی طرف ہوتے تھے، کیونکہ وہ گرم علاقے ہیں۔",
    "Translation": "(یعنی) جاڑے اور گرمی کے سفروں سے مانوس، 2",
    "Words": " اٖلٰفِهِمْ : ان کا مانوس کرنا   |   رِحْلَةَ : سفر   |   الشِّتَآءِ : سردی   |   وَ : اور   |  الصَّيْفِ : گرمی "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "فَلْيَعْبُدُوْا رَبَّ هٰذَا الْبَيْتِ",
    "AyahTextPdms": "فَلۡيَـعۡبُدُوۡا رَبَّ هٰذَا الۡبَيۡتِۙ‏",
    "AyahTextQalam": "فَلْیَعْبُدُوْا رَبَّ هٰذَا الْبَیْتِۙ",
    "Id": 6300,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 31,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "قريش",
    "SurahNameEnglish": "Quraish",
    "SurahNumber": 106,
    "Tafseer": "سورة القریش   3\nاس گھر سے مراد خانہ کعبہ ہے اور اللہ تعالیٰ کے ارشاد کا مطلب یہ ہے کہ قریش کو یہ نعمت اسی گھر کی بدولت حاصل ہوئی ہے، اور وہ خود مانتے ہیں کہ وہ 360 بت اس کے رب نہیں ہیں جن کی یہ پوجا کر رہے ہیں، بلکہ صرف اللہ ہی اس کا رب ہے۔ اسی نے ان کو اصحاب فیل کے حملے سے بچایا۔ اسی سے انہوں نے ابرھہ کی فوج کے مقابلے میں مدد کی دعا کی تھی۔ اس کے گھر کی پناہ میں آنے سے پہلے جب وہ عرب میں منتشر تھے تو ان کی کوئی حیثیت نہ تھی۔ عرب کے عام قبائل کی طرح وہ بھی ایک نسل کے بکھرے ہوئے گروہ تھے۔ مگر جب وہ مکہ میں اس گھر کے گرد جمع ہوئے اور اس کی خدمت انجام دینے لگے تو سارے عرب میں محترم ہوگئے۔ اور ہر طرف ان کے تجارتی قافلے بےخوف و خطر آنے جانے لگے۔ پس انہیں جو کچھ بھی نصیب ہوا ہے اس گھر کے رب کی بدولت نصیب ہوا ہے، اس لیے اسی کی ان کو عبادت کرنی چاہیے۔",
    "Translation": "لہٰذا اُن کو چاہیے کہ اِس گھر کے ربّ کی عبادت کریں 3",
    "Words": " فَلْيَعْبُدُوْا : پس چاہیے وہ عبادت کریں   |   رَبَّ هٰذَا الْبَيْتِ : اس گھرکے رب کی "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "الَّذِيْٓ اَطْعَمَهُمْ مِّنْ جُوْعٍ     ڏ وَّاٰمَنَهُمْ مِّنْ خَوْفٍ",
    "AyahTextPdms": "الَّذِىۡۤ اَطۡعَمَهُمۡ مِّنۡ جُوۡعٍ ۙ وَّاٰمَنَهُمۡ مِّنۡ خَوۡفٍ",
    "AyahTextQalam": "الَّذِیْۤ اَطْعَمَهُمْ مِّنْ جُوْعٍ١ۙ۬ وَّ اٰمَنَهُمْ مِّنْ خَوْفٍ۠",
    "Id": 6301,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 31,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "قريش",
    "SurahNameEnglish": "Quraish",
    "SurahNumber": 106,
    "Tafseer": "سورة القریش   4\nیہ اشارہ ہے اس طرف کہ مکہ میں آنے سے پہلے جب قریش عرب میں منتشر تھے تو بھوکوں مر رہے تھے۔ یہاں آنے کے بعد ان کے لیے رزق کے دروازے کھلتے چلے گئے اور ان کے حق میں حضرت ابراہیم (علیہ السلام) کی وہ دعا حرف بحرف پوری ہوئی کہ اے پروردگار، میں نے اپنی اولاد کے ایک حصے کو تیرے محترم گھر کے پاس ایک بےآب وگیاہ وادی میں لا بسایا ہے تاکہ یہ نماز قائم کریں، پس تو لوگوں کے دلوں کو ان کا مشتاق بنا اور انہیں کھانے کو پھل دے (ابراہیم۔ آیت 37)\n سورة القریش   5\nیعنی جس خوف سے عرب کی سرزمین میں کوئی محفوظ نہیں ہے اس سے یہ محفوظ ہیں، عرب کا حال اس دور میں یہ تھا کہ پورے ملک میں کوئی بستی ایسی نہ تھی جس کے لوگ راتوں کو چین سے سو سکتے ہوں، کیونکہ ہر وقت ان کو یہ کھٹکا لگا رہتا تھا کہ نہ معلوم کب کوئی غارت گر گروہ اچانک اس پر چھاپا مار دے۔ کوئی شخص ایسا نہ تھا جو اپنے قبیلے کے حدود سے باہر قدم رکھنے کی ہمت کرسکے، کیونکہ اکا دکا آدمی کا زندہ بچ کر واپس آجانا، یا گرفتار ہو کر غلام بن جانے سے محفوظ رہنا گویا امر محال تھا۔ کوئی قافلہ ایسا نہ تھا جو اطمینان سے سفر کرسکے، کیونکہ راستے میں جگہ جگہ اس پر ڈاکہ پڑنے کا خطرہ تھا، اور راستے بھر کے بااثر قبائلی سرداروں کو رشوتیں دے کر تجارتی قافلے بخیریت گزر سکتے تھے۔ لیکن قریش مکہ میں بالکل محفوظ تھے، انہیں کسی دشمن کے حملے کا خطرہ نہ تھا۔ ان کے چھوٹے اور بڑے ہر طرح کے قافلے ملک کے ہر حصے میں آتے جاتے تھے، کوئی یہ معلوم ہوجانے کے بعد کہ قافلہ حرم کے خادموں کا ہے، انہیں چھیڑنے کی جرات نہ کرسکتا تھا۔ حد یہ ہے کہ اکیلا قریشی بھی اگر کہیں سے گزر رہا ہو اور کوئی اس سے تعرض کرے تو صرف لفظ \" حرمی \" یا انا من حرم اللہ کہہ دینا کافی ہوجاتا تھا، یہ سنتے ہی اٹھے ہوئے ہاتھ رک جاتے تھے۔",
    "Translation": "جس نے اُنہیں بھُوک سے بچا کر کھانے کو دیا 4 اور خوف سے بچا کر امن عطا کیا۔ 5",
    "Words": " الَّذِيْٓ: جو، جس   |   اَطْعَمَهُمْ : انہیں کھانا دیا   |   مِّنْ جُوْعٍ : بھوک سے   |    وَّاٰمَنَهُمْ : اور انہیں امن دیا   |   مِّنْ خَوْفٍ : خوف سے، میں "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6302,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "اَرَءَيْتَ الَّذِيْ يُكَذِّبُ بِالدِّيْنِ",
    "AyahTextPdms": "اَرَءَيْتَ الَّذِيْ يُكَذِّبُ بِالدِّيْنِ",
    "AyahTextQalam": "اَرَءَیْتَ الَّذِیْ یُكَذِّبُ بِالدِّیْنِؕ",
    "Id": 6303,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   1\nتم نے دیکھا کا خطاب بظاہر نبی (صلی اللہ علیہ وآلہ وسلم) سے ہے مگر قرآن کا انداز بیان یہ ہے کہ ایسے مواقع پر وہ عموما ہر صاحب عقل اور سوچنے سمجھنے والے شخص کو مخاطب کرتا ہے۔ اور دیکھنے کا مطلب آنکھوں سے دیکھنا بھی ہے، کیونکہ آگے لوگوں کا جو حال بیان کیا گیا ہے وہ ہر دیکھنے والا اپنی آنکھوں سے دیکھ سکتا ہے، اور اس کا مطلب جاننا، سمجھنا اور غور کرنا بھی ہے۔ عربی کی طرح اردو میں بھی دیکھنے کا لفظ اس دوسرے معنی میں استعمال ہوتا ہے۔ مثلا ہم کہتے ہیں کہ \" میں دیکھ رہا ہوں \" اور مطلب یہ ہوتا ہے کہ میں جانتا ہوں یا مجھے خبر ہے۔ یا مثلا ہم کہتے ہیں کہ \" ذرا یہ بھی تو دیکھو \" اور مطلب یہ ہوتا ہے کہ ذرا اس بات پر بھی غور کرو۔ پس اگر لفظ اَرَءَيْتَ کو اس دوسرے معنی میں لیا جائے تو آیت کا مطلب یہ ہوگا کہ \" جانتے ہو وہ کیسا شخص ہے جو جزا و سزا کو جھٹلاتا ہے \" ؟ یا \" تم نے غور کیا اس شخص کے حال پر جو جزائے اعمال کی تکذیب کرتا ہے \" ؟\n سورة الماعون   2\nاصل میں يُكَذِّبُ بالدِّيْنِ فرمایا گیا ہے۔ الدین کا لفظ قرآن کی اصطلاح میں آخرت کی جوائے اعمال کے لیے بھی استعمال ہوتا ہے اور دین اسلام کے لیے بھی۔ لیکن جو مضمون آگے بیان ہوا ہے اس کے ساتھ پہلے معنی ہی زیادہ مناسبت رکھتے ہیں۔ اگرچہ دوسرے معنی بھی سلسلہ کلام سے غیر مطابق نہیں ہیں۔ ابن عباس نے دوسرے معنی کو ترجیح دی ہے، اور اکثر مفسرین پہلے معنی کو ترجیح دیتے ہیں۔ اگر پہلی معنی لیے جائیں تو پوری سورة کے مضمون کا مطلب یہ ہوگا کہ آخرت کے انکار کا عقیدہ انسان میں یہ سیرت و کردار پیدا کرتا ہے۔ اور دوسرے معنی لیے جائیں تو پوری سورة کا مدعا دینا سلام کی اخلاقی اہمیت واضح کرنا قرار پائے گا۔ یعنی کلام کا مقصد یہ ہوگا کہ اسلام اس کے برعکس سیرت و کردار پیدا کرنا چاہتا ہے جو اس دین کا انکار کرنے والوں میں پائی جاتی ہے۔\n سورة الماعون   3\nانداز کلام سے محسوس ہوتا ہے کہ یہاں اس سوال سے بات کا آغاز کرنے کا مقصد یہ پوچھنا نہیں ہے کہ تم نے اس شخص کو دیکھا ہے یا نہیں، بلکہ سامع کو اس بات پر غور کرنے کی دعوت دینا ہے کہ آخرت کی جازا و سزا کا انکار آدم میں کس قسم کا کردار پیدا کرتا ہے، اور اسے یہ جاننے کا خواہشمند بنانا ہے کہ اس عقیدے کو جھٹلانے والے کیسے لوگ ہوتے ہیں تاکہ وہ ایمان بالآخرۃ کی اخلاقی اہمیت سمجھنے کی کوشش کرے۔",
    "Translation": "تم نے دیکھا 1 اُس شخص کو جو آخرت کی جزا و سزا 2 کو جھُٹلاتا ہے؟ 3",
    "Words": " اَرَءَيْتَ : کیا تم نے دیکھا   |   الَّذِيْ : وہ جو کہ   |   يُكَذِّبُ : جھٹلاتا ہے   |   بِالدِّيْنِ : روز جزا وسزا کو "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "فَذٰلِكَ الَّذِيْ يَدُعُّ الْيَتِيْمَ",
    "AyahTextPdms": "فَذٰلِكَ الَّذِيْ يَدُعُّ الْيَتِيْمَ",
    "AyahTextQalam": "فَذٰلِكَ الَّذِیْ یَدُعُّ الْیَتِیْمَۙ",
    "Id": 6304,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   4\nاصل میں فَذٰلِكَ الَّذِيْ فرمایا گیا ہے۔ اس فقرے میں ف ایک پورے جملے کا مفہوم ادا کرتا ہے۔ اس کے معنی یہ ہیں کہ \" اگر تم نہیں جانتے تو تمہیں معلوم ہو کہ وہی تو ہے جو \" یا پھر یہ اس معنی میں ہے کہ \" اپنے اسی انکار آخرت کی وجہ سے وہ ایسا شخص ہے جو \"۔ \n سورة الماعون   5\nاصل میں يَدُعُّ الْيَتِيْمَ کا فقرہ استعمال ہوا ہے جس کے کئی معنی ہیں۔ ایک یہ کہ وہ یتیم کا حق مار کھاتا ہے اور اس کے باپ کی چھوڑی ہوئی میراث سے بےدخل کر کے اسے دھکے مار کر نکال دیتا ہے۔ دوسرے یہ کہ یتیم اگر اس سے مدد مانگنے آتا ہے تو رحم کھانے کے بجائے اسے دھتکار دیتا ہے اور پھر بھی اگر وہ اپنی پریشان حالی کی بنا پر رحم کی امید لیے ہوئے کھڑا رہے تو اسے دھکے دے کر دفع کردیتا ہے۔ تیسرے یہ کہ وہ یتیم پر ظلم ڈھاتا ہے، مثلا اس کے گھر میں اگر اس کا اپنا ہی کوئی رشتہ دار یتیم ہو تو اس کے نصیب میں سارے گھر کی خدمتگاری کرنے اور بات بات پر چھڑکیاں اور ٹھوکریں کھانے کے سوا کچھ نہیں ہوتا۔ علاوہ بریں اس فقرے میں یہ معنی بھی پوشیدہ ہیں کہ اس شخص سے کبھی کبھار یہ ظالمانہ حرکت سرزد نہیں ہوجاتی، بلکہ اس کی عادت اور اس کا مستقل رویہ یہی ہے۔ اسے یہ احساس ہی نہیں ہے کہ یہ کوئی برا کام ہے جو وہ کر رہا ہے۔ بلکہ وہ بڑے اطمینان کے ساتھ یہ روش اختیار کیے رکھتا ہے اور سمجھتا ہے کہ یتیم ایک بےبس اور بےیارومددگار مخلوق ہے، اس لیے کوئی ہرج نہیں اگر اس کا حق مار کھایا جائے۔ یا اسے ظلم و ستم کا تختہ مشق بنا کر رکھا جائے یا وہ مدد مانگنے کے لیے آئے تو اسے دھتکار دیا جائے۔\nاس سلسلے میں ایک بڑا عجیب واقعہ قاضی ابو الحسن الماوردی نے اپنی کتاب اعلام النبوۃ میں لکھا ہے۔ ابو جہل ایک یتیم کا وصی تھا۔ وہ بچہ ایک روز اس حالت میں اس کے پاس آیا کہ اس کے بدن پر کپڑے تک نہ تھے اور اس نے التجا کی کہ اس کے باپ کے چھوڑے ہوئے مال میں سے وہ اسے کچھ دیدے۔ مگر اس ظالم نے اس کی طرف توجہ تک نہ کی اور وہ کھڑے کھڑے آخر کار مایوس ہو کر پلٹ گیا۔ قریش کے سرداروں نے ازا راہ شرارت اس سے کہا کہ محمد (صلی اللہ علیہ وآلہ وسلم) کے پاس جاکر شکایت کر، وہ ابو جہل سے سفارش کر کے تجھے تیرا مال دلوا دیں گے۔ بچہ بےچارہ ناواقف تھا کہ ابو جہل کا حضور سے کیا تعلق ہے اور یہ بدبخت اسے کس غرض کے لیے یہ مشورہ دے رہے ہیں، وہ سیدھا حضور کے پاس پہنچا اور اپنا حال آپ سے بیان کیا۔ آپ اسی وقت اٹھ کھڑے ہوئے اور اسے ساتھ لے کر اپنے بد ترین دشمن ابو جہل کے ہاں تشریف لے گئے۔ آپ کو دیکھ کر اس نے آپ کا استقبال کیا اور جب آپ نے فرمایا کہ اس بچے کا حق اسے دے دو ، تو وہ فورا مان گیا اور اس کا مال لاکر اسے دے دیا۔ قریش کے سردار تاک میں لگے ہوئے تھے کہ دیکھیں ان دونوں کے درمیان کیا معاملہ پیش آتا ہے۔ وہ کسی مزے دار جھڑپ کی امید کر رہے تھے۔ مگر جب انہوں نے یہ معاملہ دیکھا تو حیران ہو کر ابو جہل کے پاس آئے اور اسے طعنہ دیا کہ تم بھی اپنا دین چھوڑ گئے۔ اس نے کہا خدا کی قسم، میں نے اپنا دین نہیں چھوڑا، مگر مجھے ایسا محسوس ہوا کہ محمد (صلی اللہ علیہ وآلہ وسلم) کے دائیں اور بائیں ایک ایک حربہ ہے جو میرے اندر گھس جائے گا اگر میں نے ذرا بھی ان کی مرضی کے خلاف حرکت کی، اس واقعہ سے نہ صرف یہ معلوم ہوتا ہے کہ اس زمانے میں عرب کے سب سے زیادہ ترقی یافتہ اور معزز قبیلے تک کے بڑے بڑے سرداروں کا یتیموں اور دوسرے بےیارو مددگار لوگوں کے ساتھ کیا سلوک تھا، بلکہ یہ بھی معلوم ہوتا ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کس بلند اخلاق کے مالک تھے اور آپ کے اس اخلاق کا آپ کے بدترین دشمنوں تک پر کیا رعب تھا۔ اسی قسم کا ایک واقعہ ہم اس سے پہلے تفہیم القرآن، جلد سوم، صفحہ 146 پر نقل کرچکے ہیں، جو حضور کے اس زبردست اخلاقی رعب پر دلالت کرتا ہے جس کی وجہ سے کفار قریش آپ کو جادوگر کہتے تھے۔",
    "Translation": "وہی تو ہے 4 جو یتیم کو دھکّے دیتا ہے، 5",
    "Words": " فَذٰلِكَ : یہی ہے وہ   |   الَّذِيْ : جو کہ   |   يَدُعُّ : دھکے دیتا ہے   |   الْيَتِيْمَ : یتیم کو "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "وَلَا يَحُضُّ عَلٰي طَعَامِ الْمِسْكِيْنِ",
    "AyahTextPdms": "وَلَا يَحُضُّ عَلٰي طَعَامِ الْمِسْكِيْنِ",
    "AyahTextQalam": "وَ لَا یَحُضُّ عَلٰى طَعَامِ الْمِسْكِیْنِؕ",
    "Id": 6305,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   6\nاِطعَامِ الْمِسْكِيْنِ نہیں بلکہ طَعَامِ الْمِسْكِيْنِ کے الفاظ استعمال کیے گئے ہیں۔ اگر اطعام مسکین کہا گیا ہوتا تو معنی یہ ہوتے کہ وہ مسکین کو کھانا کھلانے پر نہیں اکساتا۔ لیکن طعام المسکین کے معنی یہ ہیں کہ وہ مسکین کا کھانا دینے پر نہیں اکساتا۔ بالفاظ دیگر جو کھانا مسکین کو دیا جاتا ہے وہ دینے والے کا کھانا نہیں بلکہ اسی مسکین کا کھانا ہے، وہ اس کا حق ہے جو دینے والے پر عائد ہوتا ہے، اور دینے والا کوئی بخشش نہیں دے رہا ہے بلکہ اس کا حق ادا کر رہا ہے، یہی بات ہے جو سورة ذاریات آیت 19 میں فرمائی گئی ہے کہ وَفِيْٓ اَمْوَالِهِمْ حَقٌّ لِّلسَّاۗىِٕلِ وَالْمَحْرُوْمِ \" اور ان کے مالوں میں سائل اور محروم کا حق ہے \"۔\n سورة الماعون   7\nلَا يَحُضُّ کا مطلب یہ ہے کہ وہ شخص اپنے نفس کو بھی اس کام پر آمادہ نہیں کرتا، اپنے گھر والوں کو بھی یہ نہیں کہتا کہ مسکین کا کھانا دیا کریں، اور دوسرے لوگوں کو بھی اس بات پر اکسا تاکہ معاشرے میں جو غریب و محتاج لوگ بھوکے مر رہے ہیں ان کے حقوق پہچانیں اور انکی بھوک مٹانے کے لیے کچھ کریں۔\nیہ اللہ تعالیٰ نے صرف دو نمایاں ترین مثالیں دے کر دراصل یہ بتایا ہے کہ انکار آخرت لوگوں میں کسی قسم کی اخلاقی برائیاں پیدا کرتا ہے۔ اصل مقصود ان دو ہی باتوں پر گرفت کرنا نہیں ہے کہ آخرت کو نہ ماننے سے بس یہ دو خرابیاں پیدا ہوتی ہیں کہ لوگ یتیموں کو دھتکارتے ہیں اور مسکینوں کا کھانا دینے پر نہیں اکساتے۔ بلکہ جو بیشمار خرابیاں اس گمراہی کے نتیجے میں رونما ہوتی ہیں ان میں سے دو ایسی چیزیں بطور نمونہ پیش کی گئی ہیں جن کو ہر شریف الطبع اور سلیم الفطرت انسان مانے گا کہ وہ نہایت قبیح اخلاقی رذائل ہیں۔ اس کے ساتھ یہ بات بھی ذہن نشین کرنی مقصود ہے کہ اگر یہی شخص خدا کے حضور اپنی حاضری اور جواب دہی کا قائل ہوتا تو اس سے ایسی کمینہ حرکتیں سرزد نہ ہوتیں کہ یتیم کا حق مارے، اس پر ظلم ڈھائے، اس کو دھتکارے، اور مسکین کو نہ خود کھلائے نہ کسی سے یہ کہے کہ اس کا کھانا اس کو دو ۔ آخرت کا یقین رکھنے والوں کے اوصاف تو وہ ہیں جو سورة عصر اور سورة بلد میں بیان کیے گئے ہیں کہ وَتَوَاصَوْا بالْمَرْحَمَةِ (وہ ایک دوسرے کو خلق خدا پر رحم کھانے کی نصیحت کرتے ہیں) اور وَتَوَاصَوْا بالْحَقِّ (وہ ایک دوسرے کو حق پرستی اور ادائے حقوق کی نصیحت کرتے ہیں) ۔",
    "Translation": "اور مسکین کا کھانا 6 دینے پر نہیں اُکساتا۔ 7",
    "Words": " وَلَا : اور نہیں   |   يَحُضُّ : رغبت دلاتا   |   عَلٰي طَعَامِ : کھانے پر   |   الْمِسْكِيْنِ : مسکین "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "فَوَيْلٌ لِّلْمُصَلِّيْنَ",
    "AyahTextPdms": "فَوَيْلٌ لِّلْمُصَلِّيْنَ",
    "AyahTextQalam": "فَوَیْلٌ لِّلْمُصَلِّیْنَۙ",
    "Id": 6306,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   8\nفَوَيْلٌ لِّلْمُصَلِّيْنَ کے الفاظ استعمال کیے گئے ہیں۔ یہاں ف اس معنی میں ہے کہ کھلے کھلے منکرین آخرت کا حال تو یہ تھا جو ابھی تم نے سنا، اب ذرا ان منافقوں کا حال بھی دیکھو جو نماز پڑھنے والے گروہ، یعنی مسلمانوں میں شامل ہیں۔ وہ چونکہ بظاہر مسلمان ہونے کے باوجود آخرت کو جھوٹ سمجھتے ہیں، اس لیے ذرا دیکھو کہ وہ اپنے لیے کس تباہی کا سامان کر رہے ہیں۔\nمُصَلِّيْنَ کے معنی تو \" نماز پڑھنے والوں \" کے ہیں، لیکن جس سلسلہ کلام میں یہ لفظ استعمال ہوا ہے اور آگے ان لوگوں کی جو صفات بیان کی گئی ہیں ان کے لحاظ سے اس لفظ کے معنی درحقیقت نمازی ہونے کے نہیں بلکہ اہل صلوۃ، یعنی مسلمانوں کے گروہ میں شامل ہونے کے ہیں۔",
    "Translation": "پھر تباہی ہے اُن نماز پڑھنے والوں کے لیے 8",
    "Words": " فَوَيْلٌ: پس خرابی   |   لِّلْمُصَلِّيْنَ : نمازیوں کیلئے "
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "الَّذِيْنَ هُمْ عَنْ صَلَاتِهِمْ سَاهُوْنَ",
    "AyahTextPdms": "الَّذِيْنَ هُمْ عَنْ صَلَاتِهِمْ سَاهُوْنَ",
    "AyahTextQalam": "الَّذِیْنَ هُمْ عَنْ صَلَاتِهِمْ سَاهُوْنَۙ",
    "Id": 6307,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   9\nفِیْ صَلَاتِهِمْ سَاهُوْنَ نہیں کہا گیا بلکہ عَنْ صَلَاتِهِمْ سَاهُوْنَ کہا گیا ہے۔ اگر فی سلوتہم کے الفاظ استعمال ہوتے تو مطلب یہ ہوتا کہ وہ اپنی نماز میں بھولتے نہیں۔ لیکن نماز پڑھتے پڑھتے کچھ بھول جانا شریعت میں نفاق تو درکنار گناہ بھی نہیں ہے، بلکہ سرے سے کوئی عیب یا قابل گرفت بات تک نہیں ہے۔ خود نبی (صلی اللہ علیہ وآلہ وسلم) کو بھی کسی وقت نماز میں بھول لاحق ہوئی ہے۔ اور حضور نے اس کی تلافی کے لیے سجدہ سہو کا طریقہ مقرر فرمایا ہے۔ اس کے برعکس عَنْ صَلَاتِهِمْ سَاهُوْنَ کے معنی یہ ہیں کہ وہ اپنی نماز سے غافل ہیں۔ نماز پڑھی تو اور نہ پڑھہ تو، دونوں کی ان کی نگاہ میں کوئی اہمیت نہیں ہے۔ کبھی پڑھتے ہیں اور کبھی نہیں پڑھتے۔ پڑھتے ہیں تو اس طرح کہ نماز کے وقت کو ٹالتے رہتے ہیں اور جب وہ بالکل ختم ہونے کے قریب ہوتا ہے تو اٹھ کر چار ٹھونگیں مار لیتے ہیں۔ یا نماز کے لیے اٹھتے ہیں تو بےدلی کے ساتھ اٹھتے ہیں اور بادل ناخواستہ پڑھ لیتے ہیں جیسے کوئی مصیبت ہے جو ان پر نازل ہوگئی ہے۔ کپڑوں سے کھیلتے ہیں، جمائیاں لیتے ہیں، خدا کی یاد کا کوئی شائبہ تک ان کے اندر نہیں ہوتا۔ پوری نماز میں نہ ان کہ یہ احساس ہوتا ہے کہ وہ نماز پڑھ رہے ہیں اور نہ یہ خیال رہتا ہے کہ انہوں نے کیا پڑھا ہے۔ پڑھ رہے ہوتے ہیں نماز اور دل کہیں اور پڑا رہتا ہے۔ مارا مار اس طرح پڑھتے ہیں کہ نہ قیام ٹھیک ہوتا ہے نہ رکوع نہ سجود۔ بس کسی نہ کسی طرح نماز کی سی شکل بنا کر جلدی سے جلدی فارغ ہوجانے کی کوشش کرتے ہیں۔ اور بہت سے لوگ تو ایسے ہیں کہ کسی جگہ پھنس گئے تو نماز پڑھ لی، ورنہ اس عابدت کا کوئی مقام ان کی زندگی میں نہیں ہوتا، نماز کا وقت آتا ہے تو انہیں محسوس تک نہیں ہوتا کہ یہ نماز کا وقت ہے۔ موذن کی آواز کان میں آتی ہے تو انہیں یہ خیال تک نہیں آتا کہ یہ کیا پکار رہا ہے، کس کو پکار رہا ہے اور کس لیے پکار رہا ہے۔ یہی آخرت پر ایمان نہ ہونے کی علامات ہیں۔ کیونکہ دراصل اسلام کے مدعیوں کا یہ طرز عمل اس وجہ سے ہوتا ہے کہ وہ نہ نماز پڑھنے پر کسی جزا کے قائل ہیں اور نہ انہیں اس بات کا یقین ہے کہ کے نہ پڑھنے پر کوئٰ سزا ملے گی۔ اسی بنا پر حضرت انس بن مالک اور عطا بن دینار کہتے ہیں کہ خدا کا شکر ہے اس نے فِیْ صَلَاتِهِمْ سَاهُوْنَ نہیں بلکہ عَنْ صَلَاتِهِمْ سَاهُوْنَ فرمایا۔ یعنی ہم نماز میں بھولتے تو ضرور ہیں مگر نماز سے غافل نہیں ہیں اس لیے ہمارا شمار منافقوں میں نہیں ہوگا۔\nقرآن مجید میں منافقین کی اس کیفیت کو دوسری جگہ یوں بیان کیا گیا ہے کہ وَلَا يَاْتُوْنَ الصَّلٰوةَ اِلَّا وَهُمْ كُسَالٰى وَلَا يُنْفِقُوْنَ اِلَّا وَهُمْ كٰرِهُوْنَ ۔ \" وہ نماز کے لیے نہیں آتے مگر کسمساتے ہوئے اور (اللہ کی راہ میں) خرچ نہیں کرتے مگر بادل ناخواستہ \" (التوبہ 54) رسول اللہ (صلی اللہ علیہ وآلہ وسلم) فرماتے ہیں تلک صلوۃ المنافق، تلک صلوۃ المنافق، تلک صلوۃ المنافق یجلس یرقب الشمس حتی اذا کانت بین قرنی الشیطان قام فقر اربعا لا یذکر اللہ فیھا الا قلیلا \" یہ منافق کی نماز ہے یہ منافق کی نماز ہے، یہ منافق کی نماز ہے، عصر کے وقتبیٹحا سورج کو دیکھتا رہتا ہے، یہاں تک کہ جب وہ شیطان کے دونوں سینگوں کے درمیان پہنچ جاتا (یعنی غروب کا وقت آجاتا ہے) تو اٹھ کر چار ٹھونگیں مار لیتا ہے جن میں اللہ کو کم ہی یاد کرتا ہے \"۔ (بخاری، مسلم، مسند احمد) حضرت سعد بن ابی وقاص سے ان کے صاحبزادے مصعب بن سعد روایت کرتے ہیں کہ میں نے رسول اللہ (صلی اللہ علیہ وآلہ وسلم) سے ان لوگوں کے بارے میں پوچھا تھا جو نماز سے غفلت برتتے ہیں۔ آپ نے فرمایا کہ یہ وہ لوگ ہیں جو نماز کو اس کا وقت ٹال کر پڑھتے ہیں۔ (ابن جریر، ابو یعلی، ابن المنذر، ابن ابی حاتم، طبرانی فی الاوسط، ابن مردویہ، بیہقی فی السنن۔ ) یہ روایت حضرت سعد کے اپنے قول کی حیثیت سے بھی موقوفا نقل ہوئی ہے اور اس کی سند زیادہ قوی ہے۔ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے ارشاد کی حیثیت سے اس کی مرفوعا روایت کو بیہقی اور حاکم نے ضعیف قرار دیا ہے) حضرت مصعب کی دوسری روایت یہ ہے کہ انہوں نے اپنے والد ماجد سے پوچھا کہ اس آیت پر آپ نے غور فرمایا ؟ کیا اس کا مطلب نماز کو چھوڑ دینا ہے ؟ یا اس سے مراد نماز پڑھتے پڑھتے آدمی کا خیال کہیں اور چلا جانا ہے ؟ خیال بٹ جانے کی حالت ہم میں سے کسی پر نہیں گزرتی ؟ انہوں نے جواب دیا نہیں، اس سے مراد نماز کے وقت کو ضائع کرنا اور اسے وقت ٹال کر پڑھنا ہے (ابن جریر، ابن ابی شیبہ، ابو یعلی، ابن المنذر، ابن مردویہ، بیہقی فی السنن)\nاس مقام پر یہ بات سمجھ لینی چاہیے کہ نماز میں دوسرے خیالات کا آجانا اور چیز ہے اور نماز کی طرف کبھی متوجہ ہی نہ ہونا اور اس میں ہمیشہ دوسری باتیں ہی سوچتے رہنا بالکل دوسری چیز۔ پہلی حالت تو بشریت کا تقاضا ہے، بلا ارادہ دوسرے خیالات آ ہی جاتے ہیں، اور مومن کو جب بھی یہ احساس ہوتا ہے کہ نماز سے اس کی توجہ ہٹ گئی ہے تو وہ پھر کوشش کر کے اس کی طرف متوجہ ہوجاتا ہے۔ دوسری حالت نماز سے غفلت برتنے کی تعریف میں آتی ہے، کیونکہ اس میں آدمی صرف نماز کی ورزش کرلیتا ہے، خدا کی یاد کوئی ارادہ اس کے دل میں نہیں ہوتا، نماز شروع کرنے سے سلام پھیرنے تک ایک لمحہ کے لیے بھی اس کا دل خدا کی طرف متوجہ نہیں ہوتا، اور جن خیالات کو لیے ہوئے وہ نماز میں داخل ہوتا ہے انہی میں مستغرق رہتا ہے۔",
    "Translation": "جو اپنی نماز سے غفلت برتتے ہیں، 9",
    "Words": " الَّذِيْنَ : جو کہ   |   هُمْ : وہ   |   عَنْ صَلَاتِهِمْ : اپنی نمازوں سے   |   سَاهُوْنَ : غافل (جمع)"
},
{
    "AyahNumber": 6,
    "AyahTextMuhammadi": "الَّذِيْنَ هُمْ يُرَاۗءُوْنَ",
    "AyahTextPdms": "الَّذِيْنَ هُمْ يُرَاۤءُوْنَ",
    "AyahTextQalam": "الَّذِیْنَ هُمْ یُرَآءُوْنَۙ",
    "Id": 6308,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   10\nیہ فقرہ ایک مستقل فقرہ بھی ہوسکتا ہے اور پہلے فقرے سے متعلق بھی۔ اگر اسے ایک مستقل فقرہ قرار دیا جائے تو اس کا مطلب یہ ہوگا کہ کوئی نیک کام بھی وہ خالص نیت کے ساتھ خدا کے لیے نہیں کرتے بلکہ جو کچھ کرتے ہیں دوسروں کو دکھانے کے لیے کرتے ہیں تاکہ ان کی تعریف ہو، لوگ ان کو نیکو کار سمجھیں، ان کے کار خیر کا ڈھنڈورا دنیا میں پٹے، اور اس کا فائدہ کسی نہ کسی صورت میں انہیں دنیا ہی میں حاصل ہوجائے۔ اور اگر اس کا تعلق پہلے فقرے کے ساتھ مانا جائے تو مطلب یہ ہوگا کہ وہ دکھاوے کی نمازیں پڑھتے ہیں۔ مفسرین نے بالعموم دوسرے ہی معنی کو ترجیح دی ہے کیونکہ پہلی نظر میں یہی محسوس ہوتا ہے کہ اس کا تعلق پہلے فقرے سے ہے۔ ابن عباس فرماتے ہیں \" اس سے مراد منافقین ہیں جو دکھاوے کی نماز پڑھتے تھے، اگر دوسرے لوگ موجود ہوتے تو پڑھ لیتے اور کوئی دیکھنے والا نہ ہوتا تو نہیں پڑھتے تھے \"۔ دوسری روایت میں ان کے الفاظ یہ ہیں \" تنہا ہوتے تو نہ پڑھتے اور علانیہ پڑھ لیتے تھے \" (ابن جریر، ابن المنذر، ابن ابی حاتم، ابن مردویہ، بیہقی فی الشعب) قرآن مجید میں بھی منافقین کی یہ حالت بیان کی گئی ہے کہ وَاِذَا قَامُوْٓا اِلَى الصَّلٰوةِ قَامُوْا كُسَالٰى ۙ يُرَاۗءُوْنَ النَّاسَ وَلَا يَذْكُرُوْنَ اللّٰهَ اِلَّا قَلِيْلًا \" اور جب وہ نماز کے لیے اٹھتے ہیں تو کسمساتے ہوئے اٹھتے ہیں، لوگوں کو دکھاتے ہیں اور اللہ کو کم ہی یاد کرتے ہیں \"۔ (النساء۔ 142)",
    "Translation": "جو ریا کاری کرتے ہیں 10",
    "Words": " الَّذِيْنَ : جو کہ   |   هُمْ : وہ   |   يُرَآءُوْنَ : دکھاوا کرتے ہیں "
},
{
    "AyahNumber": 7,
    "AyahTextMuhammadi": "وَيَمْنَعُوْنَ الْمَاعُوْنَ",
    "AyahTextPdms": "وَيَمْنَعُوْنَ الْمَاعُوْنَ",
    "AyahTextQalam": "وَ یَمْنَعُوْنَ الْمَاعُوْنَ۠",
    "Id": 6309,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 32,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الماعون",
    "SurahNameEnglish": "Al-Maa\"un",
    "SurahNumber": 107,
    "Tafseer": "سورة الماعون   11\nاصل میں لفظ ماعون استعمال ہوا ہے۔ حضرت علی، ابن عمر، سعید بن جبیر، قتادہ، حسن بصری، محمد بن حنفیہ، ضحاک، ابن زید، عکرمہ، مجاہد، عطاء اور زہری رحمہم اللہ کا قول یہ ہے کہ اس سے مراد زکوٰۃ ہے۔ ابن عباس، ابن مسعود، ابراہیم نخعی، ابو مالک، (رض) ، اور بہت سے دوسرے حضرات کا قول ہے کہ اس سے مراد عام ضرورت کی اشیاء مثلا ہنڈیا، ڈول، کلہاڑی، ترازو، نمک، پانی، آگ، چقماق (جن کی جانشین اب دیا سلائی ہے) وغیرہ ہیں جو عموما لوگ ایک دوسرے سے عاریۃ مانگتے رہتے ہیں۔ سعید بن جبیر اور مجاہد کا بھی ایک قول اسی کی تائید میں ہے۔ حضرت علی کا بھی ایک قول یہ ہے کہ اس سے مراد زکوٰۃ بھی ہے اور یہ چھوٹی چھوٹی عام ضروریات کی چیزیں بھی۔ عکرمہ سے ابن ابی حاتم نے نقل کیا ہے کہ ماعون کا اعلی مرتبہ زکوٰۃ ہے اور ادنی ترین مرتبہ یہ ہے کہ کسی کو چھلنی، ڈول یا سوئی عاریۃ دی جائے۔ حضرت عبداللہ بن مسعود (رض) فرماتے ہیں کہ ہم اصحاب محمد (صلی اللہ علیہ وآلہ وسلم) یہ کہا کرتے تھے (اور بعض روایات میں ہے کہ حضور کے عہد مبارک میں یہ کہا کرتے تھے) کہ ماعون سے مراد ہنڈیا، کلہاڑی، ڈول، ترازو، اور ایسی ہی دوسری چیزیں مستعار دینا ہے (ابن جریر، ابن ابی شیبہ، ابو داؤد، نسائی، بزار، ابن المنذر، ابن ابی حاتم، طبرانی فی الاوسط، ابن مردویہ، بیہقی فی السنن، سعد بن عیاض ناموں کے تصریح کے بغیر قریرب قریب یہی قول رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے صحابہ سے نقل کرتے ہیں جس کے معنی یہ ہیں کہ انہوں نے متعدد صحابہ سے یہ بات سنی تھی (ابن جریر، ابن ابی شیبہ) دیلمی، ابن عساکر اور ابو نعیم نے حضرت ابوہریرہ کی ایک روایت نقل کی ہے جس میں وہ کہتے ہیں کہ خود رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے اس آیت کی یہ تفسیر بیان فرمائی کہ اس سے مراد کلہاڑی اور ڈول اور ایسی ہی دوسری چیزیں ہیں۔ اگر یہ روایت صحیح ہے تو غالبا یہ دوسرے لوگوں کے علم میں نہ آئی ہوگی، ورنہ ممکن نہ تھا کہ پھر کوئی شخص اس آیت کی کوئی اور تفسیر کرتا۔\nاصل بات یہ ہے کہ ماعون چھوٹی اور قلیل چیز کو کہتے ہیں جس میں لوگوں کے لیے کوئی منفعت یا فائدہ ہو۔ اس معنی کے لحاظ سے زکوٰۃ بھی ماعون ہے، کیونکہ وہ بہت سے مال میں سے تھوڑا سا مال ہے جو غریبوں کی مدد کے لیے دنیا ہوتا ہے، اور وہ دوسری عام ضرورت کی اشیاء کی بھی ماعون ہیں جن کا ذکر حضرت عبداللہ بن مسعود اور ان کے ہم خیال حضرات نے کیا ہے۔ اکثر مفسرین کا خیال یہ ہے کہ ماعون کا اطلاق ان تمام چھوٹی چھوٹی چیزوں پر ہوتا ہے جو عادۃ ہمسایے ایک دوسرے سے مانگتے رہتے ہیں۔ ان کا مانگنا کوئی ذلت کی بات نہیں ہوتا، کیونکہ غریب اور امیر سب ہی کو کسی نہ کسی وقت ان کی ضرورت پیش آتی رہتی ہے۔ البتہ ایسی چیزوں کو دینے سے بخل برتنا اخلاقا ایک ذلیل حرکت سمجھا جاتا ہے، عموما ایسی چیزیں بجائے خود باقی رہتی ہیں اور ہمسایہ ان سے کام لے کر انہیں جوں کا توں واپس دے دیتا ہے۔ اسی ماعون کی تعریف میں یہ بھی آتا ہے کہ کسی کے ہاں مہمان آجائیں اور وہ ہمسائے سے چارپائی یا بستر مانگ لے، یا کوئی اپنے ہمسائے کے تنور میں اپنی روٹی پکا لینے کی اجازت مانگے۔ یا کوئی کچھ دنوں کے لیے باہر جارہا ہو اور حفاظت کے لیے اپنا کوئی قیمتی سامان دوسرے کے ہاں رکھوانا چاہے۔ پس آیت کا مقصود یہ بتانا ہے کہ آخرت کا انکار آدمی کو اتنا تنگ دل بنا دیتا ہے کہ وہ دوسروں کے لیے کوئی معمولی ایثار کرنے کے لیے بھی تیار نہیں ہوتا۔",
    "Translation": "اور معمولی ضرورت کی چیزیں 11 (لوگوں کو)دینے سے گریز کرتے ہیں",
    "Words": " وَيَمْنَعُوْنَ : روکتے ہیں (نہیں دیتے)  |   الْمَاعُوْنَ : عام ضرورت کی چیز "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6310,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكوثر",
    "SurahNameEnglish": "Al-Kawthar",
    "SurahNumber": 108,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "اِنَّآ اَعْطَيْنٰكَ الْكَوْثَرَ",
    "AyahTextPdms": "اِنَّآ اَعْطَيْنٰكَ الْكَوْثَرَ",
    "AyahTextQalam": "اِنَّاۤ اَعْطَیْنٰكَ الْكَوْثَرَؕ",
    "Id": 6311,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 33,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكوثر",
    "SurahNameEnglish": "Al-Kawthar",
    "SurahNumber": 108,
    "Tafseer": "سورة الکوثر   1\nکوثر کا لفظ یہاں جس طرح استعمال کیا گیا ہے اس کا پورا مفہوم ہماری زبان تو درکنار شاید دنیا کی کسی زبان میں بھی ایک لفظ سے ادا نہیں کیا جاسکتا۔ یہ کثرت سے مبالغہ کا صیغہ ہے جس کے لغوی معنی تو بےانتہا کثرت کے ہیں، مگر جس موقع پر اس لفظ کو استعمال کیا گیا ہے اس میں محض کثرت کا نہیں بلکہ خیر اور بھلائی اور نعمتوں کی کثرت، اور ایسی کثرت کا مفہوم نکلتا ہے جو افراط اور فراوانی کی حد کو پہنچی ہوئی ہو، اور اس سے مراد کسی ایک خیر یا بھلائی یا نعمت کی نہیں بلکہ بیشمار بھلائیوں اور نعمتوں کی کثرت ہے۔ دیباچے میں اس سورة کا جو پس منظر ہم نے بیان کیا ہے اس پر ایک مرتبہ پھر نگاہ ڈال کر دیکھیے۔ حالات وہ تھے جب دشمن یہ سمجھ رہے تھے کہ محمد (صلی اللہ علیہ وآلہ وسلم) ہر حیثیت سے تباہ ہوچکے ہیں، قوم سے کٹ کر بےیارو مددگار رہ گئے۔ تجارت برباد ہوگئی، اولاد نرینہ تھی جس سے آگے ان کا نام چل سکتا تھا۔ وہ بھی وفات پاگئی، بات ایسی لے کر اٹھے ہیں کہ چند گنے چنے آدمی چھوڑ کر مکہ تو درکنار پورے عرب میں کوئی اس کو سننا تک گوارا نہیں کرتا۔ اس لیے ان کے مقدر میں اس کے سوا کچھ نہیں کہ جیتے جی ناکامی و نامرادی سے دو چار ہیں اور جب وفات پاجائیں تو دنیا میں کوئی ان کا نام لیوا بھی نہ ہو، اس حالت میں جب اللہ تعالیٰ کی طرف سے یہ فرمایا گیا کہ ہم نے تمہیں کوثر عطا کردیا تو اس سے خودبخود یہ مطلب نکلتا ہے کہ تمہارے مخالف بیوقوف تو یہ سمجھ رہے ہیں کہ تم برباد ہوگئے اور نبوت سے پہلے جو نعمتیں تمہیں حاصل تھیں وہ ھی تم سے چھن گئیں، لیکن حقیقت یہ ہے کہ ہم نے تمہیں بےانتہا خیر اور بیشمار نعمتوں سے نواز دیا ہے۔ اس میں اخلاق کی وہ بےنظیر خوبیاں بھی شامل ہیں جو حضور کو بخشی گئیں۔ اس میں نبوت اور قرآن اور علم اور حکمت کی وہ عظیم نعمتیں بھی شامل ہیں جو آپ کو عطا کی گئیں۔ اس میں توحید اور ایک ایسے نظام زندگی کی نعمت بھی شامل ہے جس کے سیدھے سادھے، عام فہم، عقل و فطرت کے مطابق اور جامع و ہمہ گیر اصول تمام عالم میں پھیل جانے اور ہمیشہ پھیلتے ہی چلے جانے کی طاقت رکھتے ہیں۔ اس میں رفع ذکر کی نعمت بھی شامل ہے جس کی بدولت حضور کا نام نامی چودہ سو برس سے دنیا کے گوشے گوشے میں بلند ہورہا ہے اور قیامت تک بلند ہوتا رہے گا۔ اس میں یہ نعمت بھی شامل ہے کہ آپ کی دعوت سے بالآخر ایک ایسی عالمگیر امت وجود میں آئی جو دنیا میں ہمیشہ کے لیے دین حق کی علمبردار بن گئی، جس سے زیادہ نیک اور پاکیزہ اور بلند پایہ انسان دنیا کی کسی امت میں کبھی پیدا نہیں ہوئے، اور جو بگاڑ کی حالت کو پہنچ کر بھی دنیا کی سب قوموں سے بڑھ کر خیر اپنے اندر رکھتی ہے۔ اس میں یہ نعمت بھی شامل ہے کہ حضور نے اپنی آنکھوں سے اپنی حیات مبارکہ ہی میں اپنی دعوت کو انتہائی کامیاب دیکھ لیا اور آپ کے ہاتھوں سے وہ جماعت تیار ہوگئی جو دنیا پر چھا جانے کی طاقت رکھتی تھی۔ اس میں یہ نعمت بھی شامل ہے کہ اولاد نرینہ سے محروم ہوجانے کی بنا پر دشمن تو یہ سمجھتے تھے کہ آپ کا نام و نشان دنیا سے مٹ جائے گا، لیکن اللہ نے صرف یہی نہیں کہ مسلمانوں کی صورت میں آپ کو وہ روحانی اولاد عطا فرمائی جو قیامت تک تمام روئے زمین پر آپ کا نام روشن کرنے والی ہے، بلکہ آپ کی صرف ایک ہی صاحبزادی حضرت فاطمہ سے آپ کو جو جسمانی اولاد بھی عطا کی جو دنیا بھر میں پھیلی ہوئی ہے اور جس کا سارا سرمایہ افتخار ہی حضور سے اس کا انتساب ہے۔\nیہ تو وہ نعمتیں ہیں جو اس دنیا میں لوگوں نے دیکھ لیں کہ وہ کسی فراوانی کے ساتھ اللہ نے اپنے حبیب (صلی اللہ علیہ وآلہ وسلم) کو عطا فرمائیں ان کے علاوہ کوثر سے مراد وہ دو مزید ایسی عظیم نعمتیں بھی ہیں جو آخرت میں اللہ تعالیٰ آپ کو دینے والا ہے۔ ان کو جاننے کا کوئی ذریعہ ہمارے پاس نہ تھا اس لیے رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے ہمیں ان کی خبر دی اور بتایا کہ کوثر سے مراد وہ بھی ہیں۔ ایک حوض کوثر جو قیامت کے روز میدان حشر میں آپ کو ملے گا، دوسرے نہر کوثر جو جنت میں آپ کو عطا فرمائی جائے گی، ان دونوں کے متعلق اس کثرت سے احادیث حضور سے منقول ہوئی ہیں اور اتنے کثیر راویوں نے ان کو روایت کیا ہے کہ ان کی صحت میں کسی شبہ کی گنجائش نہیں۔\nحوض کوثر کے متعلق حضور نے جو کچھ فرمایا ہے وہ یہ ہیں \n(١) یہ حوض قیامت کے روز آپ کو عطا ہوگا اور اس سخت وقت میں جبکہ ہر ایک العطش العطش کر رہا ہوگا، آپ کی امت آپ کے پاس اس پر حاضر ہوگی، اور اس سے سیراب ہوگی۔ آپ اس پر سب سے پہلے پہنچے ہوئے ہوں گے اور اس کے وسط میں تشریف فرما ہوں گے۔ آپ کا ارشاد ہے ھو حوض ترد علیہ امتی یوم القیمۃ۔ \" وہ ایک حوض ہے جس پر میری امت قیامت کے روز وارد ہوگی \"۔ (مسلم، کتاب الصلوۃ، ابو داؤد، کتاب السنہ) انا فرطکم علی الحوض۔ \" میں تم سب سے پہلے اس پر پہنچا ہوا ہوں گا \" ( بخاری، کتاب الرقاق اور کتاب الفتن، مسلم، کتاب الفضائل اور کتاب الطہارۃ۔ ابن ماجہ، کتاب المناسک اور کتاب الزہد، مسند احمد، مرویات عبداللہ بن مسعود، عبداللہ بن عباس، و ابوہریرہ) انی فط لکم وانا شھید علیکم وانی واللہ لانظر الی حوضی الانہ۔ \" میں تم سے آگے پہنچنے والا ہوں، اور تم پر گواہی دوں گا اور خدا کی قسم میں اپنے حوض کو اس وقت دیکھ رہا ہوں \"۔ (بخاری، کتاب الجنائز، کتاب المغازی، کتاب الرقاق) انصار کو مخاطب کرتے ہوئے ایک موقع پر آپ نے فرمایا انکم ستلقون بعدی اثرۃ فاصبروا حتی تلقونی علی الحوض۔ \" میرے بعد تم کو خود غرضیوں اور اقربا نوازیوں سے پالا پڑے گا، اس پر صبر کرنا یہاں تک کہ مجھ سے آکر حوض پر ملو \"۔ (بخاری، کتاب مناقب الانصار و کتاب المغازی، مسلم کتاب الامارہ، ترمذی، کتاب الفتن) انا یوم القیامۃ عند عقر الحوض۔ \" میں قیامت کے روز حوض کے وسط کے پاس ہوں گا \" (مسلم، کتاب الفضائل) حضرت ابو برزہ اسلمی سے پوچھا گیا کہ کیا آپ نے حوض کے متعلق رسول اللہ (صلی اللہ علیہ وآلہ وسلم) سے کچھ سنا ہے ؟ انہوں نے کہا، ایک نہیں دو نہیں تین نہیں چار نہیں پانچ نہیں بار بار سنا ہے، جو اس کو جھٹلائے اللہ اسے اس کا پانی نصیب نہ کرے (ابو داؤد، کتاب السنہ) عبید اللہ بن زیاد حوض کے بارے میں روایات کو جھوٹ سمجھتا تھا، حتی کہ اس نے حضرت برزہ اسلمی، براء بن عازب اور عائذ بن عمرو کی سب روایات کو جھٹلا دیا۔ آخر کار ابو سبرہ ایک تحریر نکال کر لائے جو انہوں نے حضرت عبداللہ بن عمرو بن عاص سے سن کر نقل کی تھی اور اس میں حضور کا یہ ارشاد درج تھا کہ الا ان موعدکم حوضی \" خبردار رہو، میری اور تمہاری ملاقات کی جگہ میرا حوض ہے \" (مسند احمد، مرویات عبداللہ بن عمرو بن عاص)\n(٢) اس حوض کی وسعت مختلف روایات میں مختلف بیان کی گئی ہے۔ مگر کثیر روایات میں یہ ہے کہ وہ ایلہ (اسرائیل کے موجودہ بندرگاہ ایلات) سے یمن کے صنعا تک، یا ایلہ سے عدن تک، یا عمان سے عدن تک طویل ہوگا اور اس کی چوڑائی اتنی ہوگی جتنا ایلہ سے جحفہ (جدہ اور رابغ کے درمیان ایک مقام) تک کا فاصلہ ہے۔ (بخاری، کتاب الرقاق، ابوداؤد الطیالسی، حدیث نمبر 995 ۔ مسند احمد، مرویات ابوبکر صدیق و عبداللہ بن عمر۔ مسلم، کتاب الطہارۃ و کتاب الفضائل۔ ترمذی، ابواب صفۃ القیامہ۔ ابن ماجہ، کتاب الزہد۔ اس سے گمان ہوتا ہے کہ قیامت کے روز موجودہ بحر احمر ہی کو حوض کوثر میں تبدیل کردیا جائے گا، واللہ اعلم بالصواب۔\n(٣) اس حوض کے متعلق حضور نے بتایا ہے کہ اس میں جنت کی نہر کوثر (جس کا ذکر آگے آرہا ہے) سے پانی لاکر ڈالا جائے گا۔ یشخب فیہ میزابان من الجنۃ، اور دوسری روایت میں ہے یغت فیہ میزابان یمدانہ من الجنۃ، یعنی اس میں جنت سے دو نالیاں لاکر ڈالی جائیں گی جو اسے پانی بہم پہنچائیں گی۔ (مسلم، کتاب الفضائل) ایک اور روایت میں ہے یفتح نھر من الکوثر الی الحوض، جنت کی نہر کوثر سے ایک نہر اس حوض کی طرف کھول دی جائے گی (مسند احمد، مرویات عبداللہ بن مسعود)\n(٤) اس کی کیفیت حضور نے یہ بیان فرمائی ہے کہ اس کا پانی دودھ سے ( اور بعض روایات میں ہے چاندی سے اور بعض میں برف سے) زیادہ سفید، برف سے زیادہ ٹھنڈا، شہد سے زیادہ میٹھا ہوگا، اس کی تہہ کی مٹی مشک سے زیادہ خوشبودار ہوگی، اس پر اتنے کوزے رکھے ہوں گے جتنے آسمان میں تارے ہیں، جو اس کا پانی پی لے گا اسے پھر کبھی پیاس نہ لگے گی۔ اور جو اس سے محروم رہ گیا وہ پھر کبھی سیراب نہ ہوگا۔ یہ باتیں تھوڑے تھوڑے لفظی اختلافات کے ساتھ بکثرت احادیث میں منقول ہوئی ہیں (بخاری، کتاب الرقاق۔ مسلم، کتاب الطہارت و کتاب الفضائل۔ مسند احمد، مرویات ابن مسعود، ابن عمر، وعبداللہ بن عمرو بن العاص۔ ترمذی، ابواب صفۃ القیامۃ۔ ابن ماجہ، کتاب الزھد، ابو داؤد طیالسی، حدیث 995 ۔ 2135)\n(٥) اس کے بارے میں حضور نے بار بار اپنے زمانے کے لوگوں کو خبردار کیا کہ میرے بعد تم میں سے جو لوگ بھی میرے طریقے کو بدلیں گے ان کو اس حوض سے ہٹا دیا جائے گا اور اس پر انہیں نہ آنے دیا جائے گا، میں کہوں گا کہ یہ میرے اصحاب میں تو مجھ سے کہا جائے گا کہ آپ کو نہیں معلوم کہ آپ کے بعد انہوں نے کیا کیا ہے۔ پھر میں بھی ان کو دفع کروں گا اور کہوں گا کہ دور ہو۔ یہ مضمون بھی بکثرت روایات میں بیان ہوا ہے (بخاری، کتاب الرقاق، کتاب الفتن۔ مسلم، کتاب الطہارۃ، کتاب الفضائل۔ مسند احمد، مرویات ابن مسعود و ابوہریرہ۔ ابن ماجہ، کتاب المناسک۔ ابن ماجہ نے اس سلسلے میں جو حدیث نقل کی ہے وہ بڑے ہی دردناک الفاظ میں ہے۔ اس میں حضور فرماتے ہیں الا وانی فرطکم علی الحوض واکاثر بکم الامم فلا تسودوا وجھی، الا وانی مستنقذ اناسا و مستنقذ اناس منی فاقول یا رب اصیحابی، فیقول انک لا تدری ما احدثوا بعدک۔ \" خبردار رہو، میں تم سے آگے حوض پر پہنچا ہوا ہوں گا اور تمہارے ذریعہ سے دوسری امتوں کے مقابلے میں اپنی امت کی کثرت پر فخر کروں گا۔ اس وقت میرا منہ کالا نہ کروانا، خبردار رہو کچھ لوگوں کو میں چھڑاؤں گا اور کچھ لوگ مجھ سے چھڑائے جائیں گے، میں کہوں گا کہ اے پروردگار یہ تو میرے صحابی ہیں، وہ فرمائے گا تم نہیں جانتے انہوں نے تمہارے بعد کیا نرالے کام کیے ہیں \"۔ ابن ماجہ کی روایت ہے کہ یہ الفاظ حضور نے عرفات کے خطبے میں فرمائے تھے)\n(٦) اسی طرح حضور نے اپنے دور کے بعد قیامت تک آنے والے مسلمانوں کو بھی خبردار کیا ہے کہ ان میں سے جو بھی میرے طریقے سے ہٹ کر چلیں گے اور اس میں ردو بدل کریں گے انہیں اس حوض سے ہٹا دیا جائے گا، میں کہوں گا کہ اے رب یہ تو میرے ہیں، میری امت کے لوگ ہیں، جواب ملے گا آپ کو معلوم نہیں کہ انہوں نے آپ کے بعد کیا کیا تغیرات کیے اور الٹے ہی پھرتے چلے گئے۔ پھر میں بھی ان کو دفع کروں گا اور حوض پر نہ آنے دوں گا۔ اس مضمون کی بہت سی روایات احادیث میں ہیں (بخاری) کتاب المساقات، کتاب الرقاق، کتاب الفتن۔ مسلم، کتاب الطہارۃ، کتاب الصلوۃ، کتاب الفضائل۔ ابن ماجہ، کتاب الزہد۔ مسند احمد مرویات ابن عباس)\nاس حوض کی روایات 50 سے زیادہ صحابہ سے مروی ہیں، اور سلف نے بالعموم اس سے مراد حوض کوثر لیا ہے۔ امام بخاری نے کتاب الرقاق کے آخری باب کا عنوان ہی یہ باندھا ہے باب فی الحوض و قول اللہ اِنَّآ اَعْطَيْنٰكَ الْكَوْثَرَ ۔ اور حضرت انس کی ایک روایت میں تو تصریح ہے کہ حضور نے کوثر کے متعلق فرمایا ھو حوض ترد علیہ امتی۔ \" وہ ایک حوض ہے جس پر میری امت وارد ہوگی \"۔\nجنت میں کوثر نامی جو نہر رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کو عطا کی جائے گی اس کا ذکر بھی بکثرت روایات میں آیا ہے۔ حضرت انس سے بہت سی روایات نقل ہوئی ہیں جن میں وہ فرماتے ہیں (اور بعض روایات میں صراحت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے قول کی حیثیت سے بیان کرتے ہیں) کہ معراج کے موقع پر حضور کو جنت کی سیرا کرائی گئی اور اس موقع پر آپ نے ایک نہر دیکھی جس کے کناروں پر اندر سے ترشے ہوئے موتیوں یا ہیروں کے قبے بنے ہوئے تھے۔ اس کی تہ کی مٹی مشک اذفر کی تھی۔ حضور نے جبریل سے یا اس فرشتے سے جس نے آپ کو سیر کرائی تھی، پوچھا یہ کیا ہے ؟ اس نے جواب دیا، یہ نہر کوثر ہے جو آپ کو اللہ تعالیٰ نے عطا کی ہے (مسند احمد، بخاری، مسلم، ابو داؤد، ترمزی، ابو داؤد طیالسی، ابن جریر) حضرت انس ہی کی روایت ہے کہ حضور سے پوچھا گیا (یا ایک شخص نے پوچھا) کوثر کیا ہے ؟ آپ نے فرمایا ایک نہر ہے جو اللہ تعالیٰ نے مجھے جنت میں عطا کی ہے۔ اس کی مٹی خشک ہے۔ اس کا پانی دودھ سے زیادہ سفید اور شہد سے زیادہ میٹھا ہے۔ (مسند احمد، ترمذی، ابن جریر۔ مسند احمد کی ایک اور راویت میں ہے کہ حضور نے نہر کوثر کی یہ صفات بیان کرتے ہوئے فرمایا اس کی تہ میں کنکریوں کے بجائے موتی پڑے ہوئے ہیں) ابن عمر فرماتے ہیں کہ حضور نے ارشاد فرمایا کہ کوثر جنت میں ایک نہر ہے جس کے کنارے سونے کے ہیں، وہ موتیوں اور ہیروں پر بہ رہی ہے (یعنی کنکریوں کی جگہ اس کی تہ میں یہ جواہر پڑے ہوئے ہیں) اس کی مٹی مشک سے زیادہ خوشبودار ہے، اس کا پانی دودھ سے (یا برف سے) زیادہ سفید ہے، برف سے زیادہ ٹھنڈا اور شہد سے زیادہ میٹھا ہے (مسند احمد، ترمذی، ابن ماجہ، ابن ابی حاتم، دارمی، ابو داؤد طیالسی، ابن المنذر، ابن مردویہ، ابن ابی شیبہ) اسامہ بن زید کی روایت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) ایک مرتبہ حضرت حمزہ کے ہاں تشریف لے گئے۔ وہ گھر پر نہ تھے۔ ان کی اہلیہ نے حضور کی تواضع کی اور دوران گفتگو عرض کیا کہ میرے شوہر نے مجھے بتایا ہے کہ آپ کو جنت میں ایک نہر عطا کی گئی ہے جس کا نام کوثر ہے۔ آپ نے فرمایا ہاں، اور اس کی زمین یاقوت و مرجان اور زبرجد اور موتیوں کی ہے (ابن جریر، ابن مردویہ۔ اس کی سند اگرچہ ضعیف ہے مگر اس مضمون کی کثیر التعداد روایات کا موجود ہونا اس کو تقویت پہنچاتا ہے) ان مرفوع روایات کے علاوہ صحابہ اور تابعین کے بکثرت اقوال احادیث میں نقل ہوئے ہیں جن میں وہ کوثر سے مراد جنت کی یہ نہر لیتے ہیں اور اس کی وہی صفات بیان کرتے ہیں جو اوپر گزری ہیں۔ مثال کے طور پر حضرت عبداللہ بن عمر، حضرت عبداللہ بن عباس، حضرت انس بن مالک، حضرت عائشہ، مجاہد اور ابوالعالیہ (رضی اللہ تعالیٰ عنہم اجمعین) کے اقوال مسند احمد، بخاری، ترمذی، نسائی، ابن مردویہ، ابن جریر، اور ابن ابی شیبہ وغیرہ محدثین کی کتابوں میں موجود ہیں۔",
    "Translation": "(اے نبیؐ) ہم نے تمہیں کوثر عطا کر دیا۔ 1",
    "Words": " اِنَّآ اَعْطَيْنٰكَ الْكَوْثَرَ : بیشک ہم نے آپ کو عطا کیا۔ کوثر "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "فَصَلِّ لِرَبِّكَ وَانْحَرْ",
    "AyahTextPdms": "فَصَلِّ لِرَبِّكَ وَانْحَرْ",
    "AyahTextQalam": "فَصَلِّ لِرَبِّكَ وَ انْحَرْؕ",
    "Id": 6312,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 33,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكوثر",
    "SurahNameEnglish": "Al-Kawthar",
    "SurahNumber": 108,
    "Tafseer": "سورة الکوثر   2\nاس کی مختلف تفسیریں مختلف بزرگوں سے منقول ہیں۔ بعض حضرات نے نماز سے مراد پنج وقتہ فرض نماز لی ہے، بعض اس سے بقر عید کی نماز مراد لیتے ہیں، اور بعض کہتے ہیں کہ بجائے خود نماز مراد ہے۔ اسی طرح وانحر یعنی نحر کرو سے مراد بعض جلیل القدر بزرگوں سے یہ منقول ہے کہ نماز میں بائیں ہاتھ پر دایاں ہاتھ رکھ کر اسے سینے پر باندھنا ہے، بعض کا قول یہ ہے کہ اس سے مراد نماز شروع کرتے وقت دونوں ہاتھ اٹھا کر تکبیر کہنا ہے۔ بعض کا قول یہ ہے کہ افتتاح نماز کے وقت، اور رکوع میں جاتے ہوئے اور رکوع سے اٹھ کر رفع یدین کرنا مراد ہے۔ اور بعض کہتے ہیں کہ اس سے مراد بقر عید کی نماز پڑھنا اور اس کے بعد قربانی کرنا ہے۔ لیکن جس موقع پر یہ حکم دیا گیا ہے اس پر اگر غور کیا جائے تو اس کا مطلب صریحا یہ معلوم ہوتا ہے کہ \" اے نبی، جب تمہارے رب نے تم کو اتنی کثیر اور عظیم بھلائیاں عطا کی ہیں تو تم اسی کے لیے نماز پڑھو اور اسی کے لیے قربانی کرو \"۔ یہ حکم اس ماحول میں دیا گیا تھا جب مشرکین قریش ہی نہیں تمام عرب کے مشرکین اور دنیا بھر کے مشرکین اپنے خود ساختہ معبودوں کی عبادت کرتے تھے اور انہی کے آستانوں پر قربانیاں چڑھاتے تھے۔ پس حکم کا منشا یہ ہے کہ مشرکین کے برعکس تم اپنے اسی رویے پر مضبوطی کے ساتھ قائم رہو کہ تمہاری نماز اللہ ہی کے لیے ہو اور قربانی بھی اسی کے لیے، جیسا کہ دوسری جگہ فرمایا قُلْ اِنَّ صَلَاتِيْ وَنُسُكِيْ وَمَحْيَايَ وَمَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ ۔ لَا شَرِيْكَ لَهٗ ۚ وَبِذٰلِكَ اُمِرْتُ وَاَنَا اَوَّلُ الْمُسْلِمِيْنَ ۔ \" اے نبی کہہ دو کہ میری نماز اور میری قربانی اور میرا جینا اور میرا مرنا سب اللہ رب العالمین کے لیے ہے جس کا کوئی شریک نہیں، سی کا مجھے حکم دیا گیا ہے اور میں سب سے پہلے سر اطاعت جھکانے والا ہوں \"۔ (الانعام۔ 162 ۔ 163) یہی مطلب ابن عباس، عطا، مجاہد، عکرمہ، حسن بصری، قتادہ، محمد بن کعب قلرظی، ضحاک، ربیع بن انس، عطاء الخراسانی، اور بہت سے دوسرے اکابر مفسرین رحمہم اللہ نے بیان کیا ہے ( ابن کثیر) البتہ یہ بات اپنی جگہ بالکل صحیح ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے جب مدینہ طیبہ میں اللہ تعالیٰ کے حکم سے بقر عید کی نماز اور قربانی کا طریقہ جاری کیا تو اس بنا پر کہ آیت اِنَّ صَلَاتِيْ وَنُسُكِيْ اور آیت فَصَلِّ لِرَبِّكَ وَانْحَرْ میں نماز کو مقدم اور قربانی کو موخر رکھا گیا ہے، آپ نے خود بھی یہ عمل اختیار فرمایا اور اسی کا حکم مسلمانوں کو دیا کہ اس روز پہلے نماز پڑھیں اور پھر قربانی کریں۔ یہ اس آیت کی تفسیر نہیں ہے، نہ اس کی شان نزول ہے، بلکہ ان آیات سے حضور کا استنباط ہے، اور آپ کا استنباط بھی وحی کی ایک قسم ہے۔",
    "Translation": "پس تم اپنے ربّ ہی کے لیے نماز پڑھو اور قربانی کرو۔ 2",
    "Words": " فَصَلِّ : پس نماز پڑھو   |   لِرَبِّكَ : اپنے رب کیلئے   |   وَانْحَرْ : اور قربانی دو "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "اِنَّ شَانِئَكَ هُوَ الْاَبْتَر",
    "AyahTextPdms": "اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ",
    "AyahTextQalam": "اِنَّ شَانِئَكَ هُوَ الْاَبْتَرُ۠",
    "Id": 6313,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 33,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكوثر",
    "SurahNameEnglish": "Al-Kawthar",
    "SurahNumber": 108,
    "Tafseer": "سورة الکوثر   3\nاصل میں لفظ شانِئَكَ استعمال ہوا ہے۔ شانی شن سے ہے جس کے معنی ایسے بغض اور ایسی عداوت کے ہیں جس کی بنا پر کوئی شخص کسی دوسرے کے ساتھ بدسلوکی کرنے لگے۔ قرآن مجید میں دوسری جگہ ارشاد ہوا ہے وَلَا يَجْرِمَنَّكُمْ شَنَاٰنُ قَوْمٍ عَلٰٓي اَلَّا تَعْدِلُوْا۔ \" اور اے مسلمانو ! کسی گروہ کی عداوت تمہیں اس زیادتی پر آمادہ نہ کرنے پائے کہ تم انصاف نہ کرو \" (المائدہ 8) پس شانِئَكَ سے مراد ہر وہ شخص ہے جو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی دشمنی اور عداوت میں ایسا اندھا ہوگیا ہو کہ آپ کو عیب لگاتا ہو، آپ کے خلاف بدگوئی کرتا ہو، آپ کی توہین کرتا ہو، اور آپ پر طرح طرح کی باتیں چھانٹ کر اپنے دل کا بخار نکالتا ہو۔ \n سورة الکوثر   4\nهُوَ الْاَبْتَرُ \" وہی ابتر ہے \" فرمایا گیا ہے، یعنی وہ آپ کو ابتر کہتا ہے، لیکن حقیقت میں ابتر وہ خود ہے۔ ابتر کی کچھ تشریح ہم اس سے پہلے اس سورة کے دیباچے میں کرچکے ہیں۔ یہ لفظ بتر سے ہے جس کے معنی کاٹنے کے ہیں۔ مگر محاورے میں یہ بہت وسیع معنوں میں استعمال ہوتا ہے۔ حدیث میں نماز کی اس رکعت کو جس کے ساتھ کوئی دوسری رکعت نہ پڑھی جائے بتیراء کہا گیا ہے، یعنی اکیلی رکعت۔ ایک اور حدیث میں ہے کل امر ذی بال لا یبدأ فیہ بحمد اللہ فھو ابتر۔ \" ہر وہ کام جو کوئی اہمیت رکھتا ہو، اللہ کی حمد کے بغیر شروع کیا جائے تو وہ ابتر ہے \"۔ یعنی اس کی جڑ کٹی ہوئی ہے، اسے کوئی استحکام نصیب نہیں ہے، یا اس کا انجام اچھا نہیں ہے۔ نامراد آدمی کو ابتر کہتے ہیں۔ ذرائع و وسائل سے محروم ہوجانے والا بھی ابتر کہلاتا ہے۔ جس شخص کے لیے کسی خیر اور بھلائی کی توقع باقی نہ رہی ہو اور جس کی کامیابی کی سب امیدیں منقطع ہوگئی ہوں وہ بھی ابتر ہے، جو آدمی اپنے کنبے برادری اور اعوان و انصار سے کٹ کر اکیلا رہ گیا ہو وہ بھی ابتر ہے۔ جس آدمی کی کوئی اولاد نرینہ نہ ہو یا مرگئی ہو اس کے لیے بھی ابتر کا لفظ بولا جاتا ہے کیونکہ اس کے پیچھے اس کا کوئی نام لیوا باقی نہیں رہتا، اور مرنے کے بعد وہ بےنام و نشان ہوجاتا ہے۔ قریب قریب ان سب معنوں میں کفار قریش رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کو ابتر کہتے تھے۔ اس پر اللہ تعالیٰ نے فرمایا کہ اے نبی، ابتر تم نہیں ہو بلکہ تمہارے یہ دشمن ابتر ہیں۔ یہ محض کوئی \" جوابی حملہ \" نہ تھا، بلکہ درحقیقت یہ قرآن کی بڑی اہم پیشینگوئیوں میں سے ایک پیشینگوئی تھی جو حرف بحرف صحیح ثابت ہوئی۔ جس وقت یہ پیشینگوئی کی گئی تھی اس وقت لوگ حضور ہی کو ابتر سمجھ رہے تھے اور کوئی تصور بھی نہ کرسکتا تھا کہ قریش کے یہ بڑے بڑے سردار کیسے ابتر ہوجائیں گے جو نہ صرف مکہ میں بلکہ پورے عرب میں نامور تھے، کامیاب تھے، مال و دولت اور اولاد ہی کی نعمتیں نہیں رکھتے تھے بلکہ سارے ملک میں جگہ جگہ ان کے اعوان و انصار موجود تھے، تجارت کے اجارہ دار اور حج کے منتظم ہونے کی وجہ سے تمام قبائل عرب سے ان کے وسیع تعلقات تھے۔ لیکن چند سال نہ گزرے تھے کہ حالات بالکل پلٹ گئے۔ یا تو وہ وقت تھا کہ غزوہ احزاب (5 ھ) کے موقع پر قریش بہت سے عرب اور یہودی قبائل کو لے کر مدینے پر چڑھ آئے تھے اور حضور کو محصور ہو کر شہر کے گرد خندق کھود کر مدافعت کرنی پڑی تھی، یا تین ہی سال بعد وہ وقت آیا کہ 8 ھ میں جب آپ نے مکہ پر چڑھائی کی تو قریش کا کوئی حامی و مددگار نہ تھا اور انہیں بےبسی کے ساتھ ہتھیار ڈال دینے پڑے۔ اس کے بعد ایک سال کے اندر پورا ملک عرب حضور کے ہاتھ میں تھا، ملک کے گوشے گوشے سے قبائل کے وفود آکر بیعت کر رہے تھے۔ اور آپ کے دشمن بالکل بےبس اور بےیارومددگار ہو کر رہ گئے تھے۔ پھر وہ ایسے بےنام و نشان ہوئے کہ ان کی اولاد اگر دنیا میں باقی رہی بھی تو ان میں سے آج کوئی یہ نہیں جانتا کہ وہ ابو جہل یا ابو لہب یا عاص بن وائل یا عقبہ بن ابی معیط وغیرہ اعدائے اسلام کی اولاد میں سے ہے، اور جانتا بھی ہو تو کوئی یہ کہنے کے لیے تیار نہیں ہے کہ اس کے اسلاف یہ لوگ تھے۔ اس کے برعکس رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی آل پر آج دنیا بھر میں درود بھیجا جارہا ہے۔ کروڑوں مسلمانوں کو آپ سے نسبت پر فخر ہے۔ لاکھوں انسان آپ ہی سے نہیں بلکہ آپ کے خاندان اور آپ کے ساتھیوں کے خاندانوں تک سے انتساب کو باعث شرف سمجھتے ہیں۔ کوئی سید ہے، کوئی علوی ہے، کوئی عباسی ہے، کوئی ہاشمی ہے، کوئی صدیقی ہے، کوئی فاروقی ہے، کوئی عثمانی ہے، کوئی زبیری ہے، اور کوئی انصاری۔ مگر نام کو بھی کوئی ابو جہلی یا ابو لہبی نہیں پایا جاتا۔ تاریخ نے ثابت کردیا کہ ابتر حضور نہیں بلکہ آپ کے دشمن ہی تھے اور ہیں۔",
    "Translation": "تمہارا دُشمن 3 ہی جَڑ کٹا ہے۔ 4",
    "Words": " اِنَّ شَانِئَكَ : بیشک آپ کا دشمن   |   هُوَ : وہ   |   الْاَبْتَرُ : دم کٹا، نامراد "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6314,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "قُلْ يٰٓاَيُّهَا الْكٰفِرُوْنَ",
    "AyahTextPdms": "قُلْ يٰٓاَيُّهَا الْكٰفِرُوْنَ",
    "AyahTextQalam": "قُلْ یٰۤاَیُّهَا الْكٰفِرُوْنَۙ",
    "Id": 6315,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "سورة الکافرون  1\nاس آیت میں چند باتیں خاص طور پر توجہ طلب ہیں \n(١) حکم اگرچہ نبی (صلی اللہ علیہ وآلہ وسلم) کو دیا گیا ہے کہ آپ کافروں سے یہ بات صاف صاف کہہ دیں، لیکن آگے کا مضمون یہ بتارہا ہے کہ ہر مومن کو وہی بات کافروں سے کہہ دینی چاہیے جو بعد کی آیات میں بیان ہوئی ہے کہ حتی کہ جو شخص کفر سے توبہ کر کے ایمان لے آیا ہو اس کے لیے بھی لازم ہے کہ دین کفر اور اس کی عبادات اور معبودوں سے اسی طرح اپنی براءت کا اظہار کردے۔ پس لفظ قل (کہہ دو ) کے اولین مخاطب تو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) ہی ہیں، مگر حکم حضور کے لیے خاص نہیں ہے بلکہ آپ کے واسطے سے ہر مومن کو پہنچتا ہے۔\n(٢) \" کافر \" کا لفظ کوئی گالی نہیں ہے جو اس آیت کے مخاطبوں کو دی گئی ہو، بلکہ عربی زبان میں کافر کے معنی انکار کرنے والے اور نہ ماننے والے (unbeliever) کے ہیں، اور اس کے مقابلے میں \" مومن \" کا لفظ مان لینے اور تسلیم کرلینے والے (Believer) کے لیے بولا جاتا ہے، لہذا اللہ کے حکم سے نبی (صلی اللہ علیہ وآلہ وسلم) کا یہ فرمانا کہ \" اے کافرو \" دراصل اس معنی میں ہے کہ \" اے وہ لوگو جنہوں نے میری رسالت اور میری لائی ہوئی تعلیم کو ماننے سے انکار کیا ہے \"۔ اور اسی طرح ایک مومن جب یہ لفظ کہے گا تو اس کی مراد محمد (صلی اللہ علیہ وآلہ وسلم) پر ایمان نہ لانے والے ہوں گے۔\n(٣) اے کافرو کہا ہے، اے مشرکو نہیں کہا، اس لیے مخاطب صرف مشرکین ہی نہیں ہیں بلکہ وہ سب لوگ ہیں جو محمد (صلی اللہ علیہ وآلہ وسلم) کو اللہ تعالیٰ کا رسول، اور آپ کی لائی ہوئی تعلیم و ہدایت کو اللہ جل شانہ کی تعلیم و ہدایت نہیں مانتے، خواہ وہ یہود ہوں، نصاری ہوں، مجوسی ہوں، یا دنیا بھر کے کفار و مشرکین اور ملاحدہ ہوں۔ اس خطاب کو صرف قریش یا عرب کے مشرکین تک محدود رکھنے کی کوئی وجہ نہیں ہے۔\n(٣) منکرین کو اے کافرو کہہ کر خطاب کرنا بالکل ایسا ہی ہے جیسے ہم کچھ لوگوں کو اے دشمنو یا اے مخاطبو کہہ کر مخاطب کیں۔ اس طرح کا خطاب دراصل مخاطبوں کی ذات سے نہیں ہوتا بلکہ ان کی صفت دشمنی اور صفت مخالفت کی بنا پر ہوتا ہے اور اسی وقت تک کے لیے ہوتا ہے جب تک ان میں یہ صفت باقی رہے۔ اگر ان میں سے کوئی دشمنی و مخالفت چھوڑ دے، یا دوست اور حامی بن جائے تو وہ اس خطاب کا مخاطب نہیں رہتا۔ بالکل اسی طرح جن لوگوں کو \" اے کافرو \" کہہ کر خطاب کیا گیا ہے، وہ بھی ان کی صفت کفر کے لحاظ سے نہ کہ ان کی ذاتی حیثیت سے، ان میں سے جو شخص مرتے دم تک کافر رہے اس کے لیے تو یہ خطاب دائمی ہوگا، لیکن جو شخص ایمان لے آئے وہ اس کا مخاطب نہ رہے گا۔\n(٥) مفسرین میں سے بہت سے بزرگوں نے یہ رائے ظاہر کی ہے کہ اس سورة میں \" اے کافرو \" کا خطاب قریش کے صرف ان چند مخصوص لوگوں سے تھا جو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے پاس دین کے معاملے میں مصالحت کی تجویزیں لے لے کر آرہے تھے اور جن کے متلعق اللہ تعالیٰ نے اپنے رسول (صلی اللہ علیہ وآلہ وسلم) کو بتادیا تھا کہ یہ ایمان لانے والے نہیں ہیں۔ یہ رائے انہوں نے دو وجودہ سے قائم کی ہے۔ ایک یہ کہ آگے لَآ اَعْبُدُ مَا تَعْبُدُوْنَ (جس کی یا جن کی عبادت تم کرتے ہو اس کی یا ان کی عبادت میں نہیں کرتا) فرمایا گیا ہے۔ اور وہ کہتے ہیں کہ یہ قول یہود و نصاری پر صادق نہیں آتا، کیونکہ وہ اللہ کی عبادت کرتے ہیں۔ دوسرے یہ کہ آگے یہ بھی فرمایا گیا ہے کہ وَلَآ اَنْتُمْ عٰبِدُوْنَ مَآ اَعْبُدُ ( اور نہ تم اس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں) اور ان کا استدلال یہ ہے کہ یہ قول ان لوگوں پر صادق نہیں آتا جو اس سورة کے نزول کے وقت کافر تھے اور بعد میں ایمان لے آئے۔ لیکن یہ دونوں دلیلیں صحیح نہیں ہیں۔ جہاں تک ان آیتوں کا تعلق ہے ان کی تشریح تو ہم آگے چل کر کریں گے جس سے معلوم ہوجائے گا کہ ان کا وہ مطلب نہیں ہے جو ان سے سمجھا گیا ہے۔ یہاں اس استدلال کی غلطی واضح کرنے کے لیے صرف اتنی بات کہہ دینا کافی ہے کہ اگر اس سورة کے مخاطب صرف وہی لوگ تھے تو ان کے مر کھپ جانے کے بعد اس سورة کی تلاوت جاری رہنے کی آخر کیا وجہ ہے ؟ اور سے مستقل طور پر قرآن میں درج کردینے کی کیا ضرورت تھی کہ قیامت تک مسلمان اسے پڑھتے رہیں ؟",
    "Translation": "کہہ دو کہ اے کافرو، 1",
    "Words": " قُلْ يٰٓاَيُّهَا الْكٰفِرُوْنَ : کہدیجئے اے کافرو "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "لَآ اَعْبُدُ مَا تَعْبُدُوْنَ",
    "AyahTextPdms": "لَاۤ اَعْبُدُ مَا تَعْبُدُوْنَ",
    "AyahTextQalam": "لَاۤ اَعْبُدُ مَا تَعْبُدُوْنَۙ",
    "Id": 6316,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "سورة الکافرون   2\nاس میں وہ سب معبود شامل ہیں جن کی عبادت دنیا بھر کے کفار اور مشرکین کرتے رہے ہیں اور کر رہے ہیں، خواہ وہ ملائکہ ہوں، جنہوں، انبیاء اور اولیاء ہوں، زندہ یا مردہ انسانوں کی ارواح ہوں، یا سورج، چاند ستارے، جانور، درخت، دریا، بت اور خیالی دیویاں اور دیوتا ہوں۔ اس پر یہ سوال کیا جاسکتا ہے کہ مشرکین عرب اللہ تعالیٰ کو بھی تو معبود مانتے تھے اور دنیا کے دوسرے مشرکین نے بھی قدیم زمانے سے آج تک اللہ کے معبود ہونے کا انکار نہیں کیا ہے۔ رہے اہل کتاب تو وہ اصل معبود تو اللہ ہی کو تسلیم کرتے ہیں۔ پھر ان سب لوگوں کے تمام معبودوں کی عبادت سے کسی استثناء کے بغیر براءت کا اعلان کیسے صحیح ہوسکتا ہے جبکہ اللہ بھی ان میں شامل ہے ؟ اس کا جواب یہ ہے کہ اللہ کو معبودوں کے مجموعے میں ایک معبود کی حیثیت سے شامل کر کے اگر دوسروں کے ساتھ اس کی عبادت کی جائے تو وہ شخص جو توحید پر ایمان رکھتا ہو لازما اس عبادت سے اپنی براءت کا اظہار کرے گا، کیونکہ اس کے نزدیک اللہ معبودوں کے مجموعے میں سے ایک معبود نہیں بلکہ وہی ایک تنہا معبود ہے، اور اس مجموعے کی عبادت سرے سے اللہ کی عبادت ہی نہیں ہے اگرچہ اس میں اللہ کی عبادت بھی شامل ہو۔ قرآن مجید میں اس بات کو صاف صاف کہا گیا ہے کہ اللہ کی عبادت صرف وہ ہے جس کے ساتھ کسی دوسرے کی عبادت کا شائبہ تک نہ ہو، اور جس میں انسان اپنی بندگی کو بالکل اللہ ہی کے لیے خالص کردے۔ وَمَآ اُمِرُوْٓا اِلَّا لِيَعْبُدُوا اللّٰهَ مُخْلِصِيْنَ لَهُ الدِّيْنَ ڏ حُنَفَاۗءَ ۔ \" لوگوں کو اس کے سوا کوئی حکم نہیں دیا گیا کہ وہ بالکل یک سو ہوکر، اپنے دین کو اللہ کے لیے خالص کر کے اس کی عبادت کریں \"۔ (البینہ۔ 5) یہ مضمون بکثرت مقامات پر قرآن میں پوری وضاحت کے ساتھ اور پورے زور کے ساتھ بیان کیا گیا ہے۔ مثال کے طور پر ملاحظہ ہو النساء، آیات 145 ۔ 146 ۔ الاعراف 29 ۔ الزمر 2 ۔ 3 ۔ 11 ۔ 14 ۔ 15 ۔ المومن 14 ۔ 64 تا 66 ۔ یہی مضمون ایک حدیث قدسی میں بیان کیا گیا ہے جس میں رسول اللہ (صلی اللہ علیہ وآلہ وسلم) فرماتے ہیں  \" اللہ تعالیٰ کا ارشاد ہے کہ میں سب سے بڑھ کر ہر شریک کی شرکت سے بےنیاز ہوں، جس شخص نے کوئی عمل ایسا کیا جس میں میرے ساتھ کسی اور کو بھی اس نے شریک کیا ہو اس سے میں بری ہوں اور وہ پورا کا پورا عمل اسی کے لیے ہے جس کو اس نے شریک کیا \" (مسلم، مسند احمد، ابن ماجہ) پس درحقیقت اللہ کو دو یا تین یا بہت سے خداؤں میں سے ایک قرار دینا اور اس کے ساتھ دوسروں کی بندگی و پرستش کرنا ہی تو وہ اصل کفر ہے جس سے اظہار براءت کرنا اس سورة کا مقصد ہے۔",
    "Translation": "میں اُن کی عبادت نہیں کرتا جن کی عبادت تم کرتے ہو، 2",
    "Words": " لَآ اَعْبُدُ : نہیں میں عبادت کرتا   |   مَا تَعْبُدُوْنَ : جس کی تم عبادت کرتے ہو "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "وَلَآ اَنْتُمْ عٰبِدُوْنَ مَآ اَعْبُدُ",
    "AyahTextPdms": "وَلَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُ",
    "AyahTextQalam": "وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُۚ",
    "Id": 6317,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "سورة الکافرون   3\nاصل الفاظ ہیں مَآ اَعْبُدُ ۔ عربی زبان میں مَا کا لفظ عموما بےجان یا بےعقل چیزوں کے لیے استعمال ہوتا ہے، اور ذی عقل ہستیوں کے لیے مَن کا لفظ بولا جاتا ہے۔ اس بنا پر یہ سوال پیدا ہوتا ہے کہ یہاں من اعبد کہنے کے بجائے مَآ اَعْبُدُ کیوں کہا گیا ہے ؟ اس کے چار جواب عام طور پر مفسرین نے دیے ہیں۔ ایک یہ کہ یہاں م٘ا بمعنی من ہے۔ دوسرے یہ کہ یہاں مَا بمعنی الذی (یعنی جو باتیں) ہے۔ تیسرے یہ کہ دونوں فقروں میں مَا مصدر کے معنی میں ہے اور اس کا مطلب یہ ہے کہ میں وہ عبادت نہیں کرتا جو تم کرتے ہو، یعنی مشرکانہ عبادت، اور تم وہ عبادت نہیں کرتے جو میں کرتا ہوں، یعنی موحدانہ عبادت۔ چوتھے یہ کہ پہلے فقرے میں چونکہ مَا تَعْبُدُوْنَ فرمایا گیا ہے اس لیے دوسرے فقرے میں کلام کی مناسبت برقرار رکھتے ہوئے مَآ اَعْبُدُ فرمایا گیا ہے، لیکن دونوں جگہ صرف لفظ کی یکسانی ہے، معنی کی یکسانی نہیں ہے، اور اس کی مثالیں قرآن مجید میں دوسری جگہ بھی ملتی ہیں۔ مثلا سورة بقرہ آیت 194 میں فرمایا گیا ہے  فَمَنِ اعْتَدٰى عَلَيْكُمْ فَاعْتَدُوْا عَلَيْهِ بِمِثْلِ مَا اعْتَدٰى عَلَيْكُمْ ۔ \" جو تم پر زیادتی کرے اس پر تم ویسی ہی زیاتی کرو جیسی اس نے تم پر کی ہے \" ظاہر ہے کہ زیادتی کا ویسا ہی جواب جیسی زیادتی کی گئی ہو، زیادتی کی تعریف میں نہیں آتا، مگر محض کلام کی یکسانی کے لیے جوابا زیادتی کا لفظ استعمال کیا گیا ہے۔ اسی طرح سورة توبہ آیت 67 میں ارشاد ہوا ہے  ۭنَسُوا اللّٰهَ فَنَسِيَهُمْ ۔ \" وہ اللہ کو بھول گئے تو اللہ ان کو بھول گیا \"۔ حالانکہ اللہ بھولتا نہیں ہے اور مقصود کلام یہ ہے کہ اللہ نے ان کو نظر انداز فرما دیا، لیکن ان کے نسیان کے جواب میں اللہ کے لیے نسیان کا لفظ محض کلام کی یکسانی برقرار رکھنے کے لیے استعمال کیا گیا ہے۔\nیہ چاروں تاویلات اگرچہ ایک ایک لحاظ سے درست ہیں اور عربی زبان میں یہ سب معنی لینے کی گنجائش ہے، لیکن ان میں سے کسی سے بھی وہ اصل مدعا واضح نہیں ہوتا جس کے لیے من اعبد کہنے کے بجائے مَآ اَعْبُدُ کہا گیا ہے۔ دراصل عربی زبان میں کسی شخص کے لیے جب مَن کا لفظ استعمال ہوتا ہے تو اس سے مقصود اس کی ذات کے متعلق کچھ کہنا یا پوچھنا ہوتا ہے، اور جب مَا کا لفظ استعمال ہوتا ہے تو اس سے مقصود اس کی صفت کے بارے میں استفسار یا اظہار خیال ہوتا ہے۔ یہ ایسا ہی ہے جیسے اردو زبان میں جب ہم کسی شخص کے متعلق پوچھتے ہیں کہ یہ صاحب کون ہیں تو مقصد اس شخص کی ذات سے تعارف حاصل کرنا ہوتا ہے، مگر جب ہم کسی شخص کے متعلق پوچھتے ہیں کہ یہ صاحب کیا ہیں ؟ تو اس سے یہ معلوم کرنا مقصود ہوتا ہے کہ مثلا وہ فوج آدمی ہے تو فوج میں اس کا منصب کیا ہے ؟ اور کسی درسگاہ سے تعلق رکھتا ہے تو اس میں ریڈر ہے ؟ لکچرر ہے ؟ پروفیسر ہے ؟ کس علم یا فن کا استاد ہے ؟ کیا ڈگریاں رکھتا ہے ؟ وغیرہ پس اگر اس آیت میں یہ کہا جاتا کہ لَآ اَنْتُمْ عٰبِدُوْنَ مَن اَعْبُدُ تو اس کا مطلب یہ ہوتا کہ تم اس ہستی کی عبادت کرنے والے نہیں ہو جس کی عبادت میں کرتا ہوں اور اس کے جواب میں مشرکین اور کفار یہ کہہ سکتے تھے کہ اللہ کی ہستی کو تو ہم مانتے ہیں، اور اس کی عبادت بھی ہم کرتے ہیں ؟ لیکن جب یہ کہا گیا کہ لَآ اَنْتُمْ عٰبِدُوْنَ مَآ اَعْبُدُ تو اس کا مطلب یہ ہوا کہ جن صفات کے معبود کی عبادت میں کرتا ہوں ان صفات کے معبود کی عبادت کرنے والے تم نہیں ہو۔ اور یہی وہ اصل بات ہے جس کی بنا پر نبی (صلی اللہ علیہ وآلہ وسلم) کا دین منکرین خدا کے سوا تمام اقسام کے کفار کے دین سے قطعی طور پر الگ ہوجاتا ہے۔ کیونکہ آپ کا خدا ان سب کے خدا سے بالکل مختلف ہے۔ ان میں سے کسی کا خدا ایسا ہے جس کو چھ دن میں دنیا پیدا کرنے کے بعد ساتویں دن آرام کرنے کی ضرورت پیش آئی، جو رب العالمین نہیں بلکہ رب اسرائیل ہے، جس کا ایک نسل کے لوگوں سے ایسا خاص رشتہ ہے جو دوسرے انسانوں سے نہیں ہے، جو حضرت یعقوب سے کشتی لڑتا ہے اور ان کو گرا نہیں سکتا، جو عزیر نامی ایک بیٹا بھی رکھتا ہے، کسی کا خدا یسوع مسیح نامی ایک اکلوتے پیٹ؁ کا باپ ہے اور وہ دوسروں کے گناہوں کا کفارہ بنانے کے لیے اپنے بیٹے کو صلیب پر چڑھوا دیتا ہے۔ کسی کا خدا بیوی بچے رکھتا ہے، مگر بےچارے کے ہاں صرف بیٹیاں پیدا ہوتی ہیں، کسی کا خدا انسانی شکل میں روپ دھارتا ہے اور زمین پر انسانی جسم میں رہ کر انسانوں کے سے کام کرتا ہے۔ کسی کا خدا محض واجب الوجود، یا علت العلل یا علت اولی ( First Cause) ہے، کائنات کے نظام کو ایک مرتبہ حرکت دے کر الگ جا بیٹحا ہے، اس کے بعد کائنات لگے بندھے قوانین کے مطابق خود چل رہی ہے اور انسان کا اس سے اور اس کا انسان سے اب کوئی تعلق نہیں ہے۔ غرض خدا کو ماننے والے کفار بھی درحقیقت اس خدا کو نہیں مانتے جو ساری کائنات کا ایک ہی خالق، مالک، مدبر، منتظم اور حاکم ہے۔ جس نے نظام کائنات کو صرف بنایا ہی نہیں ہے بلکہ ہر آن وہی اس کو چلا رہا ہے اور اس کا حکم ہر وقت یہاں چل رہا ہے۔ جو ہر عیب، نقص، کمزوری اور غلطی سے منزہ ہے، جو ہر تشیہ اور تجسیم سے پاک ہے، ہر نظیر و مثیل سے مبرا اور ہر ساتھی اور ساجھی سے بےنیاز ہے۔ جس کی ذات، صفات، اختیارات اور استحقاق معبودیت میں کوئی اس کا شریک نہیں ہے۔ جو اس سے بالاتر ہے کہ کوئی اس کی اولاد ہو، یا کسی کو وہ بیٹا بنائے، یا کسی قوم اور نسل سے اس کا کوئی خاص رشتہ ہو جس کا اپنی مخلوق کے ایک ایک فرد کے ساتھ رزقی اور روبیت اور رحمت اور نگہبانی کا براہ راست تعلق ہے۔ جو دعائیں سننے والا اور ان کا جواب دینے والا ہے۔ جو موت اور زندگی، نفع اور ضرر اور قسمتوں کے بناؤ اور بگاڑ کے جملہ اختیارات کا تنہا مالک ہے۔ جو اپنی مخلوق کو صرف پالتا ہی نہیں ہے بلکہ ہر ایک کو اس کی حیثیت اور ضرورت کے مطابق ہدایت بھی دیتا ہے۔ جس کے ساتھ ہمارا تعلق صرف یہی نہیں ہے کہ وہ ہمارا معبود ہے اور ہم اس کی پرستش کرتے ہیں، بلکہ یہ بھی ہے کہ وہ اپنے انبیاء اور اپنی کتابوں کے ذریعہ سے ہمیں امر و نہی کے احکام دیتا ہے اور ہمارا کام اس کے احکام کی اطاعت کرنا ہے۔ جس کے سامنے ہم اپنے اعمال کے لیے جواب دہ ہیں، جو مرنے کے بعد ہمیں دوبارہ اٹھانے والا ہے اور ہمارے اعمال کا محاسبہ کر کے جزا اور سزا دینے والا ہے۔ ان صفات کے معبود کی عبادت محمد (صلی اللہ علیہ وآلہ وسلم) اور ان کی پیروی کرنے والوں کے سوا دنیا میں کوئی بھی نہیں کر رہا ہے۔ دوسرے اگر خدا کی عبادت کر بھی رہے ہیں تو اصلی اور حقیقی خدا کی نہیں بلکہ اس خدا کی عبادت کر رہے ہیں جو ان کا اپنا اختراع کردہ ایک خیالی خدا ہے۔",
    "Translation": "اور نہ تم اُس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں۔ 3",
    "Words": " وَلَآ اَنْتُمْ عٰبِدُوْنَ : اور نہ تم عبادت کرنے والے   |   مَآ اَعْبُدُ : جس کی میں عبادت کرتا ہوں "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "وَلَآ اَنَا عَابِدٌ مَّا عَبَدْتُّمْ",
    "AyahTextPdms": "وَلَاۤ اَنَا عَابِدٌ مَّا عَبَدْتُّمْ",
    "AyahTextQalam": "وَ لَاۤ اَنَا عَابِدٌ مَّا عَبَدْتُّمْۙ",
    "Id": 6318,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "",
    "Translation": "اور نہ میں اُن کی عبادت کرنے والا ہوں جن کی عبادت تم نے کی ہے",
    "Words": " وَلَآ اَنَا عَابِدٌ: اور نہ میں عبادت کرنیوالا   |   مَّا عَبَدْتُّمْ : جسکی تم عبادت کرتے ہو "
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "وَلَآ اَنْتُمْ عٰبِدُوْنَ مَآ اَعْبُدُ",
    "AyahTextPdms": "وَلَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ   اَعْبُدُ",
    "AyahTextQalam": "وَ لَاۤ اَنْتُمْ عٰبِدُوْنَ مَاۤ اَعْبُدُؕ",
    "Id": 6319,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "سورة الکافرون   4\nمفسرین میں سے ایک گروہ کا خیال ہے کہ یہ دونوں فقرے پہلے دو فقروں کے مضمون کی تکرار ہیں، اور یہ تکرار اس غرض کے لیے کی گئی ہے کہ اس بات کو زیادہ پر زور بنادیا جائے جو پہلے دو فقروں میں کہی گئی تھی۔ لیکن بہت سے مفسرین اس کو تکرار نہیں مانتے بلکہ وہ کہتے ہیں کہ ان میں ایک اور مضمون بیان کیا گیا ہے جو پہلے فقروں کے مضمون سے مختلف ہے۔ ہمارے نزدیک اس حد تک تو ان کی بات صحیح ہے کہ ان فقروں میں تکرار نہیں ہے، کیونکہ ان میں صرف \" اور نہ تم اس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں \" کا اعادہ کیا گیا ہے۔ اور یہ اعادہ بھی اس معنی میں نہیں ہے جس میں یہ فقرہ پہلے کہا گیا تھا۔ مگر تکرار کی نفی کرنے کے بعد مفسرین کے اس گروہ نے ان دونوں فقروں کے جو معنی بیان کیے ہیں وہ ایک دوسرے سے بہت مختلف ہیں۔ یہاں اس کا موقع نہیں ہے کہ ہم ان میں سے ہر ایک کے بیان کردہ معنی کو نقل کر کے اس پر بحث کریں، اس لیے طول کلام سے بچتے ہوئے ہم صرف وہ معنی بیان کریں گے جو ہمارے نزدیک صحیح ہیں۔\nپہلے فقرے میں فرمایا گیا ہے کہ \" اور نہ میں ان کی عبادت کرنے والا ہوں جن کی عبادت تم نے کی ہے \" اس کا مضمون آیت نمبر 2 کے مضمون سے بالکل مختلف ہے جس میں فرمایا گیا تھا کہ \" میں ان کی عبادت نہیں کرنا جن کی عبادت تم کرتے ہو \"۔ ان دونوں باتوں میں دو حیثیتوں سے بہت بڑا فرق ہے۔ ایک یہ کہ میں فلاں کام نہیں کرتا یا نہیں کروں گا کہنے میں اگرچہ انکار اور پرزور انکار ہے، لیکن اس سے بہت زیادہ زور یہ کہنے میں ہے کہ میں فلاں کام کرنے والا نہیں ہوں، کیونکہ اس کے معنی یہ ہیں کہ وہ ایسا برا کام ہے جس کا ارتکاب کرنا تو درکنار اس کا ارادہ یا خیال کرنا بھی میرے لیے ممکن نہیں ہے۔ دوسرے یہ کہ \" جن کی عبادت تم کرتے ہو \" کا اطلاق صرف ان معبودوں پر ہوتا ہے جن کی عبادت کفار اب کر رہے ہیں۔ بخلاف اس کے \" جن کی عبادت تم نے کی ہے \" کا اطلاب سن سب معبودوں پر ہوتا ہے جن کی عبادت کفار اور ان کے آباؤ اجداد زمانہ ماضی میں کرتے رہے ہیں۔ اب یہ ایک معلوم حقیقت ہے کہ مشرکین اور کفار کے معبودوں میں ہمیشہ ردو بدل اور حذف و اضافہ ہوتا رہا ہے، مختلف زمانوں میں کفار کے مختلف گروہ مختلف معبودوں کو پوجتے رہے ہیں، اور سارے کافروں کے معبود ہمیشہ اور ہر جگہ ایک ہی نہیں رہے ہیں۔ پس آیت کا مطلب یہ ہے کہ میں تمہارے آج کے معبودوں ہی سے نہیں بلکہ تمہارے آباؤ اجداد کے معبودوں سے بھی بری ہوں اور میرا یہ کام نہیں ہے کہ ایسے معبودوں کی عبادت کا خیال تک اپنے دل میں لاؤں۔",
    "Translation": "اور نہ تم اُس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں۔ 4",
    "Words": " وَلَآ اَنْتُمْ عٰبِدُوْنَ : اور نہ تم عبادت کرنے والے   |   مَآ اَعْبُدُ : جس کی میں عبادت کرتا ہوں "
},
{
    "AyahNumber": 6,
    "AyahTextMuhammadi": "لَكُمْ دِيْنُكُمْ وَلِيَ دِيْنِ",
    "AyahTextPdms": "لَكُمْ دِيْنُكُمْ وَلِيَ دِيْنِ",
    "AyahTextQalam": "لَكُمْ دِیْنُكُمْ وَ لِیَ دِیْنِ۠",
    "Id": 6320,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 34,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الكافرون",
    "SurahNameEnglish": "Al-Kaafiroon",
    "SurahNumber": 109,
    "Tafseer": "سورة الکافرون   5\nیعنی میرا دین الگ ہے اور تمہارا دین الگ۔ میں تمہارے معبودوں کا پرستار نہیں اور تم میرے معبود کے پرستار نہیں۔ میں تمہارے معبودوں کی بندگی نہیں کرسکتا اور تم میرے معبود کی بندگی کے لیے تیار نہیں ہو۔ اس لیے میرا اور تمہارا راستہ کبھی ایک نہیں ہوسکتا۔ یہ کفار کو رواداری کا پیغام نہیں ہے، بلکہ جب تک وہ کافر ہیں ان سے ہمیشہ کے لیے براءت، بیزاری اور لا تعلقی کا اعلان ہے، اور اس سے مقصود ان کو اس امر سے قطعی اور آخری طور پر مایوس کردینا ہے کہ دین کے معاملہ میں اللہ کا رسول اور اس پر ایمان لانے والوں کا گروہ کبھی ان سے کوئی مصالحت کرے گا، یہی اعلان براءت اور اظہار بیزاری اس سورة کے بعد نازل ہونے والی مکی سورتوں میں پے در پے کیا گیا ہے۔ چناچہ سورة یونس میں فرمایا \" اگر یہ تجھے جھٹلاتے ہیں تو کہہ دے کہ میرا عمل میرے لیے اور تمہارا عمل تمہارے لیے، جو کچھ میں کرتا ہوں اس کی ذمہ داری سے تم بری ہو اور جو کچھ تم کر رہے ہو اس کی ذمہ داری سے میں بری ہوں \"۔ (آیت 41) پھر آگے چل کر اسی سورة میں فرمایا \" اے نبی، کہہ دو کہ لوگو، اگر تم میرے دین کے متعلق (ابھی تک) کسی شبہ میں ہو تو (سن لو کہ) اللہ کے سوا تم جن کی بندگی کرتے ہو میں ان کی بندگی نہیں کرتا، بلکہ صرف اس خدا کی بندگی کرتا ہوں جس کے اختیار میں تمہاری موت ہے \" (آیت 104) سورة سبا میں فرمایا \" ان سے کہو جو قصور ہم نے کیا ہو اس کی باز پرس تم سے نہ ہوگی اور جو کچھ تم کر رہے ہو اس کی کوئی جواب طلبہ یم سے نہیں کی جائے گی، کہو ہمارا رب (ایک وقت) ہمیں اور تمہیں جمع کرے گا اور ہمارے درمیان ٹھیک ٹھیک فیصلہ کردے گا \"۔ (آیات 25 ۔ 26) سورة زمر میں فرمایا \" ان سے کہو، اے میری قوم کے لوگو، تم اپنی جگہ کام کیے جاؤ، میں اپنا کام کرتا رہوں گا، عنقریب تمہیں معلوم ہوجائے گا کہ کس پر رسوا کن عذاب آتا ہے اور کسے وہ سزا ملتی ہے جو ٹلنے والی نہیں \"۔ (آیات 39 ۔ 40) پھر یہی سبق مدینہ طیبہ میں تمام مسلمانوں کو دیا گیا کہ \" تم لوگوں کے لیے ابراہیم اور اس کے ساتھیوں میں ایک اچھا نمونہ ہے کہ انہوں نے اپنی قوم سے صاف کہہ دیا کہ ہم تم سے اور تمہارے ان معبودوں سے، جن کو تم خدا کو چھوڑ کر پوجتے ہو، قطعی بیزار ہیں، ہم نے تم سے کفر کیا اور ہمارے اور تمہارے درمیان ہمیشہ کے لیے عداوت ہوگئی اور بیر پڑگیا جب تک تم اللہ واح پر ایمان نہ لاؤ \"۔ (الممتحنہ۔ آیت 4) قرآن مجید کی ان پے در پے توضیحات سے اس شبہ کی گنجائش تک نہیں رہتی کہ لَكُمْ دِيْنُكُمْ وَلِيَ دِيْنِ کا مطلب یہ ہے کہ تم اپنے دین پر قائم رہو اور مجھے اپنے دین پر چلنے دو ۔ بلکہ یہ اسی طرح کی بات ہے جیسی سورة زمر میں فرمائی گئی ہے کہ \" اے نبی ان سے کہو کہ میں تو اپنے دین کو اللہ کے لیے خالص کر کے اسی کی بندگی کروں گا، تم اسے چھوڑ کر جس جس کی بندگی کرنا چاہو کرتے رہو \"۔ (آیت 14)\nاس آیت سے امام ابوحنیفہ اور امام شافعی نے یہ استدلال کیا ہے کہ کافروں کے مذاہب خواہ باہم کتنے ہی مختلف ہوں لیکن کفر بحیثیت مجموعی ایک ہی ملت ہے، اس لیے یہودی عیسائی کا، اور عیسائی یہودی کا، اور اسی طرح ایک مذہب کا کافر دوسرے مذہب کے کافر کا وارث ہوسکتا ہے اگر ان کے درمیان نسب، یا نکاح یا کسی سبب کی بنا پر کوئی ایسا تعلق ہو جو ایک کی وراثت دوسرے کو پہنچنے کا مقتضی ہو۔ بخلاف اس کے امام مالک، امام اوزاعی اور امام احمد اس بات کے قائل ہیں کہ ایک مذہب کے پیرو دوسرے مذہب کے پیرو کی وراثت نہیں پاسکتے۔ ان کا استدلال اس حدیث سے ہے جو حضرت عبداللہ بن عمرو بن عاص سے منقول ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے فرمایا لا یتوارث اھل ملتین شتی۔ \" دو مختلف ملتوں کے لوگ ایک دوسرے کے وارث نہیں ہوسکتے \"۔ (مسند احمد، ابو داؤد، ابن ماجہ، دار قطنی) اس سے ملتے جلتے مضمون کی ایک حدیث ترمذی نے حضرت جابر سے اور ابن حبان نے حضرت عبداللہ بن عمر سے اور بزار نے حضرت ابوہریرہ سے نقل کی ہے۔ اس مسئلے پر مفصل بحث کرتے ہوئے مسلک حنفی کے مشہور امام شمس الائمہ سرخسی لکتے ہیں۔ \" کفار آپس میں ان سب اسباب کی بنا پر بھی ایک دوسرے کے وارث ہوسکتے ہیں جن کی بنا پر مسلمان آپس میں ایک دوسرے کے وارث ہوتے ہیں، اور ان کے درمیان بعض ایسی سورتوں میں بھی توارث ہوسکتا ہے جن میں مسلمانوں کے درمیان نہیں ہوتا۔ حقیقت یہ ہے کہ اللہ نے بس دو ہی دین قرار دیے ہیں، ایک دین حق، دوسرے دین باطل چناچہ فرمایا لَكُمْ دِيْنُكُمْ وَلِيَ دِيْنِ ۔ اور اس نے لوگوں کے دو ہی فریق رکھے ہیں، ایک فریق جنتی ہے اور وہ مومن ہے۔ اور دوسرا فریق دوزخی ہے اور وہ بحیثیت مجموعی تمام کفار ہیں۔ اور اس نے دو ہی گروہوں کو ایک دوسرے کا مخالف قرار دیا ہے۔ چناچہ فرمایا ھٰذٰنِ خَصْمٰنِ اخْتَصَمُوْا فِيْ رَبِّهِمْ ( یہ دو مد مقابل فریق ہیں جن کے درمیان اپنے رب کے معاملے میں جھگڑا ہے۔ الحج آیت 19) یعنی ایک فریق تمام کفار بحیثیت مجموعی ہیں اور ان کا جھگڑا اہل ایمان سے ہے۔ ہم یہ تسلیم نہیں کرتے کہ وہ اپنے اعتقاد کے مطابق باہم الگ الگ ملتیں ہیں، بلکہ مسلمانوں کے مقابلے میں وہ سب ایک ملت ہیں کیونکہ مسلمان محمد (صلی اللہ علیہ وآلہ وسلم) کی رسالت اور قرآن کا اقرار کرتے ہیں اور وہ ان کا انکار کرتے ہیں۔ اسی وجہ سے وہ کافر قرار پائے ہیں اور مسلمانوں کے معاملہ میں وہ سب ایک ملت ہیں۔ حدیث لا یتوارث اھل ملتین اسی بات کی طرف اشارہ کرتی ہے جس کا ہم نے ذکر کیا ہے، کیونکہ ملتین (دو ملتوں) کی تشریح رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے اپنے اس ارشاد سے کردی ہے کہ لا یرث المسلم الکافر ولا الکافر المسلم۔ مسلمان کافر کا وارث نہیں ہوسکتا اور نہ کافر مسلمان کا وارث ہوسکتا ہے، (المبسوط، جلد 3، صفحات 30 ۔ 32) امام سرخسی نے یہاں جس حدیث کا حوالہ دیا ہے اسے بخاری، مسلم، نسائی، احمد، ترمذی، ابن ماجہ اور ابو داؤد نے حضرت اسامہ بن زید سے روایت کیا ہے۔",
    "Translation": "تمہارے لیے تمہارا دین ہے اور میرے لیے میرا دین۔ 5",
    "Words": " لَكُمْ : تمہارے لئے   |   دِيْنُكُمْ : تمہارا دین   |   وَلِيَ دِيْنِ : میرے لئے ۔ میرا دین "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6321,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "النصر",
    "SurahNameEnglish": "An-Nasr",
    "SurahNumber": 110,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "اِذَا جَاۗءَ نَصْرُ اللّٰهِ وَالْفَتْحُ",
    "AyahTextPdms": "اِذَا جَآءَ نَصۡرُ اللّٰهِ وَالۡفَتۡحُۙ",
    "AyahTextQalam": "اِذَا جَآءَ نَصْرُ اللّٰهِ وَ الْفَتْحُۙ",
    "Id": 6322,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 35,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "النصر",
    "SurahNameEnglish": "An-Nasr",
    "SurahNumber": 110,
    "Tafseer": "سورة النصر   1\nفتح سے مراد کسی ایک معرکے میں فتح نہیں، بلکہ وہ فیصلہ کن فتح ہے جس کے بعد ملک میں کوئی طاقت اسلام سے ٹکر لینے کے قابل باقی نہ رہے اور یہ امر واضح ہوجائے کہ اب عرب میں اسی دین کو غالب ہو کر رہنا ہے۔ بعض مفسرین نے اس سے مراد فتح مکہ لی ہے۔ لیکن فتح مکہ 8 ھ میں ہوئی ہے اور اس سورة کا نزول 10 ھ کے آخر میں ہوا ہے جیسا کہ حضرت عبداللہ بن عمر اور حضرت سراء بنت بنہان کی ان روایات سے معلوم ہوتا ہے جو ہم نے دیباچے میں نقل کی ہیں۔ علاوہ بریں حضرت عبداللہ بن عباس کا یہ قول بھی اس تفسیر کے خلاف پڑتا ہے کہ یہ قرآن مجید کی سب سے آخری سورة ہے۔ کیونکہ اگر فتح سے مراد فتح مکہ ہو تو پوری سورة توبہ اس کے بعد نازل ہوئی تھی، پھر یہ سورة آخری سورة کیسے ہوسکتی ہے۔ بلا شبہ فتح مکہ اس لحاظ سے فیصلہ کن تھی کہ اس نے مشرکین عرب کی ہمتیں پست کردی تھیں، مگر اس کے بعد بھی ان میں کافی دم خم باقی تھا۔ طائف اور حنین کے معرکے اس کے بعد ہی پیش آئے اور عرب پر اسلام کا غلبہ مکمل ہونے میں تقریبا دو سال صرف ہوئے۔",
    "Translation": "جب اللہ کی مدد آجائے اور فتح نصیب ہو جائے 1",
    "Words": " اِذَا جَآءَ : جب آجائے   |   نَصْرُ اللّٰهِ : اللہ کی مدد   |   وَالْفَتْحُ : اور فتح "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "وَرَاَيْتَ النَّاسَ يَدْخُلُوْنَ فِيْ دِيْنِ اللّٰهِ اَفْوَاجًا",
    "AyahTextPdms": "وَرَاَيۡتَ النَّاسَ يَدۡخُلُوۡنَ فِىۡ دِيۡنِ اللّٰهِ اَفۡوَاجًا",
    "AyahTextQalam": "وَ رَاَیْتَ النَّاسَ یَدْخُلُوْنَ فِیْ دِیْنِ اللّٰهِ اَفْوَاجًاۙ",
    "Id": 6323,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 35,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "النصر",
    "SurahNameEnglish": "An-Nasr",
    "SurahNumber": 110,
    "Tafseer": "سورة النصر   2\nیعنی وہ زمانہ رخصت ہوجائے جب ایک ایک دو دو کر کے لوگ اسلام میں داخل ہوتے تھے اور وہ وقت آجائے جب پورے پورے قبیلے، اور بڑے بڑے علاقوں کے باشندے کسی جنگ اور کسی مزاحمت کے بغیر از خود مسلمان ہونے لگیں۔ یہ کیفیت 9 ھ کے آغاز سے رونما ہونی شروع ہوئی جس کی وجہ سے اس سال کو سال وفود کہا جاتا ہے۔ عرب کے گوشے گوشے سے وفد پر وفد رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی خدمت میں حاضر ہونے لگے اور اسلام قبول کر کے آپ کے دست مبارک پر بیعت کرنے لگے۔ یہاں تک کہ 10 ھ میں جب حضور حجۃ الوداع کے لیے تشریف لے گئے اس وقت پورا عرب اسلام کے زیر نگیں ہوچکا تھا اور ملک میں کوئی مشرک باقی نہ رہا تھا۔",
    "Translation": "اور (اے نبیؐ) تم دیکھ لو کہ لوگ فوج در فوج اللہ کے دین میں داخل ہو رہے ہیں 2",
    "Words": " وَرَاَيْتَ : اور آپ دیکھیں   |   النَّاسَ : لوگ   |   يَدْخُلُوْنَ : داخل ہورہے ہیں   |   فِيْ : میں   |   دِيْنِ اللّٰهِ : اللہ کا دین   |   اَفْوَاجًا : فوج در فوج "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ     ڼ اِنَّهٗ كَانَ تَوَّابًا",
    "AyahTextPdms": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَاسۡتَغۡفِرۡهُ‌ ؔؕ اِنَّهٗ كَانَ تَوَّابًا",
    "AyahTextQalam": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَ اسْتَغْفِرْهُ١ؔؕ اِنَّهٗ كَانَ تَوَّابًا۠",
    "Id": 6324,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 35,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "النصر",
    "SurahNameEnglish": "An-Nasr",
    "SurahNumber": 110,
    "Tafseer": "سورة النصر   3\nحمد سے مراد اللہ تعالیٰ کی تعریف و ثنا کرنا بھی ہے اور اس کا شکر ادا کرنا بھی۔ اور تسبیح سے مراد اللہ تعالیٰ کو ہر لحاظ سے پاک اور منزہ قرار دینا ہے۔ اس موقع پر یہ ارشاد کہ اپنے رب کی قدرت کا یہ کرشمہ جب تم دیکھ لو تو اس کی حمد کے ساتھ اس کی تسبیح کرو، اس میں حمد کا مطلب یہ ہے کہ اس عظیم کامیابی کے متعلق تمہارے دل میں کبھی اس خیال کا کوئی شائبہ تک نہ آئے کہ یہ تمہارے اپنے کمال کا نتیجہ ہے، بلکہ اس کو سراسر اللہ کا فضل و کرم سمجھو، اس پر اس کا شکر ادا کرو، اور قلب و زبان سے اس امر کا اعتراف کرو کہ اس کامیابی کی ساری تعریف اللہ ہی کو پہنچتی ہے۔ اور تسبیح کا مطلب یہ ہے کہ اللہ کو اس سے پاک اور منزہ قرار دو کہ اس کے کلمے کا بلند ہونا تمہاری کسی سعی و کوشش کا محتاج یا اس پر منحصر تھا۔ اس کے برعکس تمہارا دل اس یقین سے لبریز رہے کہ تمہاری سعی و کوشش کی کامیابی اللہ کی تائید و نصرت پر منحصر تھی، وہ اپنے جس بندے سے چاہتا اپنا کام لے سکتا تھا اور یہ اس کا احسان ہے کہ اس نے یہ خدمت تم سے لی اور تمہارے ہاتھوں اپنے دین کا بول بالا کرایا۔ اس کے علاوہ تسبیح، یعنی سبحان اللہ کہنے میں ایک پہلو تعجب کا بھی ہے۔ جب کوئی محیر العقول واقعہ پیش آتا ہے تو آدمی سبحان اللہ کہتا ہے، اور اس کا مطلب یہ ہوتا ہے کہ اللہ ہی کی قدرت سے ایسا حیرت انگیز واقعہ رونما ہوا ہے ورنہ دنیا کی کسی طاقت کے بس میں نہ تھا کہ ایسا کرشمہ اس سے صادر ہوسکتا۔\n سورة النصر   4\nیعنی اپنے رب سے دعا مانگو کہ جو خدمت اس نے تمہارے سپرد کی تھی اس کو انجام دینے میں تم سے جو بھول چوک یا کوتاہی بھی ہوئی ہو اس سے چشم پوشی اور درگزر فرمائے۔ یہ ہے وہ ادب جو اسلام میں بندے کو سکھایا گیا ہے۔ کسی انسان سے اللہ کے دین کی خواہ کیسی ہی بڑی سے بڑی خدمت انجام پائی ہو، اس کی راہ میں خواہ کتنی ہی قربانیاں اس نے دی ہوں اور اس کی عبادت و بندگی بجا لانے میں خواہ کتنی ہی جانفشانیاں اس نے کی ہوں، اس کے دل میں کبھی یہ خیال تک نہ آنا چاہیے کہ میرے اوپر میرے رب کا جو حق تھا وہ میں نے پورا کا پورا ادا کردیا ہے، بلکہ اسے ہمیشہ یہی سمجھنا چاہیے کہ جو کچھ مجھے کرنا چاہیے تھا وہ میں نہیں کرسکا، اور اسے اللہ سے یہی دعا مانگنی چاہیے کہ اس کا حق ادا کرنے میں جو کوتاہی بھی مجھ سے ہوئی ہو اس سے درگزر فرما کر میری حقیر سی خدمت قبول فرمالے۔ یہ ادب جب رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کو سکھایا گیا جن سے بڑھ کر خدا کی راہ میں سعی و جہد کرنے والے کسی انسان کا تصور تک نہیں کیا جاسکتا، تو دوسرے کسی کا یہ مقام کہاں ہوسکتا ہے کہ وہ اپنے عمل کو کوئی بڑا عمل سمجھے اور اس غرے میں مبتلا ہو کہ اللہ کا جو حق اس پر تھا وہ اس نے ادا کردیا ہے۔ اللہ کا حق اس سے بہت بالا و برتر ہے کہ کوئی مخلوق اسے ادا کرسکے۔\nاللہ تعالیٰ کا یہ فرمان مسلمان کو ہمیشہ کے لیے یہ سبق دیتا ہے کہ اپنی کسی عبادت و ریاضت اور کسی خدمت دین کو بڑی چیز نہ سمجھیں، بلکہ اپنی جان راہ خدا میں کھپا دینے کے بعد بھی یہی سمجھتے رہیں کہ \" حق تو یہ ہے کہ حق ادا نہ ہوا \"۔ اسی طرح جب کبھی انہیں کوئی فتح نصیب ہو، اسے اپنے کسی کمال کا نہیں بلکہ اللہ کے فضل ہی کا نتیجہ سمجھیں اور اس پر فخر و غرور میں مبتلا ہونے کے بجائے اپنے رب کے سامنے عاجزی کے ساتھ سر جھکا کر حمد و تسبیح اور توبہ و استغفار کریں۔",
    "Translation": "تو اپنے رب کی حمد کے ساتھ اُس کی تسبیح کرو، 3 اور اُس سے مغفرت کی دُعا مانگو، 4 بے شک وہ بڑا توبہ قبول کرنے والا ہے",
    "Words": " فَسَبِّحْ : پس پاکی بیان کریں   |   بِحَمْدِ : تعریف کے ساتھ   |   رَبِّكَ : اپنے رب کی   |   وَاسْتَغْفِرْهُ : اور بخشش طلب کیجئے اس سے   |   ڼ اِنَّهٗ كَانَ : بیشک وہ۔ ہے   |   تَوَّابًا : بڑا توبہ قبول کرنیوالا "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6325,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "تَبَّتْ يَدَآ اَبِيْ لَهَبٍ وَّتَبَّ",
    "AyahTextPdms": "تَبَّتۡ يَدَاۤ اَبِىۡ لَهَبٍ وَّتَبَّؕ",
    "AyahTextQalam": "تَبَّتْ یَدَاۤ اَبِیْ لَهَبٍ وَّ تَبَّؕ",
    "Id": 6326,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 36,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": "سورة اللھب   1\nاس شخص کا اصل نام عبدالعزیٰ تھا، اور اسے ابو لہب اس لیے کہا جاتا تھا کہ اس کا رنگ بہت چمکتا ہوا سرخ وسفید تھا۔ لہب آگ کے شعلے کو کہتے ہیں اور ابو لہب کے معنی ہیں شعلہ۔ یہاں اس کا ذکر اس کے نام کے بجائے اس کی کنیت سے کرنے کے کئی وجوہ ہیں۔ ایک یہ کہ وہ زیادہ تر اپنے نام سے نہیں بلکہ اپنی کنیت ہی سے معروف تھا۔ دوسرے یہ کہ اس کا نام عبدالعزیٰ (بندہ عزی) ایک مشرکانہ نام تھا اور قرآن میں یہ پسند نہیں کیا گیا کہ اسے اس نام سے یاد کیا جائے۔ تیسرے یہ کہ اس کا جو انجام اس سورة میں بیان کیا گیا ہے اس کے ساتھ اس کی یہ کنیت ہی زیادہ مناسبت رکھتی ہے۔\nتَبَّتْ يَدَآ اَبِيْ لَهَبٍ کے معنی بعض مفسرین نے \" ٹوٹ جائیں ابولہب کے ہاتھ \" بیان کیے ہیں اور وّتَبَّ کا مطلب یہ بیان کیا ہے کہ \" وہ ہلاک ہوجائے \" یا \" وہ ہلاک ہوگیا \"۔ لیکن درحقیقت یہ کوئی کوسنا نہیں ہے جو اس کو دیا گیا ہو، بلکہ ایک پیشینگوئی ہے جس میں آئندہ پیش آنے والی بات کو ماضی کے صیغوں میں بیان کیا گیا ہے، گویا اس کا ہونا ایسا یقینی ہے جیسے وہ ہوچکی۔ اور فی الواقع آخر کار وہی کچھ ہوا جو اس سورة میں چند سال پہلے بیان کیا جاچکا تھا۔ ہاتھ ٹوٹنے سے مراد ظاہر ہے کہ جسمانی ہاتھ ٹوٹنا نہیں ہے، بلکہ کسی شخص کا اپنے اس مقصد میں قطعی ناکام ہوجانا ہے جس کے لیے اس نے اپنا پورا زور لگا دیا ہو۔ اور ابو لہب نے رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی دعوت کو زک دینے کے لیے واقعی اپنا پورا زور لگا دیا تھا۔ لیکن اس سورة کے نزول پر سات آٹھ سال ہی گزرے تھے کہ جنگ بدر میں قریش کے اکثر و بیشتر وہ بڑے بڑے سردار مارے گئے جو اسلام کی دشمنی میں ابو لہب کے ساتھی تھے۔ مکہ میں جب اس شکست کی خبر پہنچی تو اس کو اتنا رنج ہوا کہ وہ سات دن سے زیادہ زندہ نہ رہ سکا۔ پھر اس کی موت بھی نہایت عبرتناک تھی۔ اسے عدسہ ( Malignant Pustule) کی بیماری ہوگئی جس کی وجہ سے اس کے گھر والوں نے اسے چھوڑ دیا، کیونکہ انہیں چھوت لگنے کا ڈر تھا۔ مرنے کے بعد بھی تین روز تک کوئی اس کے پاس نہ آیا یہاں تک کہ اس کی لاش سڑ گئی اور اس کی بو پھیلنے لگی۔ آخر کار جب لوگوں نے اس کے بیٹوں کو طعنے دینے شروع کیے تو ایک روایت یہ ہے کہ انہوں نے کچھ حبشیوں کو اجرت دے کر اس کی لاش اٹھوائی اور انہی مزدوروں نے اس کو دفن کیا۔ اور دوسری روایت یہ ہے کہ انہوں نے ایک گڑھا کھدوایا اور لکڑیوں سے اس کی لاش کو دھکیل کر اس میں پھینکا اور اوپر سے مٹی پتھر ڈال کر اسے ڈھانک دیا۔ اس کی مزید اور مکمل شکست اس طرح ہوئی کہ جس دین کی راہ روکنے کے لیے اس نے ایڑی چوٹی کا زور لگا دیا تھا، اسی دین کو اس کی اولاد نے قبول کیا۔ سب سے پہلے اس کی بیٹی درہ ہجرت کر کے مکہ سے مدینہ پہنچیں اور اسلام لائیں، پھر فتح مکہ پر اس کے دونوں بیٹے عتبہ اور معتب حضرت عباس کی وساطت سے حضور کے سامنے پیش ہوئے اور ایمان لاکر انہوں نے آپ کے دست مبارک پر بیعت کی۔",
    "Translation": "ٹوٹ گئے ابو لہب کے ہاتھ اور نامراد ہوگیا وہ۔ 1",
    "Words": " تَبَّتْ : ٹوٹ گئے   |   يَدَآ : دونوں ہاتھ   |   اَبِيْ لَهَبٍ : ابولہب   |   وَّتَبَّ : اور وہ ہلاک ہوا "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "مَآ اَغْنٰى عَنْهُ مَالُهٗ وَمَا كَسَبَ",
    "AyahTextPdms": "مَاۤ اَغۡنٰى عَنۡهُ مَالُهٗ وَمَا كَسَبَؕ",
    "AyahTextQalam": "مَاۤ اَغْنٰى عَنْهُ مَالُهٗ وَ مَا كَسَبَؕ",
    "Id": 6327,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 36,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": "سورة اللھب   2\nابو لہب سخت بخیل اور زرپرست آدمی تھا۔ ابن اثیر کا بیان ہے کہ زمانہ جاہلیت میں ایک مرتبہ اس پر یہ الزام بھی لگایا گیا تھا کہ اس نے کعبہ کے خزانے میں سے سونے کے دو ہرن چرا لیے ہیں۔ اگرچہ بعد میں وہ ہرن ایک اور شخص کے پاس سے برآمد ہوئے، لیکن بجائے خود یہ بات کہ اس پر یہ الزام لگایا گیا، یہ ظاہر کرتی ہے کہ مکہ کے لوگ اس کے بارے میں کیا رائے رکھتے تھے۔ اس کی مالداری کے متعلق قاضی رشید بن زبیر اپنی کتاب الذخائر والحف میں لکھتے ہیں کہ وہ قریش کے ان چار آدمیوں میں سے ایک تھا جو ایک قنطار سونے کے مالک تھے (قنطار دو سو اوقیہ کا اور ایک اوقیہ سوا تین تولہ کا ہوتا ہے) اس کی زرپرستی کا اندازہ اس امر سے کیا جاسکتا ہے کہ جنگ بدر کے موقع پر جبکہ اس کے مذہب کی قسمت کا فیصلہ ہونے والا تھا، قریش کے تمام سردار لڑنے کے لیے گئے، مگر اس نے عاص بن ہشام کو اپنی طرف سے لڑنے کے لیے بھیج دیا اور کہا کہ یہ اس چار ہزار درہم قرض کا بدل ہے جو میرا تم پر آتا ہے۔ اس طرح اس نے اپنا قرض وصول کرنے کی بھی ایک ترکیب نکال لی، کیونکہ عاص دیوالیہ ہوچکا تھا اور اس سے رقم ملنے کی کوئی امید نہ تھی۔\nمَا كَسَبَ کو بعض مفسرین نے کمائی کے معنی میں لیا ہے، یعنی اپنے مال سے جو منافع اس نے حاصل کیے وہ اس کا کسب تھے۔ اور بعض دوسرے مفسرین نے اس سے مراد اولاد لی ہے، کیونکہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے فرمایا ہے کہ آدمی کا بیٹا بھی اس کا کسب ہے (ابو داؤد۔ ابن ابی حاتم) یہ دونوں معنی ابو لہب کے انجام سے مناسبت رکھتے ہیں۔ کیونکہ جب وہ عدسہ کے مرض میں مبتلا ہوا تو اس کا مال بھی اس کے کسی کام نہ آیا اور اس کی اولاد نے بھی اسے بےکسی کی موت مرنے کے لیے چھوڑ دیا۔ اس کا جنازہ تک عزت کے ساتھ اٹھانے کی اس اولاد کو توفیق نہ ہوئی۔ اس طرح چند ہی سال کے اندر لوگوں نے اس پیشینگوئی کو پورا ہوتے دیکھ لیا جو ابولہب کے متعلق اس سورة میں کی گئی تھی۔",
    "Translation": "اُس کا مال اور جو کچھ اس نے کمایا وہ اُس کے کسی کام نہ آیا۔ 2",
    "Words": " مَآ اَغْنٰى: نہ کام آیا   |   عَنْهُ : اس کے   |   مَالُهٗ : اس کا مال   |   وَمَا كَسَبَ : اور جو اس نے کمایا "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "سَيَصْلٰى نَارًا ذَاتَ لَهَبٍ",
    "AyahTextPdms": "سَيَصۡلٰى نَارًا ذَاتَ لَهَبٍ",
    "AyahTextQalam": "سَیَصْلٰى نَارًا ذَاتَ لَهَبٍۚۖ",
    "Id": 6328,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 36,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": "",
    "Translation": "ضرور وہ شعلہ زن آگ میں ڈالا جائے گا",
    "Words": " سَيَصْلٰى: عنقریب داخل ہوگا   |   نَارًا : آگ   |   ذَاتَ لَهَبٍ : شعلے مارتی "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "وَّامْرَاَتُهٗ    ۭ حَمَّالَةَ الْحَطَبِ",
    "AyahTextPdms": "وَّامۡرَاَ تُهٗ ؕ حَمَّالَةَ الۡحَطَبِ‌ۚ‏",
    "AyahTextQalam": "وَّ امْرَاَتُهٗ١ؕ حَمَّالَةَ الْحَطَبِۚ",
    "Id": 6329,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 36,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": "سورة اللھب   3\nاس عورت کا نام ارویٰ تھا اور ام جمیل اس کی کنیت تھی۔ یہ ابو سفیان کی بہن تھی اور رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے ساتھ عداوت میں اپنے شوہر ابولہب سے کسی طرح کم نہ تھی۔ حضرت ابوبکر کی صاحبزادی حضرت اسماء کا بیان ہے کہ جب یہ سورت نازل ہوئی اور ام جمیل نے اس کو سنا تو وہ بپھری ہوئی رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی تلاش میں نکلی۔ اس کے ہاتھ میں مٹھی بھر پتھر تھے اور وہ حضور کی ہجو میں اپنے ہی کچھ اشعار پڑھتی جاتی تھی۔ حرم میں پہنچی تو وہاں حضرت ابوبکر کے ساتھ حضور تشریف فرما تھے۔ حضرت ابوبکر نے عرض کیا یا رسول اللہ، یہ آرہی ہے اور مجھے اندیشہ ہے کہ آپ کو دیکھ کر یہ کوئی بیہودگی کرے گی۔ حضور نے فرمایا یہ مجھ کو نہیں دیکھ سکے گی۔ چناچہ ایسا ہی ہوا کہ آپ کے موجود ہونے کے باوجود وہ آپ کو نہیں دیکھ سکی اور اس نے حضرت ابوبکر سے کہا کہ میں نے سنا ہے تمہارے صاحب نے میری ہجو کی ہے۔ حضرت ابوبکر نے کہا، اس گھر کے رب کی قسم انہوں نے تو تمہاری کوئی ہجو نہیں کی۔ اس پر وہ واپس چلی گئی (ابن ابی حاتم۔ سیرۃ ابن ہشام۔ بزار نے حضرت عبداللہ بن عباس سے بھی اسی سے ملتا جلتا واقعہ نقل کیا ہے) حضرت ابوبکر کے اس جواب کا مطلب یہ تھا کہ ہجو تو اللہ تعالیٰ نے کی ہے، رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے نہیں کی۔\n سورة اللھب   4\nاصل الفاظ ہیں حَمَّالَةَ الْحَطَبِ جن کا لفظی ترجمہ ہے \" لکڑیاں ڈھونے والی \" مفسرین نے اس کے متعدد معنی بیان کیے ہیں۔ حضرت عبداللہ بن عباس، ابن زید، ضحاک اور بعی بن انس (رض) کہتے ہیں کہ وہ راتوں کو خاردار درختوں کی ٹہنیاں لاکر رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کے دروازے پر ڈال دیتی تھی، اس لیے اس کو لکڑیاں ڈھونے والی کہا گیا ہے۔ قتادہ، عکرمہ، حسن بصری، مجاہد اور سفیان ثوری (رض) کہتے ہیں کہ وہ لوگوں میں فساد ڈلوانے کے لیے چغلیاں کھاتی پھرتی تھی، اس لیے اسے عربی محاورے کے مطابق لکڑیاں ڈھونے والی کہا گیا، کیونکہ عرب ایسے شخص کو جو ادھر کی بات ادھر لگا کر فساد کی آگ بھڑکانے کی کوشش کرتا ہو، لکڑیاں ڈھونے والا کہتے ہیں۔ اس محاورے کے لحاظ سے حَمَّالَةَ الْحَطَبِ معنی ٹھیک ٹھیک وہی ہیں جو اردو میں \" بی جمالو \" کے معنی ہیں۔ سعید بن جبیر کہتے ہیں کہ جو شخص گناہوں کا بوجھ اپنے اوپر لاد رہا ہو اس کے متعلق عربی زبان میں بطور محاورہ کہا جاتا ہے فلان یحتطب علی ظھرہ۔ \" فلاں شخص اپنی پیٹھ پر لکڑیاں لاد رہا ہے \"۔ پس حَمَّالَةَ الْحَطَبِ کے معنی ہیں گناہوں کا بوجھ ڈھونے والی۔ ایک اور مطلب مفسرین نے اس کا یہ بھی بیان کیا ہے کہ یہ آخرت میں اس کا حال ہوگا، یعنی وہ لکڑیاں لا لا کر اس آگ میں ڈالے گی جس میں ابو لہب جل رہا ہوگا۔",
    "Translation": "اور (اُس کے ساتھ) اُس کی جورُو بھی، 3 لگائی بُجھائی کرنے والی، 4",
    "Words": "  وَّامْرَاَتُهٗ : اور اس کی بیوی   |   ۭ حَمَّالَةَ : لادنے والی   |   الْحَطَبِ : لکڑی (ایندھن)"
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "فِيْ جِيْدِهَا حَبْلٌ مِّنْ مَّسَدٍ",
    "AyahTextPdms": "فِىۡ جِيۡدِهَا حَبۡلٌ مِّنۡ مَّسَدٍ",
    "AyahTextQalam": "فِیْ جِیْدِهَا حَبْلٌ مِّنْ مَّسَدٍ۠",
    "Id": 6330,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 36,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "المسد",
    "SurahNameEnglish": "Al-Masad",
    "SurahNumber": 111,
    "Tafseer": "سورة اللھب   5\nاس کی گردن کے لیے جید کا لفظ استعمال کیا گیا ہے جو عربی زبان میں ایسی گردن کے لیے بولا جاتا ہے جس میں زیور پہنا گیا ہو۔ سعید بن المسیب، حسن بصری اور قتادہ (رض) کہتے ہیں کہ وہ ایک بہت قیمتی ہار گردن میں پہنتی تھی، اور کہا کرتی تھی کہ لات اور عزی کی قسم میں اپنا یہ ہار بیچ کر اس کی قمت محمد (صلی اللہ علیہ وآلہ وسلم) کی عداوت میں خرچ کردوں گی۔ اسی بنا پر جید کا لفظ یہاں بطور طنز استعمال کیا گیا ہے کہ اس مزین گلے میں جس کے ہار پر وہ فخر کرتی ہے، دوزخ میں رسی پڑی ہوگی۔ یہ اسی طرح کا طنزیہ انداز کلام ہے جیسے قرآن مجید میں متعدد مقامات پر فرمایا گیا ہے فَبَشِّرْهُمْ بِعَذَابٍ اَلِيْمٍ \" ان کو درد ناک عذاب کی خوشخبری دے دو ۔ \nجو رسی اس کی گردن میں ڈالی جائے گی اس کے لیے حَبْلٌ مِّنْ مَّسَدٍ کے الفاظ استعمال کیے ہیں، یعنی وہ رسی مسد کی قسم سے ہوگی۔ اس کے مختلف معنی اہل لغت اور مفسرین نے بیان کیے ہیں۔ ایک قول یہ ہے کہ خوب مضبوط بٹی ہوئی رسی کو مسد کہتے ہیں۔ دوسرا قول یہ ہے کہ کھجور کی چھال سے بنی ہوئی رسی کے لیے یہ لفظ بولا جاتا ہے۔ تیسرا قول یہ ہے کہ اس کے معنی ہیں مونجھ کی رسی یا اونٹ کی کھال یا اس کے صوف سے بنی ہوئی رسی۔ اور ایک قول یہ بھی ہے کہ اس سے مراد لوہے کے تاروں سے بٹی ہوئی رسی ہے۔",
    "Translation": "اُس کی گردن میں مونجھ کی رسّی ہو گی۔ 5",
    "Words": " فِيْ : میں   |   جِيْدِهَا : اس کی گردن   |   حَبْلٌ: رسی   |   مِّنْ : سے   |   مَّسَدٍ : کھجور "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6331,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الإخلاص",
    "SurahNameEnglish": "Al-Ikhlaas",
    "SurahNumber": 112,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "قُلْ هُوَ اللّٰهُ اَحَدٌ",
    "AyahTextPdms": "قُلۡ هُوَ اللّٰهُ اَحَدٌ‌",
    "AyahTextQalam": "قُلْ هُوَ اللّٰهُ اَحَدٌۚ",
    "Id": 6332,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 37,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الإخلاص",
    "SurahNameEnglish": "Al-Ikhlaas",
    "SurahNumber": 112,
    "Tafseer": "سورة الاخلاص   1\nاس حکم کے اولین مخاطب تو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) ہیں، کیونکہ آپ ہی سے یہ سوال کیا گیا تھا کہ آپ کا رب کون اور کیسا ہے، اور آپ ہی کو حکم دیا گیا کہ اس سوال کے جواب میں آپ یہ کہیں۔ لیکن حضور کے بعد ہر مومن اس کا مخاطب ہے۔ اسے بھی وہی بات کہنی چاہیے جس کے کہنے کا حکم حضور کو دیا گیا تھا۔\n سورة الاخلاص   2\nیعنی میرے جس رب سے تم تعارف حاصل کرنا چاہتے ہو وہ کوئی اور نہیں بلکہ اللہ ہے۔ یہ ان سوال کرنے والوں کی بات کا پہلا جواب ہے، اور اس کا مطلب یہ ہے کہ میں کوئی نیا رب لے کر نہیں آگیا ہوں جس کی عبادت دوسرے سب معبودوں کو چھوڑ کر میں تم سے کروانا چاہتا ہوں، بلکہ وہ وہی ہستی ہے جس کو تم اللہ کے نام سے جانتے ہو۔ \" اللہ \" عربوں کے لیے کوئی اجنبی لفظ نہ تھا۔ قدیم ترین زمانے سے وہ خالق کائنات کے لیے یہی استعمال کر رہے تھے اور اپنے دوسرے معبودوں میں سے کسی پر بھی اس کا اطلاق نہیں کرتے تھے۔ دوسرے معبودوں کے لیے ان کے ہاں الہ کا لفظ رائج تھا۔ پھر اللہ کے بارے میں ان کے جو عقائد تھے ان کا اظہار اس موقع پر خوب کھل کر ہوگیا تھا جب ابرھہ نے مکہ پر چڑھائی کی تھی۔ اس وقت خانہ کعبہ میں 360 الہوں کے بت موجود تھے، مگر مشرکین نے ان سب کو چھوڑ کر صرف اللہ سے دعائیں مانگی تھیں کہ وہ اس بلا سے ان کو بچائے۔ گویا وہ اپنے دلوں میں اچھی طرح جانتے تھے کہ اللہ کے سوا کوئی اس نازک وقت میں ان کی مدد نہیں کرسکتا۔ کعبے کو بھی وہ ان الہوں کی نسبت سے بیت الآلہہ نہیں، بلکہ اللہ کی نسبت سے بیت اللہ کہتے تھے۔ قرآن میں جگہ جگہ یہ بتایا گیا ہے کہ اللہ تعالیٰ کے بارے میں مشرکین عرب کا عقیدہ کیا تھا، مثال کے طور پر \n سورة زخرف میں ہے  \" اگر تم ان سے پوچھو کہ انہیں کس نے پیدا کیا ہے تو یہ ضرور کہیں گے کہ اللہ نے \" (آیت 87)\n سورة عنکبوت میں ہے  \" اگر تم سے ان سے پوچھو کہ آسمانوں اور زمین کو کس نے پیدا کیا ہے اور چاند اور سورج کو کس نے مسخر کر رکھا ہے، تو یہ ضرور کہیں گے کہ اللہ نے۔ اور اگر تم ان سے پوچھو کہ کس نے آسمان سے پانی برسایا اور اس کے ذریعہ سے مردہ پڑی ہوئی زمین کو جلا اٹھایا، تو یہ ضرور کہیں گے کہ اللہ نے  (آیات 61 تا 63)\n سورة مومنون میں ہے  \" ان سے کہو بتاؤ اگر تم جانتے ہو کہ یہ زمین اور اس کی ساری آبادی کس کی ہے ؟ یہ ضرور کہیں گے اللہ کی۔ ان سے پوچھو ساتوں آسمانوں اور عرش عظیم کا مالک کون ہے ؟ یہ ضرور کہیں گے اللہ۔ ان سے کہو، بتاؤ اگر تم جانتے ہو کہ ہر چیز پر اقتدار کس کا ہے ؟ اور کون ہے وہ جو پناہ دیتا ہے اور اس کے مقابلے میں کوئی پناہ نہیں دے سکتا۔ یہ ضرور جواب دیں گے کہ یہ بات تو اللہ ہی کے لیے ہے \"۔ (آیات 84 تا 89)\n سورة یونس میں ایک اور جگہ ہے  ان سے پوچھو، کون تم کو آسمان اور زمین سے رزق دیتا ہے ؟ یہ سماعت اور بینائی کی قوتیں جو تمہیں حاصل ہیں کس کے اختیار میں ہیں ؟ اور کون زندہ کو مردہ سے اور مردہ کو زندہ سے نکالتا ہے ؟ اور کون اس نظم عالم کی تدبیر کر رہا ہے ؟ یہ ضرور کہیں گے کہ اللہ \" (آیت 31)\nاسی سورة یونس میں ایک اور جگہ ہے  \" جب تم لوگ کشتیوں پر سوار ہو کر باد موافق پر فرحان و شاداں سفر کر رہے ہوتے ہو اور پھر یکایک باد مخالف کا زور ہوتا ہے اور ہر طرف سے موجوں کے تھپیڑے لگتے ہیں اور مسافر سمجھ لیتے ہیں کہ طوفان میں گھر گئے، اس وقت سب اپنے دین کو اللہ ہی کے لیے خالص کر کے اس سے دعائیں مانگتے ہیں کہ اگر تو نے ہمیں اس بلا سے نجات دے دی تو ہم شکر گزار بندے بنیں گے۔ مگر جب وہ ان کو بچا لیتا ہے تو پھر وہی لوگ حق سے منحرف ہو کر زمین میں بغاوت کرنے لگتے ہیں \" (آیات 22 ۔ 23)\nیہی بات سورة بنی اسرائیل میں یوں دہرائی گئی ہے  \" جب سمندر میں تم پر مصیبت آتی ہے تو اس ایک کے سوا دوسرے جن جن کو تم پکارا کرتے ہو وہ سب گم ہوجاتے ہیں، مگر جب وہ تم کو بچا کر خشکی پر پہنچا دیتا ہے تو تم اس سے منہ موڑ جاتے ہو \" (آیت 67)\nان آیات کو نگاہ میں رکھ کر دیکھیے کہ جب لوگوں نے پوچھا کہ وہ تمہارا کون ہے اور کیسا ہے جس کی بندگی و عبادت کی طرف تم ہمیں بلاتے ہو، تو انہیں جواب دیا گیا هُوَ اللّٰهُ ، وہ اللہ ہے۔ اس جواب سے خود بخود یہ مطلب نکلتا ہے کہ جسے تم خود اپنا اور ساری کائنات کا خالق، مالک، رازق اور مدبر و منتظم مانتے ہو، اور سخت وقت آنے پر جسے دوسرے سب معبودوں کو چھوڑ کر مدد کے لیے پکارتے ہو، وہی میرا رب ہے اور اسی کی بندگی کی طرف میں تمہیں بلاتا ہوں، اس جواب میں اللہ تعالیٰ کی تمام صفات کمالیہ آپ سے آپ آجاتی ہیں۔ اس لیے کہ یہ بات سرے سے قابل تصور ہی نہیں ہے کہ کائنات کو پیدا کرنے والا، اس کا انتظام اور اس کے معاملات کی تدبیر کرنے والا، اس میں پائی جانے والی تمام مخلوقات کو رزق دینے والا، اور مصیبت کے وقت اپنے بندوں کی مدد کرنے والا، زندہ نہ ہو، سنتا اور دیکھتا نہ ہو، قادر مطلق نہ ہو، علیم اور حکیم نہ ہو، رحیم اور کریم نہ ہو، اور سب پر غالب ہو۔ \n سورة الاخلاص   3\nنحوی قواعد کی رو سے علماء نے هُوَ اللّٰهُ اَحَدٌ کی متعدد ترکیبیں بیان کی ہیں، مگر ہمارے نزدیک ان میں سے جو ترکیب اس مقام کے ساتھ پوری مناسبت رکھتی ہے وہ یہ ہے کہ ھُوَ مبتداء ہے، اللہ اس کی خبر ہے اور اَحَدٌ اس کی دوسری خبر، اس ترکیب کے لحاظ سے اس جملے کا مطلب یہ ہے کہ \" وہ (جس کے بارے میں تم لوگ سوال کر رہے ہو) اللہ ہے، یکتا ہے \" دوسرا مطلب یہ بھی ہوسکتا ہے، اور زبان کے لحاظ سے غلط نہیں ہے کہ \" وہ اللہ ایک ہے \"۔\nیہاں سب سے پہلے یہ بات سمجھ لینی چاہیے کہ اس جملہ میں اللہ تعالیٰ کے لیے لفظ احد جس طرح استعمال کیا گیا ہے وہ عربی زبان میں اس لفظ کا غیر معمولی استعمال ہے۔ معمولا یہ لفظ یا تو مضاف یا مضاف الیہ کے طور پر استعمال ہوتا ہے، جیسے یوم الاحد، ہفتے کا پہلا دن، اور فابْعَثُوْٓا اَحَدَكُمْ \" اپنے کسی آدمی کو بھیجو \" یا نفی عام کے لیے استعمال ہوتا ہے جیسے ما جاءنی احد \" میرے پاس کوئی نہیں آیا \"۔ یا عمومیت کا پہلو لیے ہوئے سوالیہ فقرے میں بولا جاتا ہے، جیسے ھل عندک احد ؟ \" کیا تمہارے پاس کوئی ہے \"؟ یا اسی عمومیت کے پہلو سے شرطیہ جملہ میں بولا جاتا ہے، جیسے ان جاءک احد، \" اگر تمہارے پاس کوئی آئے \"۔ یا گنتی میں بولا جاتا ہے، جیسے احد، اثنان، احد عشر، ایک، دو گیا رہ، ان استعمالات کے سوا نزول قرآن سے پہلے کی عربی زبان میں اس امر کی کوئی نظیر نہیں ملتی کہ محض احد وصف کے طور پر کسی شخص یا چیز کے لیے بولا گیا ہو، اور نزول قرآن کے بعد یہ لفظ صرف اللہ تعالیٰ کی ذات کے لیے استعمال کیا گیا ہے، دوسرے کسی کے لیے کبھی استعمال نہیں کیا گیا۔ اس غیر معمولی طرز بیان سے خودبخود یہ ظاہر ہوتا ہے کہ یکتا و یگانہ ہونا اللہ کی خاص صفت ہے، موجودات میں سے کوئی دوسرا اس صفت سے متصف نہیں ہے، وہ ایک ہے، کوئی اس کا ثانی نہیں۔\nپھر جو سوالات مشرکین اور اہل کتاب نے رسول اللہ (صلی اللہ علیہ وآلہ وسلم) سے آپ کے رب کے بارے میں کیے تھے ان کو نگاہ میں رکھتے ہوئے دیکھیے کہ هُوَ اللّٰهُ کہنے کے بعد اَحَدٌ کہہ کر ان کا جواب کس طرح دیا گیا ہے \nاولا، اس کے معنی یہ ہیں کہ وہی اکیلا رب ہے، کسی دوسرے کا ربوبیت میں کوئی حصہ نہیں ہے، اور چونکہ الہ (معبود) وہی ہوسکتا ہے جو رب ( مالک و پروردگار) ہو، اس لیے الوہیت میں بھی کوئی اس کا شریک نہیں۔\nثانیا۔ اس کے معنی یہ بھی ہیں کہ وہی تنہا کائنات کا خالق ہے، تخلیق کے اس کام میں کوئی اور اس کا شریک نہیں ہے۔ وہی اکیلا مالک الملک ہے، نظام عالم کا مدبر و منتظم ہے، اپنی مخلوق کا رزق رساں ہے، اور آڑے وقت میں مدد کرنے والا فریاد رس ہے، خدائی کے ان کاموں میں، جن کو تم خود مانتے ہو کہ یہ اللہ کے کام ہیں، کسی دوسرے کا قطعا کوئی حصہ نہیں ہے۔\nثالثا۔ چونکہ انہوں نے یہ بھی پوچھا تھا کہ وہ کس چیز سے بنا ہے ؟ اس کا نسب کیا ہے ؟ وہ کس جنس سے ہے ؟ کس سے اس نے دنیا کی میراث پائی ہے ؟ اور اس کے بعد کون اس کا وارث ہوگا ؟ اس لیے ان کو ان سارے سوالات کا جواب بھی اللہ تعالیٰ کے لیے صرف ایک لفظ اَحَد بول کر دے دیا گیا ہے۔ اس کے معنی یہ ہیں کہ (١) وہی ایک خدا ہمیشہ سے ہے اور ہمیشہ رہے گا، نہ اس سے پہلے کوئی خدا تھا، نہ اس کے بعد کوئی خدا ہوگا (٢) خداؤں کی کوئی جنس نہیں ہے جس کا وہ فرد ہو، بلکہ وہ اکیلا خدا ہے اور کوئی اس کا ہم جنس نہیں (٣) اس کی ذات محض واحد نہیں بلکہ اَحَد ہے جس میں کسی حیثیت سے بھی کثرت کا کوئی شائبہ نہیں ہے، وہ اجزاء سے مرکب وجود نہیں ہے جو قابل تجزیہ و تقسیم ہو، جو کوئی شکل و صورت رکھتا ہو، جو کسی جگہ میں رہتا ہو یا کوئی چیز اس کے اندر جگہ پاتی ہو، جس کا کوئی رنگ ہو، جس کے کچھ اعضا ہوں، جس کی کوئی سمت اور جہت ہو، اور جس کے اندر کسی قسم کا تغیر و تبدل ہوتا ہو۔ تمام اقسام کی کثرتوں سے بالکل پاک اور منزہ وہ ایک ہی ذات ہے جو ہر لحاظ سے اَحَد ہے۔ اس مقام پر یہ بات اچھی طرح سمجھ لینی چاہیے کہ عربی زبان میں \" واحد \" کا لفظ بالکل اسی طرح استعمال ہوتا ہے جس طرح ہم اردو میں \" ایک \" کا لفظ استعمال کرتے ہیں۔ بڑی سے بڑی کثرتوں پر مشتمل کسی مجموعہ کو بھی اس کی مجموعی حیثیت کے لحاظ سے واحد یا ایک کہا جاتا ہے، جیسے ایک آدمی، ایک قوم، ایک ملک، ایک دنیا، حتی کہ ایک کائنات، اور کسی مجموعہ کے ہر جز کو الگ الگ بھی ایک ہی کہا جاتا ہے۔ لیکن اَحَد کا لفظ اللہ تعالیٰ کے سوا کسی کے لیے استعمال نہیں کیا جاتا۔ اسی لیے قرآن مجید میں جہاں بھی اللہ تعالیٰ کے لیے واحد کا لفظ استعمال ہوا ہے وہاں الہ واحد، ایک ہی معبود، یا اللہ الواحد القھار، اکیلا اللہ جو سب کو مغلوب کر کے رکھنے والا ہے، کہا گیا ہے۔ محض واحد نہیں کہا گیا، کیونکہ یہ لفظ ان چیزوں کے لیے بھی استعمال ہوتا ہے جو اپنی ذات میں طرح طرح کی کثرتیں رکھتی ہیں، بخلاف اس کے اللہ کے لیے اور صرف اللہ ہی کے لیے احد کا لفظ مطلقا استعمال کیا گیا ہے، کیونکہ وجود میں صرف وہی ایک ہستی ایسی ہے جس میں کسی حیثیت سے بھی کوئی کثرت نہیں ہے، جس کی وحدانیت ہر لحاظ سے کامل ہے) ۔",
    "Translation": "کہو، 1 وہ اللہ ہے، 2 یَکتا۔ 3",
    "Words": " قُلْ : کہدیجئے   |   هُوَ : وہ   |   اللّٰهُ : اللہ   |   اَحَدٌ : ایک "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "اَللّٰهُ الصَّمَدُ",
    "AyahTextPdms": "اَللّٰهُ الصَّمَدُ‌",
    "AyahTextQalam": "اَللّٰهُ الصَّمَدُۚ",
    "Id": 6333,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 37,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الإخلاص",
    "SurahNameEnglish": "Al-Ikhlaas",
    "SurahNumber": 112,
    "Tafseer": "سورة الاخلاص   4\nاصل میں لفظ صَمَد استعمال کیا گیا ہے جس کا مادہ ص، م، د ہے۔ عربی زبان میں اس مادے سے جو الفاظ نکلے ہیں ان پر ایک نگاہ ڈالنے سے معلوم ہوجاتا ہے کہ اس کے معانی کی وسعت کس قدر ہے ۔\nاَلصَّمدُ ۔ قصد کرنا، بلند مقام جو بڑی ضخامت رکھتا ہو، سطح مرتفع، وہ آدمی جسے جنگ میں بھوک پیاس نہ لگتی ہو، وہ سردار جس کی طرف حاجات میں رجوع کیا جاتا ہو۔ \nاَلصَّمَدُ ۔ ہر چیز کا بلند حصہ، وہ شخص جس سے بالا تر کوئی دوسرا شخص نہ ہو، وہ سردار جس کی اطاعت کی جاتی ہو اور اس کے بغیر کسی معاملہ کا فیصلہ نہ کیا جاتا ہو، وہ سردار جس کی طرف حاجتمند لوگ رجوع کرتے ہوں، دائم، بلند مرتبہ، ٹھوس جس میں کوئی خول یا جھول نہ ہو، اور جس سے نہ کوئی چیز نکلتی ہو نہ اس میں داخل ہوسکتی ہو، وہ آدمی جسے جنگ میں بھوک پیاس نہ لگتی ہو۔ \nاَلمُصمَدُ ۔ ٹھوس چیز جس کا کوئی جوف نہ ہو۔ \nاَلمُصَمَّدُ ۔ مقصود جس کی طرف جانے کا قصد کیا جائے، سخت چیز جس میں کوئی کمزوری نہ ہو۔ \nبَیتٌ مُصَمَّدٌ۔ وہ گھر جس کی طرف حاجات میں رجوع کیا جاتا ہو۔ \nبِنَاءٌ مُّصمَدٌ۔ بلند عمارت۔\nصَمَدَہٗ وَ صَمَدَ اِلَیہِ صَمدًا۔ اس شخص کی طرف جانے کا قصد کیا۔\nاَصمَدَ اِلَیہ الاَمرَ ۔ اس کے سپرد معاملہ کردیا، اس کے آگے معاملہ پیش کردیا، اس کے آگے معاملہ پیش کردیا، اس کے اوپر معاملہ میں اعتماد کیا۔ (صحاح، قاموس، لسان العرب)\nان لغوی معنوں کی بنا پر آیت اللّٰهُ الصَّمَدُ میں لفظ الصَّمَدُ کی جو تفسیریں صحابہ وتابعین اور بعد کے اہل علم سے منقول ہیں انہیں ہم ذیل میں درج کرتے ہیں \nحضرت علی، عکرمہ اور کعب احبا  صَمَد وہ ہے جس سے بالا تر کوئی نہ ہو۔ \nحضرت عبداللہ بن مسعود، حضرت عبداللہ بن عباس اور ابو وائل شقیق بن سلمہ  \" وہ سردار جس کی سیادت کامل ہو اور انتہا کو پہنچی ہوئی ہو \"۔\nابن عباس کا دوسرا قول  \" صمد وہ ہے جس کی طرف لوگ کسی بلا یا مصیبت کے نازل ہونے پر مدد کے لیے رجوع کریں \"۔ ان کا ایک اور قول \" وہ سردار جو اپنی سیادت میں، اپنے شرف میں، اپنی عظمت میں، اپنے حلم اور بردباری میں، اپنے علم میں اور اپنی حکمت میں کامل ہو \"\nحضرت ابوہریرہ  \" وہ جس میں سے نہ کوئی چیز کبھی نکلی ہو نہ نکلتی ہو \"۔ جو نہ کھاتا ہو نہ پیتا ہو \"۔ اسی کے ہم معنی اقوال شعبی اور محمد بن کعب القرظی سے بھی منقول ہیں۔\nسدی۔ \" مطلوب چیزیں حاصل کرنے کے لیے لوگ جس کا قصد کریں اور مصائب میں مدد کے لیے جس کی طرف رجوع نہ کریں \"۔\nسعید بن جبیر  \" وہ جو اپنی تمام صفات اور اعمال میں کامل ہو \"۔\nربیع بن انس  \" وہ جس پر کوئی آفت نہ آتی ہو \"۔\nمقاتل بن حیان  \" وہ جو بےعیب ہو \"۔\nابن کیسان  \" وہ جس کی صفت سے کوئی دوسرا متصف نہ ہو \"۔\nحسن بصری اور قتادہ  \" جو باقی رہنے والا اور لازوال ہو \" اسی سے ملتے جلتے اقوال مجاہد اور معمر اور مرۃ الہمدانی سے بھی منقول ہیں۔\nمرۃ الہمدانی کا ایک اور قول یہ ہے کہ \" وہ جو اپنی مرضی کے مطابق جو چاہے فیصلہ کرے اور جو کام چاہے کرے، اس کے حکم اور فیصلے پر نظر ثانی کرنے والا کوئی نہ ہو \"۔\nابراہیم نخعی  \" وہ جس کی طرف لوگ اپنی حاجتوں کے لیے رجوع کریں \"۔\nابوبکر الانباری  \" اہل لغت کے درمیان اس میں کوئی اختلاف نہیں ہے کہ صَمَد اس سردار کو کہتے ہیں جس سے بالا تر کوئی اور سردار نہ ہو، اور جس کی طرف لوگ اپنی حاجات اور اپنے معاملات میں رجوع کریں \"۔ اسی کے قریب الزجاج کا قول ہے۔ وہ کہتے ہیں کہ \" صَمَد وہ ہے جس پر سرداری ختم ہوگئی ہو اور ہر ایک اپنی حاجات کے لیے جس کی طرف رجوع کرے \"۔\nاب غور کیجیے کہ پہلے فقرے میں اللّٰهُ اَحَدٌ کیوں کہا گیا، اور اس فقرے میں اللّٰهُ الصَّمَدُ کہنے کی کیا وجہ ہے۔ لفظ اَحَدٌ کے متعلق ہم بیان کرچکے ہیں کہ وہ صرف اللہ تعالیٰ کے لیے مخصوص ہے، کسی اور کے لیے سرے سے مستعمل ہی نہیں ہے، اس لیے اسے اَحَدٌ، یعنی نکرہ کی صورت میں استعمال کیا گیا ہے، لیکن صَمَد کا لفظ چونکہ مخلوقات کے لیے بھی استعمال ہوتا ہے، اس لیے اللہ صمد کہنے کے بجائے اَللّٰهُ الصَّمَدُ کہا گیا، جس کے معنی یہ ہیں کہ اصلی اور حقیقی صَمَد اللہ تعالیٰ ہی ہے۔ مخلوق اگر کسی حیثیت سے صمد ہو بھی تو کسی دوسری حیثیت سے وہ صمد نہیں ہے، کیونکہ وہ فانی ہے، لازوال نہیں ہے، قابل تجزیہ و تقسیم ہے، مرکب ہے، کسی وقت اس کے اجزاء بکھر سکتے ہیں، بعض مخلوقات اس کی محتاج ہیں تو بعض کا وہ خود محتاج ہے، اس کی سیادت اضافی ہے نہ کہ مطلق، کسی کے مقابلے میں وہ برتر ہے تو اس کے مقابلے میں کوئی اور برتر ہے، بعض مخلوقات کی بعض حاجات کو وہ پورا کرسکتا ہے، مگر سب کی تمام حاجات کو پورا کرنا کسی مخلوق کے بس میں نہیں ہے۔ بخلاف اس کے اللہ تعالیٰ کی صمدیت ہر حیثیت سے کامل ہے۔ ساری دنیا اس کی محتاج ہے اور وہ کسی کا محتاج نہیں۔ دنیا کی ہر اچیز اپنے وجود بقا اور اپنی حاجات و ضروریات کے لیے شعوری طور پر یا غیر شعوری طور پر اسی کی طرف رجوع کرتی ہے اور سب کی تمام حاجات پوری کرنے والا وہی ہے۔ وہ غیر فانی اور لازوال ہے۔ رزق دیتا ہے، لیتا نہیں ہے، مفرد ہے، مرکب نہیں ہے کہ قابل تجزیہ و تقسیم ہو۔ ساری کائنات پر اس کی سیادت قائم ہے اور وہ سب سے برتر ہے۔ اس لیے وہ محض صَمَد نہیں، بلکہ الصمد ہے، یعنی ایک ہی ایسی ہستی جو حقیقت میں صمدیت سے بتمام و کمال متصف ہے۔\nپھر چونکہ وہ الصمد ہے اس لیے لازم آتا ہے کہ وہ یکتا اور یگانہ ہو، کیونکہ ایسی ہستی ایک ہی ہوسکتی ہے جو کسی کی حاجتمند نہ ہو اور سب جس کے محتاج ہوں۔ دو یا زائد ہستیاں سب سے بےنیاز اور سب کی حاجت روا نہیں ہوسکتیں۔ نیز اس کے الصمد ہونے سے یہ بھی لازم آتا ہے کہ وہی ایک معبود ہو، کیونکہ انسان عبادت اسی کی کرتا ہے جس کا وہ محتاج ہو۔ اور اس سے یہ بھی لازم آتا ہے کہ اس کے سوا کوئی معبود نہ ہو، کیونکہ جو حاجت روائی کی طاقت اور اختیارات ہی نہ رکھتا ہو اس کی بندگی و عبادت کوئی ہوشمند آدمی نہیں کرسکتا۔",
    "Translation": "اللہ سب سے بے نیاز ہے اور سب اس کے محتاج ہیں۔ 4",
    "Words": " اَللّٰهُ : اللہ   |   الصَّمَدُ : بےنیاز "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "لَمْ يَلِدْ   ڏ وَلَمْ يُوْلَدْ",
    "AyahTextPdms": "لَمۡ يَلِدۡ  ۙ وَلَمۡ يُوۡلَدۡ",
    "AyahTextQalam": "لَمْ یَلِدْ١ۙ۬ وَ لَمْ یُوْلَدْۙ",
    "Id": 6334,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 37,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الإخلاص",
    "SurahNameEnglish": "Al-Ikhlaas",
    "SurahNumber": 112,
    "Tafseer": "سورة الاخلاص   5\nمشرکین نے ہر زمانے میں خدائی کا یہ تصور اختیار کیا ہے کہ انسانوں کی طرح خداؤں کی بھی کوئی جنس ہے جس کے بہت سے افراد ہیں، اور ان میں شادی بیاہ اور توالد و تناسل کا سلسلہ چلتا ہے۔ اس جاہلانہ تصور سے انہوں نے اللہ رب العالمین کو بھی پاک اور بالا تر نہیں سمجھا اور اس کے لیے بھی اولاد تجویز کی۔ چناچہ اہل عرب کا یہ عقیدہ قرآن مجید میں بیان کیا گیا ہے کہ وہ فرشتوں کو اللہ تعالیٰ کی بیٹیاں قرار دیتے تھے۔ انبیاء (علیہم السلام) کی امتیں بھی اس جہالت سے محفوظ نہ رہ سکیں۔ ان کے ہاں بھی کسی بزرگ انسان کو اللہ تعالیٰ کا بیٹا قرار دینے کا عقیدہ پیدا ہوگیا۔ ان مختلف توہمات میں دو قسم کے تصورات ہمیشہ خلط ملط ہوتے رہے ہیں۔ بعض لوگوں نے یہ سمجھا کہ جن کو وہ اللہ تعالیٰ کی اولاد قرار دے رہے ہیں وہ اس ذات پاک کی نسبی اولاد ہے۔ اور بعض نے یہ دعوی کیا کہ جس کو وہ اللہ کا بیٹا کہہ رہے ہیں اسے اللہ نے اپنا متبنی بنایا ہے۔ اگرچہ ان میں سے کسی کی یہ جرات نہیں ہوئی کہ معاذ اللہ کسی کو اللہ کا باپ قرار دیں، لیکن ظاہر ہے کہ جب کسی ہستی کے متعلق یہ تصور کیا جائے کہ وہ توالد و تناسل سے پاک نہیں ہے، اور اس کے بارے میں یہ خیال کیا جائے کہ وہ بھی انسان کی طرح اس قسم کی کوئی ہستی ہے جس کے ہاں اولاد پیدا ہوتی ہے، اور جس کو لا ولد ہونے کی صورت میں کسی کو بیٹا بنانے کی ضرورت پیش آتی ہے، تو پھر انسانی ذہن اس گمان سے محفوظ نہیں رہ سکتا کہ اسے بھی کسی کی اولاد سمجھے۔ یہی وجہ ہے کہ جو سوالات رسول اللہ (صلی اللہ علیہ وآلہ وسلم) سے پوچھے گ ٤ ے تھے ان میں ایک سوال یہ تھا کہ اللہ کا نسب کیا ہے ؟ اور دوسرا یہ کہ کس سے اس نے دنیا کی میراث پائی ہے اور کون اس کے بعد وارث ہوگا ؟ \nان جاہلانہ مفروضات کا اگر تجزیہ کیا جائے تو معلوم ہوجاتا ہے کہ منطقی طور پر بیان کو فرض کرلینے سے کچھ اور چیزوں کو بھی فرض کرنا لازم آتا ہے۔\nاول یہ کہ خدا ایک نہ ہو، بلکہ خداؤں کی کوئی جنس ہو، اور اس کے افراد خدائی اوصاف، افعال اور اختیارات میں شریک ہوں، یہ بات خدا کی صرف نسبی اولاد فرض کرلینے ہی سے لازم نہیں آتی، بلکہ کسی کو متبنی فرض کرنے سے بھی لازم آتی ہے، کیونکہ کسی کا متبنی لا محالہ اس کا ہم جنس ہی ہوسکتا ہے، اور جب معاذ اللہ وہ خدا کا ہم جنس ہے تو اس سے انکار نہیں کیا جاسکتا کہ وہ خدائی کے اوصاف بھی رکھتا ہے۔\nدوم یہ کہ اولاد کا کوئی تصور اس کے بغیر نہیں کیا جاسکتا کہ نر و مادہ میں اتصال ہو اور کوئی مادہ باپ اور ماں کے جسم سے نکل کر بچے کی شکل اختیار کرے۔ پس اللہ کے لیے اولاد فرض کرنے سے یہ بھی لازم آتا ہے کہ وہ بذات خود معاذہ اللہ فانی ہو اور باقی رہنے والی چیز خداؤں کی نسل ہو نہ کہ ذات خدا۔ نیز اس سے یہ بھی لازم آتا ہے کہ تمام فانی افراد کی طرح نعوذ باللہ خدا کی بھی کوئی ابتدا اور انتہا ہو۔ کیونکہ توالد و تناسل پر جن اجناس کے بقاء کا انحصار ہوتا ہے ان کے افراد نہ ازلی ہوتے ہیں نہ ابدی۔\nچہارم یہ کہ کسی کو متبنی بنانے کی غرض یہ ہوتی ہے کہ ایک لا ولد شخص اپنی زندگی میں کسی مددگار کا، اور اپنی وفات کے بعد کسی وارث کا حاجت مند ہوتا ہے۔ لہذا اللہ تعالیٰ کے لیے یہ فرض کرنا کہ اس نے کسی کو بیٹا بنایا ہے، اس ذات پاک کی طرف لازما وہی سب کمزوریاں منسوب کرنا ہے جو فانی اشخاص میں پائی جاتی ہیں۔\nان تمام مفروضات کی جڑ اگرچہ اللہ تعالیٰ کو احد اور الصمد کہنے سے کٹ جاتی ہے، لیکن اس کے بعد یہ ارشاد فرمانے سے کہ \" نہ اس کی کوئی اولاد ہے اور نہ وہ کسی کی اولاد \"، اس معاملہ میں کسی اشتباہ کی گنجائش بھی باقی نہیں رہتی۔ پھر چونکہ ذات باری کے حق میں یہ تصورات شرک کے اہم ترین اسباب میں سے ہیں، اس لیے اللہ تعالیٰ نے صرف سورة اخلاص ہی میں ان کی صاف صاف اور قطعی و حتمی تردید کرنے پر اکتفا نہیں فرمایا، بلکہ جگہ جگہ اس مضمون کو مختلف طریقوں سے بیان کیا ہے تاکہ لوگ حقیقت کو پوری طرح سمجھ لیں۔ مثال کے طور پر آیات ذیل ملاحظہ ہوں \n ۭاِنَّمَا اللّٰهُ اِلٰهٌ وَّاحِدٌ ۭسُبْحٰنَهٗٓ اَنْ يَّكُوْنَ لَهٗ وَلَدٌ ۘ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ (النساء، 171) \" اللہ تو بس ایک ہی خدا ہے، وہ پاک ہے اس سے کہ کوئی اس کا بیٹا ہو، جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے، سب اس کی ملک ہے۔\nاَلَآ اِنَّهُمْ مِّنْ اِفْكِهِمْ لَيَقُوْلُوْنَ ۔ وَلَدَ اللّٰهُ ۙ وَاِنَّهُمْ لَكٰذِبُوْنَ (الصافات، 151 ۔ 152) \" خوب سن رکھو، یہ لوگ دراصل اپنی من گھڑت سے یہ بات کہتے ہیں کہ اللہ اولاد رکھتا ہے۔ فی الواقع یہ قطعی جھوٹے ہیں \"۔\nوَجَعَلُوْا بَيْنَهٗ وَبَيْنَ الْجِنَّةِ نَسَـبًا ۭ وَلَقَدْ عَلِمَتِ الْجِنَّةُ اِنَّهُمْ لَمُحْضَرُوْنَ (الصافات، 158) \" انہوں نے اللہ اور فرشتوں کے درمیان نسب کا رشتہ بنا رکھا ہے، حالانکہ فرشتے خوب جانتے ہیں کہ یہ لوگ (مجرموں) کی حیثیت سے) پیش کیے جانے والے ہیں \"۔\nوَجَعَلُوْا لَهٗ مِنْ عِبَادِهٖ جُزْءًا ۭاِنَّ الْاِنْسَانَ لَكَفُوْرٌ مُّبِيْنٌ (الزخرف، 15) \" لوگوں نے اس کے بندوں میں سے بعض کو اس کا جز بنا ڈالا۔ حقیقت یہ ہے کہ انسان کھلا احسان فراموش ہے \"۔\nوَجَعَلُوْا لِلّٰهِ شُرَكَاۗءَ الْجِنَّ وَخَلَقَهُمْ وَخَرَقُوْا لَهٗ بَنِيْنَ وَبَنٰتٍۢ بِغَيْرِ عِلْمٍ ۭسُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يَصِفُوْنَ ۔ بَدِيْعُ السَّمٰوٰتِ وَالْاَرْضِ ۭ اَنّٰى يَكُوْنُ لَهٗ وَلَدٌ وَّلَمْ تَكُنْ لَّهٗ صَاحِبَةٌ ۭ وَخَلَقَ كُلَّ شَيْءٍ (الانعام، 100 ۔ 101) \" اور لوگوں نے جنوں کو اللہ کا شریک ٹھہرا دیا، حالانکہ وہ ان کا خالق ہے۔ اور انہوں نے بےجانے بوجھے اس کے لیے بیٹے اور بیٹیاں گھڑ لیں، حالانکہ وہ پاک اور بالاتر ہے ان باتوں سے جو وہ کہتے ہیں۔ وہ تو آسمانوں اور زمین کا موجود ہے۔ اس کا کوئی بیٹا کیسے ہوسکتا ہے جبکہ کوئی اس کی شریک زندگی ہی نہیں ہے، اس نے ہر چیز کو پیدا کیا ہے \"۔\nوَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَـدًا سُبْحٰنَهٗ ۭ بَلْ عِبَادٌ مُّكْرَمُوْنَ (الانبیاء، 26) \" اور ان لوگوں نے کہا کہ خدائے رحمان نے کسی کو بیٹا بنایا ہے، پاک ہے وہ، بلکہ (جن کو یہ اس کی اولاد کہتے ہیں) وہ تو بندے ہیں جنہیں عزت دی گئی ہے \"۔\nقَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ ۭ ھُوَ الْغَنِيُّ ۭ لَهٗ مَا فِي السَّمٰوٰتِ وَمَا فِي الْاَرْضِ ۭ اِنْ عِنْدَكُمْ مِّنْ سُلْطٰنٍۢ بِهٰذَا ۭ اَتَقُوْلُوْنَ عَلَي اللّٰهِ مَا لَا تَعْلَمُوْنَ (یونس، 68) \" لوگوں نے کہہ دیا کہ اللہ نے کسی کو بیٹا بنایا ہے، سبحان اللہ، وہ تو بےنیاز ہے، آسمانوں میں جو کچھ ہے اور زمین میں جو کچھ ہے سب اس کی ملک ہے۔ تمہارے پاس اس قول کی آخر دلیل کیا ہے ؟ کیا تم اللہ کے بارے میں وہ باتیں کہتے ہو جنہیں تم نہیں جانتے ؟ \"۔\nوَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ لَمْ يَتَّخِذْ وَلَدًا وَّلَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِي الْمُلْكِ وَلَمْ يَكُنْ لَّهٗ وَلِيٌّ مِّنَ الذُّلِّ (بنی اسرائیل، 111) \" اور (اے نبی) کہو، تعریف ہے اس خدا کے لیے جس نے نہ کسی کو بیٹا بنایا، نہ کوئی بادشاہی میں اس کا شریک ہے، اور نہ وہ عاجز ہے کہ کوئی اس کا پشتیبان ہو \"۔\nمَا اتَّخَذَ اللّٰهُ مِنْ وَّلَدٍ وَّمَا كَانَ مَعَهٗ مِنْ اِلٰهٍ (المومنون، 91) اللہ نے کسی کو بیٹا نہیں بنایا ہے، اور کوئی دوسرا خدا اس کے ساتھ نہیں ہے \"۔ \nان آیات میں ہر پہلو سے ان لوگوں کے عقیدے کی تردید کردی گئی ہے جو اللہ کے لیے نسبی اولاد یا متبنی بنائی ہوئی اولاد تجویز کرتے ہیں، اور اس کے غلط ہونے کے دلائل بھی بیان کردیے گئے ہیں، یہ اور اسی مضمون کی دوسری بہت سی آیات جو قرآن مجید میں، سورة اخلاص کی بہترین تفسیر کرتی ہیں۔",
    "Translation": "نہ اس کی کوئی اولاد ہے اور نہ وہ کسی کی اولاد۔ 5",
    "Words": " لَمْ يَلِدْ : نہ اس نے جنا   |    وَلَمْ يُوْلَدْ : اور نہ وہ جنا گیا "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "وَلَمْ يَكُنْ لَّهٗ كُفُوًا اَحَدٌ",
    "AyahTextPdms": "وَلَمۡ يَكُنۡ لَّهٗ كُفُوًا اَحَدٌ",
    "AyahTextQalam": "وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ۠",
    "Id": 6335,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 37,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الإخلاص",
    "SurahNameEnglish": "Al-Ikhlaas",
    "SurahNumber": 112,
    "Tafseer": "سورة الاخلاص   6\nاصل میں لفظ کُفُو استعمال ہوا ہے جس کے معنی ہیں نظیر، مشابہ، مماثل، ہم رتبہ، مساوی، نکاح کے معاملہ میں کفو کا لفظ ہماری زبان میں بھی استعمال ہوتا ہے اور اس سے مقصود یہ ہوتا ہے کہ لڑکا اور لڑکی معاشرتی حیثیت سے برابر کی جوڑ ہوں۔ پس اس آیت کا مطلب یہ ہے کہ ساری کائنات میں کوئی نہیں ہے، نہ کبھی تھا، نہ کبھی ہوسکتا ہے، جو اللہ کے مانند، یا اس کا ہم مرتبہ ہو، یا جو اپنی صفات، افعال اور اختیارات میں اس سے کسی درجہ میں بھی مشابہت رکھتا ہو۔",
    "Translation": "اور کوئی اُس کا ہمسر نہیں ہے۔ 6",
    "Words": " وَلَمْ يَكُنْ : اور نہیں ہے   |   لَّهٗ : اس کا   |   كُفُوًا : ہمسر   |   اَحَدٌ : کوئی "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6336,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ",
    "AyahTextPdms": "قُلۡ اَعُوۡذُ بِرَبِّ الۡفَلَقِۙ",
    "AyahTextQalam": "قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِۙ",
    "Id": 6337,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 38,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": "سورة الفلق   1\nچونکہ قُلْ (کہو) کا لفظ اس پیغام کا ایک حصہ ہے جو تبلیغ رسالت کے لیے نبی (صلی اللہ علیہ وآلہ وسلم) پر بذریعہ وحی نازل ہوا ہے، اس لیے اگرچہ اس ارشاد کے اولین مخاطب تو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) ہی ہیں، مگر آپ کے بعد ہر مومن بھی اس کا مخاطب ہے۔\n سورة الفلق   2\nپناہ مانگنے کے فعل میں لازم تین اجزاء شامل ہوتے ہیں۔ ایک بجائے خود پناہ مانگنا۔ دوسرے پناہ مانگنے والا۔ تیسرا وہ جس کی پناہ مانگی جائے۔ پناہ مانگنے سے مراد کسی چیز سے خوف محسوس کر کے اپنے آپ کو اس سے بچانے کے لیے کسی دوسرے کی حفاظت میں جانا، یا اس کی آڑ لینا، یا اس سے لپٹ جانا یا اس کے سایہ میں چلا جانا ہے۔ پناہ مانگنے والا بہرحال وہی شخص ہوتا ہے جو محسوس کرتا ہے کہ جس چیز سے وہ ڈر رہا ہے اس کا مقابلہ وہ خود نہیں کرسکے گا بلکہ وہ اس کا حاجت مند ہے کہ اس سے بچنے کے لیے دوسرے کی پناہ لے۔ پھر جس کی پناہ مانگی جاتی ہے وہ لازما کوئی ایسا ہی شخص یا وجود ہوتا ہے جس کے متعلق پناہ لینے والا یہ سمجھتا ہے کہ اس خوفناک چیز سے وہی اس کو بچا سکتا ہے۔ اب پناہ کی ایک قسم تو وہ ہے جو قوانین طبعی کے مطابق عالم اسباب کے اندر کسی محسوس مادی چیز یا شخص یا طاقت سے حاصل کی جاتی ہے۔ مثلا دشمن کے حملہ سے بچنے کے لیے کسی قلعہ میں پناہ لینا، یا گولیوں کی بوجھاڑ سے بچنے کے لیے خندق یا کسی دمدمے یا کسی دیوار کی آڑ لینا، یا کسی طاقتور ظالم سے بچنے کے لیے کسی انسان یا قوم یا حکومت کے پاس پناہ لینا، یا دھوپ سے بچنے کے لیے کسی درخت یا عمارت کے سایہ میں پناہ لینا۔ بخلاف اس کے دوسری قسم وہ ہے جس میں ہر طرح کے خطرات کی مادی، اخلاقی یا روحانی مضرتوں اور نقصان رساں چیزوں سے کسی فوق الفطری ہستی کی پناہ اس عقیدے کی بنا پر مانگی جاتی ہے کہ وہ ہستی عالم اسباب پر حکمراں ہے اور بالا تر از حس و ادراک طریقے سے وہ اس شخص کی ضرور حفاظت کرسکتی ہے جو اس کی پناہ ڈھونڈ رہا ہے۔ پناہ کی یہ دوسری قسم ہی نہ صرف سورة فلق اور سورة ناس میں مراد ہے بلکہ قرآن اور حدیث میں جہاں بھی اللہ تعالیٰ کی پناہ مانگنے کا ذکر کیا گیا ہے اس سے مراد یہی خاص قسم کی پناہ ہے۔ اور عقیدہ توحید کا لازمہ یہ ہے کہ اس نوعیت کا تعوذ یا استعاذہ (پناہ مانگنا) اللہ کے سوا کسی اور سے نہ کیا جائے۔ مشرکین اس نوعیت کا تحفظ اللہ کے سوا دوسری ہستیوں مثلا جنوں یا دیویوں اور دیوتاؤں سے مانگتے تھے اور آج بھی مانگتے ہیں۔ مادہ پرست لوگ اس کے لیے بھی مادی ذرائع و وسائل ہی کی طرف رجوع کرتے ہیں، کیونکہ وہ کسی فوق الفطری طاقت کے قائل نہیں ہیں۔ مگر مومن ایسی تمام آفات و بلیات کے مقابلے میں جن کو دفع کرنے پر وہ خود اپنے آپ کو قادر نہیں سمجھا، صرف اللہ کی طرف رجوع کرتا اور اسی کی پناہ مانگتا ہے، مثال کے طور پر مشرکین کے متعلق قرآن میں بیان کیا گیا ہے  وَّاَنَّهٗ كَانَ رِجَالٌ مِّنَ الْاِنْسِ يَعُوْذُوْنَ بِرِجَالٍ مِّنَ الْجِنِّ ۔ \" اور یہ کہ انسانوں میں سے کچھ لوگ جنوں میں سے کچھ لوگوں کی پناہ مانگا کرتے تھے \"۔ (الجن 6) اور اس کی تشریح کرتے ہوئے ہم سورة جن حاشیہ 7 میں حضرت عبداللہ بن عباس کی یہ روایت نقل کرچکے ہیں کہ مشرکین عرب کو جب رات کسی سنسان وادی میں گزارنی پڑتی تو وہ پکار کر کہتے \" ہم اس وادی کے رب کی (یعنی اس جن کی جو اس وادی پر حکمران ہے یا اس وادی کا مالک ہے) پناہ مانگتے ہیں \"۔ بخلاف اس کے فرعون کے متعلق فرمایا گیا ہے کہ حضرت موسیٰ کی پیش کردہ عظیم نشانیوں کو دیکھ کر فَتَوَلّٰى بِرُكْنِهٖ \" وہ اپنے بل بوتے پر اکڑ گیا \"۔ (الذاریات، 39) لیکن خدا پرستوں کا رویہ قرآن میں یہ بتایا گیا ہے کہ جس چیز کا بھی وہ خوف محسوس کرتے ہیں، خواہ وہ مادی ہو یا اخلاقی یا روحانی، اس کے شر سے بچنے کے لیے وہ خدا کی پناہ مانگتے ہیں۔ چناچہ حضرت مریم کے متعلق بیان ہوا ہے کہ جب اچانک تنہائی میں خدا کا فرشتہ ایک مرد کی شکل میں ان کے سامنے آیا (جبکہ وہ نہ جانتی تھیں کہ یہ فرشتہ ہے) تو انہوں نے کہا قالَتْ اِنِّىْٓ اَعُوْذُ بالرَّحْمٰنِ مِنْكَ اِنْ كُنْتَ تَقِيًّا۔ \" اگر تو خدا سے ڈرنے والا آدمی ہے تو میں تجھ سے خدائے رحمان کی پناہ مانگتی ہوں \" (مریم 18) حضرت نوح نے جب اللہ تعالیٰ سے ایک بےجا دعا کی اور جواب میں اللہ کی طرف سے ان پر ڈانٹ پڑی تو انہوں نے فورا عرض کیا رَبِّ اِنِّىْٓ اَعُوْذُ بِكَ اَنْ اَسْـــَٔـلَكَ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ۔ \" میرے رب میں تیری پناہ مانگتا ہوں اس بات سے کہ میں تجھ سے ایسی چیز کی درخواست کروں جس کا مجھے علم نہیں \" (ہود 47) حضرت موسیٰ نے جب بنی اسرائیل کو گائے ذبح کرنے کا حکم دیا اور انہوں نے کہا کہ آپ ہم سے مذاق کرتے ہیں، تو انہوں نے جواب میں فرمایا اَعُوْذُ باللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِيْنَ \" میں خدا کی پناہ مانگتا ہوں اس بات سے کہ جاہلوں کی سی باتیں کروں \" (البقرہ 67) \nیہی شان ان تمام تعوذات کی ہے جو رسول اللہ (صلی اللہ علیہ وآلہ وسلم) سے کتب حدیث میں منقول ہوئے ہیں۔ مثال کے طور پر حضور کی حسب ذیل دعاؤں کو ملاحظہ کیجے \nعن عائشۃ ان النبی (صلی اللہ علیہ وآلہ وسلم) کان یقول فی دعائہ اللھم انی اعوذبک من شر ما عملت ومن شر ما لم اعمل (مسلم) \" حضرت عائشہ سے روایت ہے کہ نبی (صلی اللہ علیہ وآلہ وسلم) اپنی دعاؤں میں یہ فرمایا کرتے تھے کہ \" خدایا میں تیری پناہ مانگتا ہوں ان کاموں کے شر سے جو میں نے کیے اور ان کاموں کے شر سے جو میں نے نہیں کیے \" (یعنی اگر میں نے کوئی غلط کام کیا ہے تو اس کے برے نتیجے سے پناہ مانگتا ہوں، اور اگر کوئی کام جو کرنا چاہیے تھا میں نے نہیں کیا تو اس کے نقصان سے بھی پناہ مانگتا ہوں، یا اس بات سے پناہ مانگتا ہوں کہ جو کام نہ کرنا چاہیے وہ میں کبھی کر گزروں) \" \nعن ابن عمر کان من دعاء رسول اللہ (صلی اللہ علیہ وآلہ وسلم) اللھم انی اعوذبک من زوال نعمتک، وتحول عافیتک، وفجأۃ نقمتک و جمیع سخطک۔ (مسلم) ابن عمر کی روایت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی دعاؤں میں سے ایک یہ بھی تھی کہ \" خدایا میں تیری پناہ مانگتا ہوں اس سے کہ تیری جو نعمت مجھے حاصل ہے وہ چھن جائے، اور تجھ سے جو عافیت مجھے نصیب ہے وہ نصیب نہ رہے، اور تیرا غضب یکایک ٹوٹ پڑے، اور پناہ مانگتا ہوں تیری ہر طرح کی ناراضی سے \"۔\nعن زید بن ارقم کان رسول اللہ (صلی اللہ علیہ وآلہ وسلم) یقول اللھم انی اعوذبک من علم لا ینفع ومن قلب لا یخشع ومن نفس لا تشبع ومن دعوۃ لا یستجاب (مسلم) \" زید بن ارقم کی روایت ہے کہ نبی (صلی اللہ علیہ وآلہ وسلم) فرمایا کرتے تھے \" خدایا میں تیری پناہ مانگتا ہوں اس علم سے جو نافع نہ ہو، اس دل سے جو تیرا خوف نہ کرے، اس نفس سے جو کبھی سیر نہ ہو، اور اس دعا سے جو قبول نہ کی جائے \"۔\nعن ابی ہریرہ کان رسول اللہ (صلی اللہ علیہ وآلہ وسلم) یقول اللھم انی اعوذبک من الجوع فانہ بئس الضجیع و اعوذبک من الخیانۃ فانہ بئست الطانۃ۔ (ابو داؤد) \" حضرت ابوہریرہ کی روایت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) فرماتے تھے \" خدایا میں تیری پناہ مانگتا ہوں بھوک سے کیونکہ وہ بدترین چیز ہے جس کے ساتھ کوئی رات گزارے، اور تیری پناہ مانگتا ہوں خیانت سے کیونکہ وہ بڑی بد باطنی ہے \"۔\nعن انس ان النبی (صلی اللہ علیہ وآلہ وسلم) کان یقول اللھم انی اعوذبک من البرص والجنون والجذام وسیء الاسقام (ابوداؤد) \" حضرت انس کی روایت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) فرمایا کرتے تھے \" خدایا میں تیری پناہ مانگتا ہوں کوڑھ اور جنون اور جذام اور تمام بری بیماریوں سے \"۔\nعن عائشۃ ان النبی (صلی اللہ علیہ وآلہ وسلم) کان یدعو بھؤلاء الکلمات اللھم انی اعوذبک من فتنۃ النار ومن شر الغنی والفقر (ترمذی و ابو داؤد) \" حضرت عائشہ کی روایت ہے کہ حضور ان کلمات کے ساتھ دعا مانگا کرتے تھے \" خدایا میں تیری پناہ مانگتا ہوں آگ کے فتنے سے اور مالداری اور مفلسی کے شر سے \"۔\nعن قطبۃ بن مالک کان النبی (صلی اللہ علیہ وآلہ وسلم) یقول اللھم انی اعوذبک من منکرات الاخلاق والاعمال والاھواء (ترمذی) \" قطبہ بن مالک کہتے ہیں کہ نبی (صلی اللہ علیہ وآلہ وسلم) فرمایا کرتے تھے \" خدایا میں برے اخلاق اور برے اعمال اور بری خواہشات سے تیری پناہ مانگتا ہوں \" \nشکل بن حمید نے حضور سے عرض کیا مجھے کوئی دعا بتائیے۔ فرمایا کہو \nاللھم انی اعوذبک من شر سمعی و من شر بصری و من شر لسانی ومن شر قلبی و من منیی۔ (ترمذی و ابوداؤد) \" خدایا میں تیری پناہ مانگتا ہوں اپنی سماعت کے شر سے، اور اپنی بصارت کے شر سے، اور اپنی زبان کے شر سے، اور اپنے دل کے شر سے، اور اپنی شہوت کے شر سے \"۔\nعن انس بن مالک کان رسول اللہ (صلی اللہ علیہ وآلہ وسلم) یقول اللھم انی اعوذبک من العجز والکسل والجبن والھرم والبخل و اعوذبک من عذاب القبر من فتنۃ المحیا والممات (وفی روایۃ لمسلم) و ضلع الدین و غلبۃ الرجال ( بخاری و مسلم) \" انس بن مالک کی روایت ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) فرمایا کرتے \" خدایا میں تیری پناہ مانگتا ہوں عاجزی اور سستی اور بزدلی اور بڑھاپے اور بخ سے، اور تیری پناہ مانگتا ہوں قبر کے عذاب اور زندگی و موت کے فتنے سے (اور مسلم کی ایک روایت میں یہ بھی ہے) اور قرض کے بوجھ سے اور اس بات سے کہ لوگ مجھ پر غالب ہوں \"۔\nعن خولۃ بنت حکیم السلمیۃ سمعت رسول اللہ (صلی اللہ علیہ وآلہ وسلم) یقول من نزل منزلا ثم قال اعوذ بکلمات اللہ التامات من شر ما خلق لم یضرہ شیء حتی یرتحل من ذلک المنزل (مسلم) \" خولہ بنت حکیم سلمیہ کہتی ہیں کہ میں نے رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کو یہ فرماتے سنا ہے کہ جو شخص کسی نئی منزل پر اترے اور یہ الفاظ کہے کہ \" میں اللہ کے بےعیب کلمات کی پناہ مانگتا ہوں مخلوقات کے شر سے، تو اسے کوئی چیز نقصان نہ پہنچائے گی یہاں تک کہ وہ اس منزل سے کوچ کر جائے \"۔ \nیہ حضور کے چند تعوذات بطور نمونہ ہم نے احادیث سے نقل کیے ہیں جن سے معلوم ہوتا ہے کہ مومن کا کام ہر خطرے اور شر سے خدا کی پناہ مانگنا ہے نہ کہ کسی اور کی پناہ، اور نہ اس کا یہ کام ہے کہ خدا سے بےنیاز ہو کر وہ اپنے آپ پر بھروسہ کرے۔\n سورة الفلق   3\nاصل میں لفظ رَبِّ الْفَلَقِ استعمال ہوا ہے۔ فلق کے اصل معنی پھاڑنے کے ہیں۔ مفسرین کی عظیم اکثریت نے اس سے مراد رات کی تاریکی کو پھاڑ کر سپیدی صبح نکالنا لیا ہے کیونکہ عربی زبان میں فلق الصبح کا لفظ طلوع صبح کے معنی میں بکثرت استعمال ہوتا ہے، اور قرآن میں بھی اللہ تعالیٰ کے لیے فالق الاصباح کے الفاظ استعمال ہوئے ہیں، یعنی \" وہ جو رات کی تاریکی کو پھاڑ کر صبح نکالتا ہے \" (الانعام 96) فلق کے دوسرے معنی خلق بھی لیئے گئے ہیں، کیونک دنیا میں جتنی چیزیں بھی پیدا ہوتی ہیں وہ کسی نہ کسی چیز کو پھاڑ کر نکلتی ہیں۔ تمام نباتات بیج اور زمین کو پھاڑ کر اپنی کونپل نکالتے ہیں۔ تمام حیوانات یا تو رحم مادر سے برآمد ہوتے ہیں، یا انڈا توڑ کر نکلتے ہیں، یا کسی اور مانع ظہور چیز کو چیر کر باہر آتے ہیں۔ تمام چشمے پہاڑ یا زمین کو شق کر کے نکلتے ہیں۔ دن رات کا پردہ چاک کر کے نمودار ہوتا ہے، بارش کے قطرے بادلوں کو چیر کر زمین کا رخ کرتے ہیں، غرض موجودات میں سے ہر چیز کسی نہ کسی طرح کے انشقاق کے نتیجے میں عدم سے وجود میں آتی ہے، حتی کہ زمین اور سارے آسمان بھی پہلے ایک ڈھیر تھے جس کو پھاڑ کر انہیں جدا جدا کیا گیا، كَانَتَا رَتْقًا فَفَتَقْنٰهُمَا (الانبیاء 30) پس اس معنی کے لحاظ سے فلق کا لفظ تمام مخلوقات کے لیے عام ہے۔ اب اگر پہلے معنی لیے جائیں تو آیت کا مطلب یہ ہوگا کہ میں طلوع صبح کے مالک کی پناہ لیتا ہوں۔ اور دوسرے معنی لیے جائیں تو مطلب ہوگا میں تمام خلق کے رب کی پناہ لیتا ہوں۔ اس جگہ اللہ تعالیٰ کا اسم ذات چھوڑ کر اس کا اسم صفت \" رب \" اس لیے استعمال کیا گیا ہے کہ پناہ مانگنے کے ساتھ اللہ تعالیٰ کے \" رب \" یعنی مالک و پروردگار اور آقا و مربی ہونے کی صفت زیادہ مناسبت رکھتی ہے۔ پھر رَبِّ الْفَلَقِ سے مراد اگر طلوع صبح کا رب ہو تو اس کی پناہ لینے کے معنی یہ ہوں گے کہ جو رب تاریکی کو چھانٹ کر صبح روشن نکالتا ہے میں اس کی پناہ لیتا ہوں تاکہ وہ آفات کے ہجوم کو چھانٹ کر میرے لیے عافیت پیدا کردے، اور اگر اس سے مراد بِرَبِّ خَلق ہو تو معنی یہ ہوں گے کہ میں ساری خلق کے مالک کی پناہ لیتا ہوں تاکہ وہ اپنی مخلوق کے شر سے مجھے بچائے۔",
    "Translation": "کہو، 1 میں پناہ مانگتا ہوں 2 صبح کے ربّ 3 کی",
    "Words": " قُلْ : کہدیجئے   |   اَعُوْذُ : میں پناہ میں آتا ہوں   |   بِرَبِّ : رب کی   |   الْفَلَقِ : صبح "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "مِنْ شَرِّ مَا خَلَقَ",
    "AyahTextPdms": "مِنۡ شَرِّ مَا خَلَقَۙ",
    "AyahTextQalam": "مِنْ شَرِّ مَا خَلَقَۙ",
    "Id": 6338,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 38,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": "سورة الفلق   4\nبالفاظ دیگر تمام مخلوقات کے شر سے میں اس کی پناہ مانگتا ہوں۔ اس فقرے میں چند باتیں قابل غور ہیں \nاول یہ کہ شر کو پیدا کرنے کی نسبت اللہ کی طرف نہیں کی گئی، بلکہ مخلوقات کی پیدائش کی نسبت اللہ کی طرف اور شر کی نسبت مخلوقات کی طرف کی گئی ہے۔ یعنی یہ نہیں فرمایا کہ ان شرور سے پناہ مانگتا ہوں جو اللہ نے پیدا کیے ہیں، بلکہ یہ فرمایا کہ ان چیزوں کے شر سے پناہ مانگتا ہوں جو اس نے پیدا کی ہیں۔ اس سے معلوم ہوا کہ اللہ تعالیٰ نے کسی مخلوق کو شر کے لیے پیدا نہیں کیا ہے۔ بلکہ اس کا ہر کام خیر اور کسی مصلت ہی کے لیے ہوتا ہے، البتہ مخلوقات کے اندر جو اوصاف اس نے اس لیے پیدا کیے ہیں کہ ان کی تخلیق کی مصلحت پوری ہو، ان سے بعض اوقات اور بعض اقسام کی مخلوقات سے اکثر شر رونما ہوتا ہے۔\nدوم یہ کہ اگر صرف اسی ایک فقرے پر اکتفا کیا جاتا اور بعد کے فقروں میں خاص قسم کی مخلوقات کے شرور سے الگ الگ خدا کی پناہ مانگنے کا نہ بھی ذکر کیا جاتا تو یہ فقرہ مدعا پورا کرنے کے لیے کافی تھا، کیونکہ اس میں ساری ہی مخلوقات کے شر سے خدا کی پناہ مانگ لی گئی ہے۔ اس عام اسعاذے کے بعد چند مخصوص شرور سے پناہ مانگنے کا ذکر خود بخود یہ معنی دیتا ہے کہ ویسے تو میں خدا کی پیدا کی ہوئی ہر مخلوق کے شر سے پناہ مانگتا ہوں، لیکن خاص طور پر وہ چند شرور جن کا ذکر سورة فلق کی باقی آیات اور سورة ناس میں کیا گیا ہے، ایسے ہیں جن سے خدا کی امان پانے کا میں بہت محتاج ہوں۔\nسوم یہ کہ مخلوقات کے شر سے پناہ حاصل کرنے کے لیے موزوں ترین اور موثر ترین استعاذہ اگر کوئی ہوسکتا ہے تو وہ یہ ہے کہ ان کے خالق کی پناہ مانگی جائے، کیونکہ وہ بہرحال اپنی مخلوق پر غالب ہے، اور ان کے ایسے شرور کو بھی جانتا ہے جنہیں ہم جانتے ہیں اور ایسے شرور سے بھی واقف ہے جنہیں ہم نہیں جانتے۔ لہذا اس کی پناہ گویا اس حاکم اعلی کی پناہ ہے جس کے مقابلے کی طاقت کسی مخلوق میں نہیں ہے، اور اس کی پناہ مانگ کر ہم ہر مخلوق کے ہر شر سے اپنا بچاؤ کرسکتے ہیں خواہ وہ ہمیں معلوم ہو یا نہ ہو۔ نیز اس میں دنیا ہی کے نہیں آخرت کے بھی ہر شر سے استعاذہ شامل ہے۔\nچہارم یہ کہ شرط کا لفظ نقصان، ضرر، تکلیف اور الم کے لیے بھی استعمال ہوتا ہے، اور ان اسباب کے لیے بھی جو نقصان و ضرر اور تکلیف و الم کے موجب ہوتے ہیں۔ مثلا بیماری، بھوک، کسی حادثے یا جنگ میں زخمی ہونا، آگ سے جل جانا، سانپ بچھو وغیرہ سے ڈسا جانا، اولاد کی موت کے غم میں مبتلا ہونا، اور ایسے ہی دوسرے شرور پہلے معنی میں شر ہیں۔ کیونکہ یہ بجائے خود تکلیف اور اذیت ہیں۔ بخلاف اس کے مثال کے طور پر کفر، شرک، اور ہر قسم کے گناہ اور ظلم دوسرے معنی میں شر ہیں کیونکہ ان کا انجام نقصان اور ضرر ہے اگرچہ بظاہر ان سے فی الوقت کوئی تکلیف نہ پہنچتی ہو، بلکہ بعض گناہوں سے لذت ملتی یا نفع حاصل ہوتا ہو۔ پس شر سے پناہ مانگنا ان دونوں مفہومات کا جامع ہے۔\nپنجم یہ کہ شر سے پناہ مانگنے میں دو مفہوم اور بھی شامل ہیں۔ ایک یہ کہ جو شر واقع ہوچکا ہے، بندہ اپنے خدا سے دعا مانگ رہا ہے کہ وہ اسے دفع کردے۔ دوسرے یہ کہ جو شر واقع نہیں ہوا ہے، بندہ یہ دعا مانگ رہا ہے کہ خدا مجھے اس شر سے محفوظ رکھے۔",
    "Translation": "ہر اُس چیز کے شر سے جو اُس نے پیدا کی ہے 4",
    "Words": " مِنْ شَرِّ : شر سے   |   مَا خَلَقَ : جو اس نے پیدا کیا "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ",
    "AyahTextPdms": "وَمِنۡ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ",
    "AyahTextQalam": "وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ",
    "Id": 6339,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 38,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": "سورة الفلق   5\nمخلوقات کے شر سے عموما خدا کی پناہ مانگنے کے بعد اب بعض خاص مخلوقات کے شر سے خصوصیت کے ساتھ پناہ مانگنے کی تلقین کی جارہی ہے۔ آیت میں غاسِقٍ اِذَا وَقَبَ کے الفاظ استعمال ہوئے ہیں۔ غاسق کے لغوی معنی تاریک کے ہیں۔ چناچہ قرآن میں ایک جگہ ارشاد ہوا ہے اَقِمِ الصَّلٰوةَ لِدُلُوْكِ الشَّمْسِ اِلٰى غَسَقِ الَّيْلِ \" نماز قائم کرو زوال آفتاب کے وقت سے رات کے اندھیرے تک \" (بنی اسرائیل 78) اور وقب کے معنی داخل ہونے یا چھا جانے کے ہیں۔ رات کی تاریکی کے شر سے خاص طور پر اس لیے پناہ مانگنے کی تلقین کی گئی ہے کہ اکثر جرائم اور مظالم رات ہی کے وقت ہوتے ہیں۔ موذی جانور بھی رات ہی کو نکلتے ہیں۔ اور عرب میں طوائف الملوکی کا جو حال ان آیات کے نزول کے وقت تھا اس میں تو رات بڑی خوفناک چیز تھی، اس کے اندھیرے میں چھاپہ مار نکلتے تھے اور بستیوں پر غارت گری کے لیے ٹوٹ پڑتے تھے۔ جو لوگ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کی جان کے درپے تھے وہ بھی رات ہی کے وقت آپ کو قتل کردینے کی تجویزیں سوچا کرتے تھے تاکہ قاتل کا پتہ نہ چل سکے۔ اس لیے ان تمام شرور و آفات سے خدا کی پناہ مانگنے کا حکم دیا گیا جو رات کے وقت نازل ہوتی ہیں۔ یہاں اندھیری رات کے شر سے طلوع فجر کے رب کی پناہ مانگنے میں جو لطیف مناسبت ہے وہ کسی صاحب نظر سے پوشیدہ نہیں رہ سکتی۔\nاس آیت کی تفسیر میں ایک اشکال یہ پیش آتا ہے کہ متعدد صحیح احادیث میں حضرت عائشہ کی یہ روایت آئی ہے کہ رات کو چاند نکلا ہوا تھا۔ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے میرا ہاتھ پکڑ کر اس کی طرف اشارہ کیا اور فرمایا کہ اللہ کی پناہ مگو، ھذا الفاسق اذا وقت، یعنی یہ الفاسق اذا وقتب ہے (احمد، ترمذی، نسائی، ابن جریر، ابن المنذر، حاکم، ابن مردویہ) اس کی تاویل میں بعض لوگوں نے کہا ہے کہ اِذَا وَقَبَ کا مطلب یہاں اِذَا خَسَفَ ہے، یعنی جبکہ وہ گہنا جائے یا چاند گرہن اس کو ڈھانک لے۔ لیکن کسی روایت میں بھی یہ نہیں آیا ہے کہ جس وقت حضور نے چاند کی طرف اشارہ کر کے یہ بات فرمائی تھی اس وقت وہ گرہن میں تھا۔ اور لغت عرب میں بھی اِذَا وَقَبَ کے معنی اِذَا خَسَفَ کسی طرح نہیں ہوسکتے۔ ہمارے نزدیک اس حدیث کی صحیح تاویل یہ ہے کہ چاند نکلنے کا وقت چونکہ رات ہی کو ہوتا ہے، دن کو اگر چاند آسمان پر ہوتا بھی ہے تو روشن نہیں ہوتا، اس لیے حضور کے ارشاد کا مطلب یہ ہے کہ اس کے (یعنی چاند کے) آنے کے وقت یعنی رات سے خدا کی پناہ مانگو، کیونکہ چاند کی روشنی مدافعت کرنے والے کے لیے اتنی مددگار نہیں ہوتی جتنی حملہ کرنے والے کے لیے ہوتی ہے، اور جرم کا شکار ہونے والے کے لیے اتنی مددگار نہیں ہوتی جتنی مجرم کے لیے ہوا کرتی ہے۔ اسی بنا پر حدیث میں رسول اللہ (صلی اللہ علیہ وآلہ وسلم) کا ارشاد ہے کہ ان الشمس اذا غربت انتشرت الشیاطین، فاکفتوا صبیانکم واحبسوا مواشیکم حتی تذھب فحمۃ العشاء \" جب سورج غروب ہوجائے تو شیاطین ہر طرف پھیل جاتے ہیں، لہذا اپنے بچوں کو گھروں میں سمیٹ لو اور اپنے جانوروں کو باندھ رکھو جب تک رات کی تاریکی ختم نہ ہوجائے \"۔",
    "Translation": "اور رات کی تاریکی کے شر سے جب کہ وہ چھا جائے، 5",
    "Words": " وَمِنْ شَرِّ : اور شر سے   |   غَاسِقٍ : اندھیرا   |   اِذَا وَقَبَ : جب وہ چھاجائے "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "وَمِنْ شَرِّ النَّفّٰثٰتِ فِي الْعُقَدِ",
    "AyahTextPdms": "وَمِنۡ شَرِّ النَّفّٰثٰتِ فِى الۡعُقَدِۙ",
    "AyahTextQalam": "وَ مِنْ شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِۙ",
    "Id": 6340,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 38,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": "سورة الفلق   6\nاصل الفاظ ہیں نَّفّٰثٰتِ فِي الْعُقَدِ ۔ عقد جمع ہے عقدہ کی جس کے معنی گرہ کے ہیں، جیسی مثلا تاگے یا رسی میں ڈالی جاتی ہے۔ نفث کے معنی پھونکنے کے ہیں۔ نفاثات جمع ہے نفاثہ کی جس کو اگر علامہ کی طرح سمجھا جائے تو مراد بہت پھونکنے والے مرد ہوں گے، اور اگر اسے مونث کا صیغۃ سمجھا جائے تو مراد بہت پھونکنے والی عورتیں بھی ہوسکتی ہیں، اور نفوس یا جماعتیں بھی، کیونکہ عربی میں نفس اور جماعت دونوں مونث ہیں۔ گرہ میں پھونکنے کا لفظ اکثر، بلکہ تمام تر مفسرین کے نزدیک جادو کے لیے استعارہ ہے، کیونکہ جادوگر عموما کسی ڈور یا تاگے میں گرہ دیتے اور اس پر پھونکتے جاتے ہیں۔ پس آیت کا مطلب یہ ہے کہ میں طلوع فجر کے رب کی پناہ مانگتا ہوں جادوگروں یا جادوگرنیوں کے شر سے۔ اس مفہوم کی تائید وہ روایات بھی کرتی ہیں جن میں بتایا گیا ہے کہ رسول اللہ (صلی اللہ علیہ وآلہ وسلم) پر جب جادو ہوا تھا تو جبریل (علیہ السلام) نے آکر حضور کو معوذتین پڑھنے کی ہدایت کی تھی، اور معوذتین میں یہی ایک فقرہ ہے جو براہ راست جادو سے تعلق رکھتا ہے۔ ابو مسلم اصفہانی اور زمخشری نے نفاثات فی العقد کا ایک اور مفہوم بھی بیان کیا ہے، اور وہ یہ ہے کہ اس سے مراد عورتوں کی مکاری، اور مردوں کے عزائم اور آراء اور خیالات پر ان کی اثر اندازی ہے اور اس کو جادوگری سے تشبیہ دی گئی ہے، کیونکہ عورتوں کی محبت میں مبتلا ہو کر آدمی کا وہ حال ہوجاتا ہے گویا اس پر جادو کردیا گیا ہے۔ یہ تفسیر اگرچہ پر لطف ہے، لیکن اس تفسیر کے خلاف ہے جو سلف سے مسلم چلی آتی ہے، اور ان حالات سے بھی یہ مطابقت نہیں رکھتی جن میں معوذتین نازل ہوئی ہیں، جیسا کہ ہم دیباچے میں بیان کرچکے ہیں۔\nجادو کے متعلق یہ جان لینا چاہیے کہ اس میں چونکہ دوسرے شخص پر برا اثر ڈالنے کے لیے شیاطین یا ارواح خبیثہ یا ستاروں کی مدد مانگی جاتی ہے اس لیے قرآن میں اسے کفر کہا گیا ہے  ۚ وَمَا كَفَرَ سُلَيْمٰنُ وَلٰكِنَّ الشَّيٰطِيْنَ كَفَرُوْا يُعَلِّمُوْنَ النَّاس السِّحْرَ \" سلیمان نے کفر نہیں کیا تھا بلکہ شیاطین نے کفر کیا تھا، وہ لوگوں کو جادو سکھاتے تھے \"۔ (البقرہ 102) لیکن اگر اس میں کوئی کلمہ کفر یا کوئی فعل شرک نہ بھی ہو تو وہ بالاتفاق حرام ہے اور نبی (صلی اللہ علیہ وآلہ وسلم) نے اسے سات ایسے کبیرہ گناہوں میں شمار کیا ہے جو انسان کی آخرت کو برباد کردینے والے ہیں، بخاری و مسلم میں حضرت ابوہریرہ کی روایت ہے کہ حضور نے فرمایا سات غارت گر چیزوں سے پرہیز کرو۔ لوگوں نے پوچھا وہ کیا ہیں یا رسول اللہ ؟ فرمایا خدا کے ساتھ کسی کو شریک کرنا، جادو، کسی ایسی جان کو ناحق قتل کرنا جسے اللہ نے حرام کیا ہے، سود کھانا، یتیم کا مال کھانا، جہاد میں دشمن کے مقابلہ سے پیٹھ پھیر کر بھاگ نکلنا، اور بھولی بھالی عفیف مومن عورتوں پر زنا کی تہمت لگانا۔",
    "Translation": "اور گِرہوں میں پُھونکنے والوں (یا والیوں)کے شر سے، 6",
    "Words": " وَمِنْ شَرِّ : اور شر سے   |   النَّفّٰثٰتِ : پھونکیں مارنے والیاں   |   فِي الْعُقَدِ : گرہیں "
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ",
    "AyahTextPdms": "وَمِنۡ شَرِّ حَاسِدٍ اِذَا حَسَدَ",
    "AyahTextQalam": "وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ۠",
    "Id": 6341,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 38,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الفلق",
    "SurahNameEnglish": "Al-Falaq",
    "SurahNumber": 113,
    "Tafseer": "سورة الفلق   7\nحسد کا مطلب یہ ہے کہ کسی شخص کو اللہ نے جو نعمت یا فضیلت یا خوبی عطا کی ہو اس پر کوئی دوسرا شخص جلے اور یہ چاہے کہ وہ اس سے سلب ہو کر حاسد کو مل جائے یا کم از کم یہ کہ اس سے ضرور چھن جائے۔ البتہ حسد کی تعریف میں یہ بات نہیں آتی کہ کوئی شخص یہ چاہے کہ جو فضل دوسرے کو ملا ہے وہ مجھے بھی مل جائے۔ یہاں حاسد کے شر سے اللہ تعالیٰ کی پناہ اس حالت میں مانگی گئی ہے جب کہ وہ حسد کرے، یعنی اپنے دل کی آگ بجھانے کے لیے قول یا عمل سے کوئی اقدام کرے۔ کیونکہ جب تک وہ کوئی اقدام نہیں کرتا اس وقت تک اس کا جلنا بجائے خود چاہے برا سہی، مگر محسود کے لیے ایسا شر نہیں بنتا کہ اس سے پناہ مانگی جائے۔ پھر جب ایسا شر کسی حاسد سے ظاہر ہو تو اس سے بچنے کے لیے اولین تدبیر یہ ہے کہ اللہ کی پناہ مانگی جائے۔ اس کے ساتھ حاسد کے شر سے امان پانے کے لیے چند چیزیں اور بھی مددگار ہوتی ہیں۔ ایک یہ کہ انسان اللہ پر بھروسہ کرے اور یقین رکھے کہ جب تک اللہ نہ چاہے کوئی اس کا کچھ نہیں بگاڑ سکتا۔ دوسرے یہ کہ حاسد کی باتوں پر صبر کرے، بےصبر ہو کر ایسی باتیں یا کارروائیاں نہ کرنے لگے جن سے وہ خود بھی اخلاقی طور پر حاسد ہی کی سطح پر آجائے۔ تیسرے یہ کہ حاسد خواہ خدا سے بےخوف اور خلق سے بےشرم ہو کر کیسی ہی بےہودہ حرکتیں کرتا رہے، محسود بہرحال تقوی پر قائم رہے۔ چوتھے یہ کہ اپنے دل کو اس کی فکر سے بالکل فارغ کرلے اور اس کو اس طرح نظر انداز کردے کہ گویا وہ ہے ہی نہیں۔ کیونکہ اس کی فکر میں پڑنا حاسد سے مغلوب ہونے کا پیش خیمہ ہوتا ہے۔ پانچویں یہ کہ حاسد کے ساتھ بدی سے پیش آنا تو درکنار، جب کبھی ایسا موقع آئے کہ محسوس اس کے ساتھ بھلائی اور احسان کا برتاؤ کرسکتا ہو تو ضرور ایسا ہی کرے، قطع نظر اس سے کہ حاسد کے دل کی جلن محسوس کے اس نیک رویہ سے مٹتی ہے یا نہیں۔ چھٹے یہ کہ محسود توحید کے عقیدے کو ٹھیک ٹھیک سمجھ کر اس پر ثابت قدم رہے، کیونکہ جس دل میں توحید بسی ہوئی ہو اس میں خدا کے خوف کے ساتھ کسی اور کا خوف جگہ ہی نہیں پاسکتا۔",
    "Translation": "اور حاسد کے شر سے جب کہ وہ حسد کرے۔ 7",
    "Words": " وَمِنْ شَرِّ : اور شر سے   |   حَاسِدٍ : حسد کرنے والا   |   اِذَا : جب   |   حَسَدَ : وہ حسد کرے "
},
{
    "AyahNumber": 0,
    "AyahTextMuhammadi": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ",
    "AyahTextPdms": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "AyahTextQalam": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ",
    "Id": 6342,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 1,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": null,
    "Translation": "اللہ کےنام سے جو رحمان و رحیم ہے1",
    "Words": "بِ : سے   |  اسْمِ : نام   |  اللّٰهِ : اللہ   |  ال : جو   |  رَحْمٰنِ : بہت مہربان   |  الرَّحِيمِ : جو رحم کرنے والا "
},
{
    "AyahNumber": 1,
    "AyahTextMuhammadi": "قُلْ اَعُوْذُ بِرَبِّ النَّاسِ",
    "AyahTextPdms": "قُلْ اَعُوْذُ بِرَبِّ النَّاسِ",
    "AyahTextQalam": "قُلْ اَعُوْذُ بِرَبِّ النَّاسِۙ",
    "Id": 6343,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": "کہو، میں پناہ مانگتا ہوں انسانوں کے رب",
    "Words": " قُلْ : کہدیجئے   |   اَعُوْذُ : میں پناہ میں آتا ہوں   |   بِرَبِّ النَّاسِ : لوگو کے رب کی "
},
{
    "AyahNumber": 2,
    "AyahTextMuhammadi": "مَلِكِ النَّاسِ",
    "AyahTextPdms": "مَلِكِ النَّاسِۙ",
    "AyahTextQalam": "مَلِكِ النَّاسِۙ",
    "Id": 6344,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": "انسانوں کے بادشاہ",
    "Words": " مَلِكِ : بادشاہ   |   النَّاسِ : لوگ "
},
{
    "AyahNumber": 3,
    "AyahTextMuhammadi": "اِلٰهِ النَّاسِ",
    "AyahTextPdms": "اِلٰهِ النَّاسِۙ",
    "AyahTextQalam": "اِلٰهِ النَّاسِۙ",
    "Id": 6345,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "سورة الناس   1\nیہاں بھی سورة فلق کی طرح اعوذ باللہ کہنے کے بجائے اللہ تعالیٰ کو اس کی تین صفات سے یاد کر کے اس کی پناہ مانگنے کی تلقین کی گئی ہے۔ ایک اس کا رب الناس، یعنی تمام انسانوں کا پروردگار و مربی اور مالک و آقا ہونا۔ دوسرے اس کا ملک الناس، یعنی تمام انسانوں کا بادشاہ اور حاکم و فرمانروا ہونا۔ تیسرے اس کا الہ الناس، یعنی انسانوں کا حقیقی معبود ہونا۔ (یہاں یہ بات واضح رہنی چاہیے کہ الہ کا لفظ قرآن مجید میں دو معنوں میں استعمال ہوا ہے۔ ایک وہ شے یا شخص جس کو عبادت کا کوئی استحقاق نہ پہنچتا ہو مگر عملا اس کی عبادت کی جارہی ہو۔ دوسرا وہ جسے عبادت کا استحقاق پہنچتا ہو اور جو حقیقت میں معبود ہو، خواہ لوگ اس کی عبادت کر رہے ہوں یا نہ کر رہے ہوں۔ اللہ کے لیے جہاں یہ لفظ استعمال ہوا ہے اسی دوسرے معنی میں ہوا ہے) ان تین صفات سے استعاذہ کا مطلب یہ ہوا کہ میں اس خدا کی پناہ مانگتا ہوں جو انسانوں کا رب، بادشاہ، اور معبود ہونے کی حیثیت سے ان پر کامل اقتدار رکھتا ہو، جو اپنے بندوں کی حفاظت پر پوری طرح قادر ہے، اور جو واقعی اس شر سے انسانوں کو بچا سکتا ہے جس سے خود بچنے اور دوسرے انسانوں کو بچانے کے لیے میں اس کی پناہ مانگ رہا ہوں۔ یہی نہیں بلکہ چونکہ وہی رب اور بادشاہ اور الہ ہے، اس لیے اس کے سوا اور کوئی ہے ہی نہیں جس سے میں پناہ مانگوں اور جو حقیقت میں پناہ دے بھی سکتا ہو۔",
    "Translation": "انسانوں کے حقیقی معبُود کی 1",
    "Words": " اِلٰهِ : معبود   |   النَّاسِ : لوگ "
},
{
    "AyahNumber": 4,
    "AyahTextMuhammadi": "مِنْ شَرِّ الْوَسْوَاسِ   ڏ الْخَنَّاسِ",
    "AyahTextPdms": "مِنۡ شَرِّ الۡوَسۡوَاسِ  ۙ الۡخَـنَّاسِ",
    "AyahTextQalam": "مِنْ شَرِّ الْوَسْوَاسِ١ۙ۬ الْخَنَّاسِ۪ۙ",
    "Id": 6346,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "سورة الناس   2\nاصل میں وَسْوَاسِ ڏ الْخَنَّاسِ کے الفاظ استعمال ہوئے ہیں۔ وسو اس کے معنی ہیں بار بار وسوسہ ڈالنے والا۔ اور وسوسے کے معنی ہیں پے در پے ایسے طریقے یا طریقوں سے کسی کے دل میں کوئی بری بات ڈالنا کہ جس کے دل میں وہ ڈالی جارہی ہو اسے یہ محسوس نہ ہوسکے کہ وسوسہ انداز اس کے دل میں ایک بری بات ڈال رہا ہے۔ وسوسے کے لفظ میں کود تکرار کا مفہوم شامل ہے، جیسے زلزلہ میں حرکت کی تکرار کا مفہوم شامل ہے۔ چونکہ انسان صرف ایک دفعہ بہکانے سے نہیں بہکتا بلکہ اسے بہکانے کی پے در پے کوشش کرنی ہوتی ہے، اس لیے ایسی کوشش کو وسوسہ اور کوشش کرنے والے کو وسو اس کہا جاتا ہے۔ رہا لفظ خناس تو یہ خنوس سے ہے جس کے معنی ظاہر ہونے کے بعد چھپنے یا آنے کے بعد پیچھے ہٹ جانے کے ہیں، اور خناس چونکہ مبالغہ کا صیغہ ہے اس لیے اس کے معنی یہ فعل بکثرت کرنے والے کے ہوئے۔ اب یہ ظاہر بات ہے کہ وسوسہ ڈالنے والے کو بار بار وسوسہ اندازی کے لیے آدمی کے پاس آنا پڑتا ہے، اور ساتھ ساتھ جب اسے خناس بھی کہا گیا تو دونوں الفاظ کے ملنے سے خودبخود یہ مفہوم پیدا ہوگیا کہ وسوسہ ڈال ڈال کر وہ پیچھے ہٹ جاتا ہے اور پھر پے در پے وسوسہ اندازی کے لیے پلٹ کر آتا ہے۔ بالفاظ دیگر ایک مرتبہ وسوسہ اندازی کی کوشش جب ناکام ہوتی ہے تو وہ چلا جاتا ہے، پھر وہی کوشش کرنے کے لیے دوبارہ، سہ بارہ اور بار بار آتا رہتا ہے۔\nوسو اس الخناس کا مطلب سمجھ لینے کے بعد اب اس بات پر غور کرنا چاہیے کہ اس کے شر سے پناہ مانگنے کا مطلب کیا ہے ؟ اس کا ایک مطلب تو یہ ہے کہ پناہ مانگنے والا خود اس کے شر سے خدا کی پناہ مانگتا ہے، یعنی اس شر سے کہ وہ کہیں اس کے اپنے دل میں کوئی وسوسہ نہ ڈال دے۔ دوسرا مطلب یہ ہے کہ اللہ کے راستے کی طرف دعوت دینے والے کے خلاف جو شخص بھی لوگوں کے دلوں میں وسوسے ڈالتا پھرے اس کے شر سے داعی حق خدا کی پناہ مانگتا ہے۔ داعی الی الحق کے بس کا یہ کام نہیں ہے کہ اس کی ذات کے خلاف جن جن لوگوں کے دلوں میں وسوسے ڈالے جارہے ہوں ان سب تک خود پہنچے اور ایک ایک شخص کی غلط فہمیوں کو صاف کرے۔ اس کے لیے یہ بھی مناسب نہیں ۃ ے کہ اپنی دعوت الی اللہ کا کام چھوڑ چھاڑ کر وسوسہ اندازوں کی پیدا کردہ غلط فہمیوں کو صاف کرنے اور ان کے الزامات کی جواب دہی کرنے میں لگ جائے۔ اس کے مقام سے یہ بات بھی فروتر ہے کہ جس سطح پر اس کے مخالفین اترے ہوئے ہیں اسی پر خود بھی اتر آئے۔ اس لیے اللہ تعالیٰ نے دعوت حق دینے والے کو ہدایت فرمائی کہ ایسے اشرار کے شر سے بس خدا کی پناہ مانگ لے اور پھر بےفکری کے ساتھ اپنی دعوت کے کام میں لگا رہ۔ اس کے بعد ان سے نمٹنا تیرا کام نہیں بلکہ رب الناس، ملک الناس اور الہ الناس کا کام ہے۔\nاس مقام پر یہ بھی سمجھ لینا چاہیے کہ وسوسہ عمل شر کا نقطہ آغاز ہے۔ وہ جب ایک غافل یا خالی الذہن آدمی کے اندر اثر انداز ہوجاتا ہے تو پہلے اس میں برائی کی خواہش پیدا ہوتی ہے۔ پھر مزید وسوسہ اندازی اس بری خواہش کو بری نیت اور برے ارادے میں تبدیل کردیتی ہے۔ پھر اس سے آگے جب وسوسے کی تاثیر بڑھتی ہے تو ارادہ عزم بن جاتا ہے اور آخری قدم پر پھر عمل شر ہے۔ اس لیے وسوسہ انداز کے شر سے خدا کی پناہ مانگنے کا مطلب یہ ہے کہ شر کا آغاز جس مقام سے ہوتا ہے اللہ تعالیٰ اسی مقام پر اس کا قلع قمع فرمادے۔\nدوسرے لحاظ سے اگر دیکھا جائے تو وسوسہ اندازوں کے شر کی ترتیب یہ نظر آتی ہے کہ پہلے وہ کھلے کھلے کفر، شرک، دہریت، یا اللہ اور رسول سے بغاوت اور اللہ والوں کی عداوت پر اکساتے ہیں۔ اس میں ناکامی ہو اور آدمی دین اللہ میں داخل ہی ہوجائے تو وہ اسے کسی نہ کسی بدعت کی راہ سمجھاتے ہیں یہ بھی نہ ہوسکے تو معصیت کی رغبت دلاتے ہیں۔ اس میں بھی کامیابی نہ ہوسکے تو آدمی کے دل میں یہ خیال ڈالتے ہیں کہ چھوٹے چھوٹے گناہ کرلینے میں تو کوئی مضائقہ نہیں تاکہ یہی اگر کثرت سے صادر ہوجائیں تو گناہوں کا بار عظیم انسان پر لد جائے۔ اس سے بھی اگر آدمی بچ نکلے تو بدرجہ آخر وہ کوشش کرتے ہیں کہ آدمی دین حق کو بس اپنے آپ تک ہی محدود رکھے، اسے غالب کرنے کی فکر نہ کرے، لیکن اگر کوئی شخص ان تمام چالوں کو ناکام کردے تو پھر شیاطین جن و انس کی پوری پارٹی ایسے آدمی پر پل پڑتی ہے، اس کے خلاف لوگوں کو اکساتی اور بھڑکاتی ہے، اس پر گالیوں اور الزامات کی بوجھاڑ کراتی ہے، اسے ہر طرف بدنام اور رسوا کرنے کی کوشش کرتی ہے۔ پھر شیطان اس مرد مومن کو آکر غصہ دلاتا ہے اور کہتا ہے کہ یہ سب کچھ برداشت کرلینا تو بڑی بزدلی کی بات ہے، اٹھ اور ان حملہ آوروں سے بھڑ جا۔ یہ شیطان کا آخری حربہ ہے جس سے وہ دعوت حق کی رہ کھوٹی کرانے اور داعی حق کو راہ کے کانٹوں سے الجھا دینے کی کوشش کرتا ہے۔ اس سے بھی اگر داعی حق بچ نکلے تو شیطان اس کے آگے بےبس ہوجاتا ہے۔ یہی وہ چیز ہے جس کے متعلق قرآن مجید میں ارشا ہوتا ہے وَاِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ باللّٰهِ \" اور اگر شیطان کی طرف سے تمہیں کوئی اکساہٹ محسوس ہو تو اللہ کی پناہ مانگو \" (الاعراف 200 ۔ حم السجدہ 36) وَقُلْ رَّبِّ اَعُوْذُ بِكَ مِنْ هَمَزٰتِ الشَّيٰطِيْنِ \" کہو میرے پروردگار میں شیطانین کی اکساہٹوں سے تیری پناہ مانگتا ہوں \" (المومنون 97) اِنَّ الَّذِيْنَ اتَّقَوْا اِذَا مَسَّهُمْ طٰۗىِٕفٌ مِّنَ الشَّيْطٰنِ تَذَكَّرُوْا فَاِذَا هُمْ مُّبْصِرُوْنَ \" جو لوگ پرہیزگار ہیں ان کا حال تو یہ ہوتا ہے کہ کبھی شیطان کے اثر سے کوئی برا خیال انہیں چھو بھی جائے تو وہ فورا چونک جاتے ہیں اور پھر انہیں (صحیح راستہ) صاف نظر آنے لگتا ہے \" (الاعراف 201) اور اسی بنا پر جو لوگ شیطان کے اس آخری حربے سے بچ نکلیں ان کے بارے میں اللہ تعالیٰ کا ارشاد ہے وَمَا يُلَقّٰىهَآ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ \" یہ چیز بڑے نصیبے والے کے سوا کسی کو حاصل نہیں ہوتی \" (حم السجدہ 35)\nاس سلسلے میں ایک بات اور بھی نگاہ میں رہنی چاہیے۔ وہ یہ کہ انسان کے دل میں وسوسہ اندازی صرف باہر سے شیاطین جن و انس ہی نہیں کرتے بلکہ اندر سے کود انسان کا اپنا نفس بھی کرتا ہے۔ اس کے اپنے غلط نظریات اس کی عقل کو گمراہ کرتے ہیں۔ اس کی اپنی ناجائز اغراض و خواہشات اس کی قوت تمیز اور قوت ارادی اور قوت فیصلہ کو بد راہ کرتی ہیں۔ اور باہر کے شیاطین ہی نہیں، انسان کے اندر اس کے اپنے نفس کا شیطان بھی اس کو بہکاتا ہے۔ یہی بات ہے جو قرآن میں ایک جگہ فرمائی گئی ہے کہ وَنَعْلَمُ مَا تُوَسْوِسُ بِهٖ نَفْسُهٗ (ق، 16) اور ہم اس کے اپنے نفس سے ابھرنے والے وسوسوں کو جانتے ہیں \"۔ اسی بنا پر رسول اللہ (صلی اللہ علیہ وآلہ وسلم) نے اپنے مشہور خطبہ مسنونہ میں فرمایا ہے نعوذ باللہ من شرور انفسنا \" ہم اللہ کی پناہ مانگتے ہیں اپنے نفس کی شرارتوں سے \"۔",
    "Translation": "اُس وسوسہ ڈالنے والے کے شر سے جو بار بار پلٹ کر آتا ہے، 2",
    "Words": " مِنْ شَرِّ : شر سے   |   الْوَسْوَاسِ : وسوسہ ڈالنے والے   |    الْخَنَّاسِ : چھپ چھپ کر حملہ کرنے والے "
},
{
    "AyahNumber": 5,
    "AyahTextMuhammadi": "الَّذِيْ يُوَسْوِسُ فِيْ صُدُوْرِ النَّاسِ",
    "AyahTextPdms": "الَّذِىۡ يُوَسۡوِسُ فِىۡ صُدُوۡرِ النَّاسِۙ",
    "AyahTextQalam": "الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِۙ",
    "Id": 6347,
    "ParahNumber": 30,
    "Ruku": 0,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "",
    "Translation": "جو لوگوں کے دلوں میں وسوسے ڈالتا ہے",
    "Words": " الَّذِيْ يُوَسْوِسُ : جو وسوسہ ڈالتا ہے   |   فِيْ : میں   |   صُدُوْرِ النَّاسِ : لوگوں کے دلوں "
},
{
    "AyahNumber": 6,
    "AyahTextMuhammadi": "مِنَ الْجِنَّةِ وَالنَّاسِ",
    "AyahTextPdms": "مِنَ الۡجِنَّةِ وَالنَّاسِ",
    "AyahTextQalam": "مِنَ الْجِنَّةِ وَ النَّاسِ۠",
    "Id": 6348,
    "ParahNumber": 30,
    "Ruku": 1,
    "RukuParahNumber": 39,
    "RukuSurahNumber": "1",
    "Sajda": 0,
    "SurahName": "الناس",
    "SurahNameEnglish": "An-Naas",
    "SurahNumber": 114,
    "Tafseer": "سورة الناس   3\nبعض اہل علم کے نزدیک ان الفاظ کا مطلب یہ ہے کہ وسوسہ ڈالنے والا دو قسم کے لوگوں کے دلوں میں وسوسہ ڈالتا ہے، ایک جن، دوسرے انسان۔ اس بات کو اگر تسلیم کیا جائے تو لفظ ناس کا اطلاق جن اور انسان دونوں پر ہوگا۔ وہ کہتے ہیں ایسا ہوسکتا ہے، کیونکہ قرآن میں جب رجال (مردوں) کا لفظ جنوں کے لیے استعمال ہوا ہے، جیسا کہ سورة جن آیت 6 میں ہم دیکھتے ہیں، اور جب نَفَر کا استعمال جنوں کے گروہ پر ہوسکتا ہے جیسا کہ سورة احقاف آیت 29 میں ہوا ہے، تو مجازا ناس کے لفظ میں بھی انسان اور جن دونوں شامل ہوسکتے ہیں۔ لیکن یہ رائے اس لیے غلط ہے کہ ناس اور انس اور انسان کے الفاظ لغت ہی کے اعتبار سے لفظ جن کی ضد ہیں۔ جن کے اصل معنی پوشیدہ مخلوق کے ہیں اور جن کو جن اسی بنا پر کہا جاتا ہے کہ وہ انسانی آنکھ سے مخفی ہے۔ اس کے برعکس ناس اور انس کے الفاظ انسان کے لیے بولے ہی اس بنا پر جاتے ہیں کہ وہ ظاہر اور مرئی اور محسوس ہے۔ سورة قصس آیت 29 میں ہے اٰنَسَ مِنْ جَانِبِ الطُّوْرِ ۔ یہاں آنَسَ کے معنی رَاَی ہیں، یعنی حضرت موسیٰ نے \" کوہ طور کے کنارے آگ دیکھی \"۔ سورة نساء آیت 6 میں ہے فَاِنْ اٰنَسْتُمْ مِّنْھُمْ رُشْدًا۔ \" اگر تم محسوس کرو کہ یتیم بچے اب ہوشمند ہوگئے ہیں \"۔ یہاں انستم کے معنی احسستم یا رایتم ہیں۔ پس ناس کا اطلاق لغت عرب کی رو سے جنوں پر نہیں ہوسکتا، اور آیت کے صحیح معنی یہ ہیں کہ \" اس وسوسہ انداز کے شر سے جو انسانوں کے دلوں میں وسوسے ڈالتا ہے، خواہ وہ جنوں میں سے ہو یا خود انسانوں میں سے \"۔ یعنی دوسرے الفاظ میں وسوسہ اندازی کا کام شیاطین جن بھی کرتے ہیں اور شیاطین انس بھی، اور دونوں کے شر سے پناہ مانگنے کی اس سورة میں تلقین کی گئی ہے۔ اس معنی کی تائید قرآن سے بھی ہوتی ہے اور حدیث سے بھی۔ قرآن میں فرمایا \nوَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَـيٰطِيْنَ الْاِنْسِ وَالْجِنِّ يُوْحِيْ بَعْضُهُمْ اِلٰى بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُوْرًا (الانعام، 112) \" اور اسی طرح ہم نے ہر نبی کے لیے شیطان جنوں اور شیطان انسانوں کو دشمن بنادیا ہے جو ایک دوسرے پر خوش آیند باتیں دھوکے اور فریب کے طور پر القا کرتے ہیں \"۔\nاور حدیث میں امام احمد، نسائی اور ابن حبان حضرت ابوذر کی روایت نقل کرتے ہیں کہ میں نبی (صلی اللہ علیہ وآلہ وسلم) کی خدمت میں حاضر ہوا۔ آپ مسجد میں تشریف فرما تھے۔ فرمایا ابوذر تم نے نماز پڑھی ؟ میں نے عرض کیا نہیں۔ فرمایا اٹھو اور نماز پڑھو۔ چناچہ میں نے نماز پڑھی اور پھر آکر بیٹھ گیا۔ حضور نے فرمایا یا ابا ذر، تعوذ باللہ من شر شیاطین الانس والجن، \" اے ابوذر شیاطین انس اور شیاطین جن کے شر سے اللہ کی پناہ مانگو \" میں نے عرض کیا یا رسول اللہ، کیا انسانوں میں بھی شیطان ہوتے ہیں ؟ فرمایا ہاں۔",
    "Translation": "خواہ وہ جِنّوں میں سے ہو یا انسانوں میں سے۔ 3",
    "Words": " مِنَ الْجِنَّةِ : جنوں میں سے   |   وَالنَّاسِ : اور انسان "
}
]